{"approved_at_utc": null, "selftext": "Memes are hilarious, love that shit, but there was a time when WSB had stories like this:\n\n&#x200B;\n\n>Before 1776, you didn’t need to know math and shit to understand economics. Because back then, if a country was 1/3 of the world’s population (like India in year 1 AD), it was 1/3 of the global economy.  And if a country had 1/4 of the world’s population (like China at the time), it was 1/4 of the global economy. Because before tractors and electricity and shit were invented during the industrial revolution, which was in full swing by 1776, a motherfucker could only hunt or gather or grow so much shit on any given plot of land. If a country ran out of land, it ran out of food, and its people starved, which kept both population and economic growth in check. And that explains all that old world raping and pillaging and conquering of land, because up to that point, economic growth meant one thing, more land.  \n>  \n>But after the industrial revolution, a motherfucker could grow or produce a shit-ton more on any given plot of land, which meant if you could out-think and out-machine the other guy, you could make legit fuck-you cash money without a crown or an army, which was some new shit at the time. And to explain all this, in 1776 Adam Smith wrote a book called An Inquiry into the Nature and Causes of the Wealth of Nations and invented economics. And thank god for that, because for roughly 300,000 years before Smiths book, people believed that successful crops and hunts and shit was the work of the gods. What Smith taught us is that economic production in the post-industrial era is not the work of god, but instead the the work of invisible hands. And this changed everything.  \n>  \n>It just so happened that the same year Smith invented economics, the United States of America was invented, a frontier refuge for wild-eyed fortune seekers and reject religious mystics, and in America all that new money magic found one fuck of a home. And for the next hundred years or so, Americans went ape shit building their country while experimenting with all this new money magic, hustling and slaughtering their way across the Wild West to the Pacific Ocean leaving a trail of over 1000 banks and more than 8000 different paper currencies.  \n>  \n>But by 1849, with no more land to settle, everyone realized that the US paper money situation was out of control and what the world really needed was some kinda universal non-bullshit currency everyone could agree on. And fuck, it just so happened gold was discovered in California that year, and thats some shiny-ass universal cash-money bling everyone could agree on.  \n>  \n>So for the next hundred years, as the rest of the old world warred themselves broke killing each other over land all old school like, America built new and improved machines and hoarded gold until finally, by the end of WWII, America totally owned that shit and became the pimp daddy boss-man of global money. I mean, America had most of the worlds gold which meant America had all the money in the world. So to seal the deal, in 1944 the US invited all those broke-ass bitch money countries to a hotel in Bretton Woods, New Hampshire and explained how global money shit was gonna work moving forward: the US would own and manage the worlds gold supply and set the price of gold and peg the US dollar to gold which they alone would exclusively control. Meanwhile everyone else would peg their bitch-ass money to the dollar. Or they were commies, in which case, they still had to peg their money to dollars if they wanted to buy the shit they needed from the west, but only after converting it at shitty exchange rates on the black market. And the rest of the world, seeing how their paper shit compared to all that US gold, they were like, cool.  \n>  \n>With all the worlds money newly interconnected and global, shit got really fucking complicated. Thankfully, to explain it all, in 1934 a dude named John Maynard Keynes wrote the The General Theory of Employment, Interest and Money and invented macro economics, which, compared to Adam Smith, was like the New Testament of money: same God, different rules.  \n>  \n>Or maybe exactly like that. I mean, what does it say on the US dollar. It says “in God we trust”. Fuck, the US constitution doesn’t even say that. This was some holy fucking shit they were dealing with and they knew it. So taking a page from Ancient Rome, in 1913 the US Congress built 13 stone columned temples across the land to house a select group of non-elected financial holy men to guide the magic hands. This was called The Federal Reserve Bank of the United States of America, and to this day, that’s where we go to pray when money shit gets really fucked up in the world.  \n>  \n>In the decades that followed WWII, shit was pretty good in the USA and Americans spent like fat-ass type-2 diabetic SSRI-happy sun-burnt Florida Lottery winners. Which was fucking great for a while, but by the early 1970’s, the debt started to pile up. And well, everyone knows the 70’s was a total shit decade in American history. In fact, by the early 70’s, the country was a fucking mess, unemployment was 6.1%, and inflation (some old-school economic shit you can Google), was 6.2%. Which would suck for any US President to deal with, especially in an election year. Because dealing with a troubled economy requires leadership and sacrifice, which is a hard sell to American voters in the best of times and imfuckingpossible for a dude like Richard Milhous Nixon. So after months of praying to the Fed for a re-election miracle, Nixon had an idea. Well, it wasn’t really his idea, it was something his 42 year-old Undersecretary of the Treasury for Monetary Affairs, a guy by the name of Paul Volcker, had been pitching for a while. Basically, Volcker realized that the US was the pimp-daddy of all the worlds money, which meant US money was the only game in town, which meant the US treasury could wipe their ass with newly printed dollars and the world would still pimp their sisters to get their dirty little war-torn broke-ass fingers on the shit. So fuck, why back the money with gold? That shit was just a whole lotta extra work, what with all that settling of account balances and interest rates and shit. Fuck that.  \n>  \n>You get the point, and so did Nixon. He was a fucking hustler at heart plus he was the fucking President of the United States and if Volcker was right, de-pegging the dollar to gold would mean he could manipulate the fuck out of the invisible hands. Like printing billions or paper dollars to distribute to smart-money Wall Street campaign donors to “invest” in stocks and jack up asset prices putting a few imaginary paper dollars in the pockets of struggling main-Street dumb money investor-voters, or debase the value of US money just enough to drive down prices of shit-rate US exports to win back market share from Germany and Japan.  \n>  \n>But just one problem, Fed Chair Arthur Burns who was like, wait, what?  \n>  \n>Ok, so here’s the thing, Nixon was a fucking sleazeball who would give zero fucks to just bulldozing those sanctimonious unelected Fed motherfuckers. But 1973 was an election year and he needed a story to trash a century old global economic order. I mean, what he really needed was an enemy, some fucking non-English speaking Illuminati motherfucker lurking in the shadows and threatening American jobs, because Americans eat that shit up. So in August 1971, Nixon took to prime time television and announced to an Aaron Spelling-loving TV-dinner-eating Vietnam-weary America that “International money speculators” were destroying the value of he dollar and costing American jobs. Which may seem like some obvious fucking ludicrous-mode political bullshit, but in the early 70s, shit was legit hard economically for a lot of Americans. And politicians understand that shit because at that level, when you get to be president, rule number one is that when shit is both mysterious and fucked up, never try and explain it - leave that shit to the losing party - instead find a villain and tell your people how you’re gonna fuck that motherfucker up. That pretty much always works. Because the universe is as much a fucking mystery today as it has been for over 300,000 years, a complex system that our pleasure-seeking, story-telling monkey brains are not wired to understand. Unemployment? Inflation? Fuck, we still can’t explain that shit. We are wired to survive in the wilderness and we know a threat when we see it, which is some primal brain hard-coded survival shit, like a rustle in the bush beyond the light of the campfire, it gets our hearts beating and bonds us as a tribe behind the dude with the biggest club. Until he gets eaten by fucking bears. But whatever, in the moment we’ll believe whatever he fuck he says. And what Nixon said was that we can’t trust money to both gold and god. We had to chose. So he de-coupled the dollar from gold and henceforth, and to this day, money became faith.  \n>  \n>The day after the Nixon announcement, the Dow rose 33 points, its biggest daily gain ever at that point. A New York Times editorial read, \"We unhesitatingly applaud the boldness with which the President has moved.\" Which may have been “bold” and all, but it was also a fucking disaster. In the two years that followed, gold rose nearly 300%, from 43 to over 120, and the US suffered three quarters of negative GDP growth while unemployment exceeded 9% and inflation nearly doubled, hovering in the range of 10-12%, prompting global currencies to go all ape-shit searching for some semblance of fair market value in the hunger-games free for all that was the post gold global economy.  \n>  \n>But fuck, that was one fuck of a good time to be trading currencies. Which brings us, fuck finally, to the trade...  \n>  \n>A few years later, Andy Krieger was a graduate student in South Asian philosophy and a competitive athlete at Penn, committed to making the world a better place.  Aw. But one morning, after a long night translating some obscure Sanskrit text, he got to thinking: academia is a fucking slog, the kind of job where you had to wait for some old bearded wizard to die to get ahead. So the next day he met with his dissertation advisor and announced that he was gonna drop out of the graduate program and enroll at Wharton to translate the ancient mysteries of money. And with the world just starting to make sense of all the newly floated currencies and all kinds of crazy new financial instruments like options, Krieger was instantly hooked.  \n>  \n>This was 1984, and few traders know what a currency option was, let alone how to price one. Black Sholes was a new-new thing and computers were non-existent.  But Krieger saw the potential of all this shit and knew he could use these instruments in a very powerful way so while still a student, he joined a  Chicago options trading firm and learned the ropes and after returning to Wharton, he wrote a computer program to price options that relied on assumptions no one else was thinking about at the time. This got him noticed by Solomon Brothers and then Bankers Trust.  And there, after a run of hugely profitable trades no one really understood, in 1987, the CEO of Bankers Trust gave him $700m to trade.  And fuck me, with option leverage, this meant next-level shit tons of billions.  \n>  \n>On October 19th, 1987, on what became known as Black Monday, the DJIA fell 22.6%, the largest single day percentage drop in history.  But Krieger was cool.  He watched the world dump dollars and flood into alternative currencies, many of which were small and tied to struggling economies.  But Krieger knew this was a panic flight to anywhere but the Wall Street carnage. He also knew that as soon as the markets settled, the fast money would head right back to the safety of the dollar and their currencies would revert.  So with $700m and 400:1 leverage, Krieger placed his bets, the largest of which was a short against the New Zealand dollar (the Kiwi), eventually taking a position greater than the entire New Zealand monetary supply. And fuck, at the same time, Krieger had complex positions in the British Pound and the German Mark and even another short in the USD.  At any given time, Krieger had over $40B in trades in float fluctuating over $20m in value at any given time.  \n>  \n>And then, with markets swinging wildly, as the Kiwi drops just 5% against the dollar, Krieger exits everything for a profit of $300m. Fuck.  \n>  \n>After exiting the trade, with Wall Street a walking-dead financial dystopia, Krieger quit the game completely and retired to some island in the Caribbean. In the aftermath, regulators started to poke around at the one bank who booked a profit, based entirely on Krieger’s trading while Wall Street melted and an accounting scandal ensued involving Arthur Anderson, the auditor of Bankers Trust, which you could literally cut and past into the post-Enron economy of 2001. Meanwhile, the New Zealand government was crying foul publicly while privately counting their Kiwi blessings that Krieger had successfully tanked their money making NZ exports competitive on the global market. At the time it was a total money shit show, as quaint as that may seem today.  \n>  \n>In the years that followed, Soros did the same kind of shit and made $1B breaking the Bank of England and then a shit-ton more shorting the Thai Baht. And there were other cool-ass macro money mega trades but by the late 90s, all that shit came to an end as the central banks came to realize what the politicians had long known: when some threat creeps in from the economic wilderness and shit gets crazy and mysterious, our monkey brains turn to the dudes with the biggest club. And central banks have the big clubs. Until they get eaten by bears. But so far, that hasn’t happened.\n\nu/cantedlight, come back and bless us with more history lessons that an autist can actually understand", "author_fullname": "t2_omqfq", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Bring Storytelling back! OG WSB", "link_flair_richtext": [{"e": "text", "t": "News"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "news", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_krgbfy", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.99, "author_flair_background_color": null, "subreddit_type": "public", "ups": 46, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "News", "can_mod_post": false, "score": 46, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1609936253.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Memes are hilarious, love that shit, but there was a time when WSB had stories like this:</p>\n\n<p>&#x200B;</p>\n\n<blockquote>\n<p>Before 1776, you didn’t need to know math and shit to understand economics. Because back then, if a country was 1/3 of the world’s population (like India in year 1 AD), it was 1/3 of the global economy.  And if a country had 1/4 of the world’s population (like China at the time), it was 1/4 of the global economy. Because before tractors and electricity and shit were invented during the industrial revolution, which was in full swing by 1776, a motherfucker could only hunt or gather or grow so much shit on any given plot of land. If a country ran out of land, it ran out of food, and its people starved, which kept both population and economic growth in check. And that explains all that old world raping and pillaging and conquering of land, because up to that point, economic growth meant one thing, more land.  </p>\n\n<p>But after the industrial revolution, a motherfucker could grow or produce a shit-ton more on any given plot of land, which meant if you could out-think and out-machine the other guy, you could make legit fuck-you cash money without a crown or an army, which was some new shit at the time. And to explain all this, in 1776 Adam Smith wrote a book called An Inquiry into the Nature and Causes of the Wealth of Nations and invented economics. And thank god for that, because for roughly 300,000 years before Smiths book, people believed that successful crops and hunts and shit was the work of the gods. What Smith taught us is that economic production in the post-industrial era is not the work of god, but instead the the work of invisible hands. And this changed everything.  </p>\n\n<p>It just so happened that the same year Smith invented economics, the United States of America was invented, a frontier refuge for wild-eyed fortune seekers and reject religious mystics, and in America all that new money magic found one fuck of a home. And for the next hundred years or so, Americans went ape shit building their country while experimenting with all this new money magic, hustling and slaughtering their way across the Wild West to the Pacific Ocean leaving a trail of over 1000 banks and more than 8000 different paper currencies.  </p>\n\n<p>But by 1849, with no more land to settle, everyone realized that the US paper money situation was out of control and what the world really needed was some kinda universal non-bullshit currency everyone could agree on. And fuck, it just so happened gold was discovered in California that year, and thats some shiny-ass universal cash-money bling everyone could agree on.  </p>\n\n<p>So for the next hundred years, as the rest of the old world warred themselves broke killing each other over land all old school like, America built new and improved machines and hoarded gold until finally, by the end of WWII, America totally owned that shit and became the pimp daddy boss-man of global money. I mean, America had most of the worlds gold which meant America had all the money in the world. So to seal the deal, in 1944 the US invited all those broke-ass bitch money countries to a hotel in Bretton Woods, New Hampshire and explained how global money shit was gonna work moving forward: the US would own and manage the worlds gold supply and set the price of gold and peg the US dollar to gold which they alone would exclusively control. Meanwhile everyone else would peg their bitch-ass money to the dollar. Or they were commies, in which case, they still had to peg their money to dollars if they wanted to buy the shit they needed from the west, but only after converting it at shitty exchange rates on the black market. And the rest of the world, seeing how their paper shit compared to all that US gold, they were like, cool.  </p>\n\n<p>With all the worlds money newly interconnected and global, shit got really fucking complicated. Thankfully, to explain it all, in 1934 a dude named John Maynard Keynes wrote the The General Theory of Employment, Interest and Money and invented macro economics, which, compared to Adam Smith, was like the New Testament of money: same God, different rules.  </p>\n\n<p>Or maybe exactly like that. I mean, what does it say on the US dollar. It says “in God we trust”. Fuck, the US constitution doesn’t even say that. This was some holy fucking shit they were dealing with and they knew it. So taking a page from Ancient Rome, in 1913 the US Congress built 13 stone columned temples across the land to house a select group of non-elected financial holy men to guide the magic hands. This was called The Federal Reserve Bank of the United States of America, and to this day, that’s where we go to pray when money shit gets really fucked up in the world.  </p>\n\n<p>In the decades that followed WWII, shit was pretty good in the USA and Americans spent like fat-ass type-2 diabetic SSRI-happy sun-burnt Florida Lottery winners. Which was fucking great for a while, but by the early 1970’s, the debt started to pile up. And well, everyone knows the 70’s was a total shit decade in American history. In fact, by the early 70’s, the country was a fucking mess, unemployment was 6.1%, and inflation (some old-school economic shit you can Google), was 6.2%. Which would suck for any US President to deal with, especially in an election year. Because dealing with a troubled economy requires leadership and sacrifice, which is a hard sell to American voters in the best of times and imfuckingpossible for a dude like Richard Milhous Nixon. So after months of praying to the Fed for a re-election miracle, Nixon had an idea. Well, it wasn’t really his idea, it was something his 42 year-old Undersecretary of the Treasury for Monetary Affairs, a guy by the name of Paul Volcker, had been pitching for a while. Basically, Volcker realized that the US was the pimp-daddy of all the worlds money, which meant US money was the only game in town, which meant the US treasury could wipe their ass with newly printed dollars and the world would still pimp their sisters to get their dirty little war-torn broke-ass fingers on the shit. So fuck, why back the money with gold? That shit was just a whole lotta extra work, what with all that settling of account balances and interest rates and shit. Fuck that.  </p>\n\n<p>You get the point, and so did Nixon. He was a fucking hustler at heart plus he was the fucking President of the United States and if Volcker was right, de-pegging the dollar to gold would mean he could manipulate the fuck out of the invisible hands. Like printing billions or paper dollars to distribute to smart-money Wall Street campaign donors to “invest” in stocks and jack up asset prices putting a few imaginary paper dollars in the pockets of struggling main-Street dumb money investor-voters, or debase the value of US money just enough to drive down prices of shit-rate US exports to win back market share from Germany and Japan.  </p>\n\n<p>But just one problem, Fed Chair Arthur Burns who was like, wait, what?  </p>\n\n<p>Ok, so here’s the thing, Nixon was a fucking sleazeball who would give zero fucks to just bulldozing those sanctimonious unelected Fed motherfuckers. But 1973 was an election year and he needed a story to trash a century old global economic order. I mean, what he really needed was an enemy, some fucking non-English speaking Illuminati motherfucker lurking in the shadows and threatening American jobs, because Americans eat that shit up. So in August 1971, Nixon took to prime time television and announced to an Aaron Spelling-loving TV-dinner-eating Vietnam-weary America that “International money speculators” were destroying the value of he dollar and costing American jobs. Which may seem like some obvious fucking ludicrous-mode political bullshit, but in the early 70s, shit was legit hard economically for a lot of Americans. And politicians understand that shit because at that level, when you get to be president, rule number one is that when shit is both mysterious and fucked up, never try and explain it - leave that shit to the losing party - instead find a villain and tell your people how you’re gonna fuck that motherfucker up. That pretty much always works. Because the universe is as much a fucking mystery today as it has been for over 300,000 years, a complex system that our pleasure-seeking, story-telling monkey brains are not wired to understand. Unemployment? Inflation? Fuck, we still can’t explain that shit. We are wired to survive in the wilderness and we know a threat when we see it, which is some primal brain hard-coded survival shit, like a rustle in the bush beyond the light of the campfire, it gets our hearts beating and bonds us as a tribe behind the dude with the biggest club. Until he gets eaten by fucking bears. But whatever, in the moment we’ll believe whatever he fuck he says. And what Nixon said was that we can’t trust money to both gold and god. We had to chose. So he de-coupled the dollar from gold and henceforth, and to this day, money became faith.  </p>\n\n<p>The day after the Nixon announcement, the Dow rose 33 points, its biggest daily gain ever at that point. A New York Times editorial read, &quot;We unhesitatingly applaud the boldness with which the President has moved.&quot; Which may have been “bold” and all, but it was also a fucking disaster. In the two years that followed, gold rose nearly 300%, from 43 to over 120, and the US suffered three quarters of negative GDP growth while unemployment exceeded 9% and inflation nearly doubled, hovering in the range of 10-12%, prompting global currencies to go all ape-shit searching for some semblance of fair market value in the hunger-games free for all that was the post gold global economy.  </p>\n\n<p>But fuck, that was one fuck of a good time to be trading currencies. Which brings us, fuck finally, to the trade...  </p>\n\n<p>A few years later, Andy Krieger was a graduate student in South Asian philosophy and a competitive athlete at Penn, committed to making the world a better place.  Aw. But one morning, after a long night translating some obscure Sanskrit text, he got to thinking: academia is a fucking slog, the kind of job where you had to wait for some old bearded wizard to die to get ahead. So the next day he met with his dissertation advisor and announced that he was gonna drop out of the graduate program and enroll at Wharton to translate the ancient mysteries of money. And with the world just starting to make sense of all the newly floated currencies and all kinds of crazy new financial instruments like options, Krieger was instantly hooked.  </p>\n\n<p>This was 1984, and few traders know what a currency option was, let alone how to price one. Black Sholes was a new-new thing and computers were non-existent.  But Krieger saw the potential of all this shit and knew he could use these instruments in a very powerful way so while still a student, he joined a  Chicago options trading firm and learned the ropes and after returning to Wharton, he wrote a computer program to price options that relied on assumptions no one else was thinking about at the time. This got him noticed by Solomon Brothers and then Bankers Trust.  And there, after a run of hugely profitable trades no one really understood, in 1987, the CEO of Bankers Trust gave him $700m to trade.  And fuck me, with option leverage, this meant next-level shit tons of billions.  </p>\n\n<p>On October 19th, 1987, on what became known as Black Monday, the DJIA fell 22.6%, the largest single day percentage drop in history.  But Krieger was cool.  He watched the world dump dollars and flood into alternative currencies, many of which were small and tied to struggling economies.  But Krieger knew this was a panic flight to anywhere but the Wall Street carnage. He also knew that as soon as the markets settled, the fast money would head right back to the safety of the dollar and their currencies would revert.  So with $700m and 400:1 leverage, Krieger placed his bets, the largest of which was a short against the New Zealand dollar (the Kiwi), eventually taking a position greater than the entire New Zealand monetary supply. And fuck, at the same time, Krieger had complex positions in the British Pound and the German Mark and even another short in the USD.  At any given time, Krieger had over $40B in trades in float fluctuating over $20m in value at any given time.  </p>\n\n<p>And then, with markets swinging wildly, as the Kiwi drops just 5% against the dollar, Krieger exits everything for a profit of $300m. Fuck.  </p>\n\n<p>After exiting the trade, with Wall Street a walking-dead financial dystopia, Krieger quit the game completely and retired to some island in the Caribbean. In the aftermath, regulators started to poke around at the one bank who booked a profit, based entirely on Krieger’s trading while Wall Street melted and an accounting scandal ensued involving Arthur Anderson, the auditor of Bankers Trust, which you could literally cut and past into the post-Enron economy of 2001. Meanwhile, the New Zealand government was crying foul publicly while privately counting their Kiwi blessings that Krieger had successfully tanked their money making NZ exports competitive on the global market. At the time it was a total money shit show, as quaint as that may seem today.  </p>\n\n<p>In the years that followed, Soros did the same kind of shit and made $1B breaking the Bank of England and then a shit-ton more shorting the Thai Baht. And there were other cool-ass macro money mega trades but by the late 90s, all that shit came to an end as the central banks came to realize what the politicians had long known: when some threat creeps in from the economic wilderness and shit gets crazy and mysterious, our monkey brains turn to the dudes with the biggest club. And central banks have the big clubs. Until they get eaten by bears. But so far, that hasn’t happened.</p>\n</blockquote>\n\n<p><a href=\"/u/cantedlight\">u/cantedlight</a>, come back and bless us with more history lessons that an autist can actually understand</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "519c3d26-4acc-11eb-8ce2-0ec530aa616d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#ffb000", "id": "krgbfy", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "IAMB4TMAN", "fullname": "t2_omqfq"}, "discussion_type": null, "num_comments": 26, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/krgbfy/bring_storytelling_back_og_wsb/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/krgbfy/bring_storytelling_back_og_wsb/", "subreddit_subscribers": 1774708, "created_utc": 1609907453.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 23, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_krgbfy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi9q47n", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "SilentSplit12", "fullname": "t2_6leqz3fv"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_krgbfy", "score": 23, "author_fullname": "t2_6leqz3fv", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Can you post an audio recording. I can’t read that long thing", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Can you post an audio recording. I can’t read that long thing</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/krgbfy/bring_storytelling_back_og_wsb/gi9q47n/", "num_reports": null, "locked": false, "name": "t1_gi9q47n", "created": 1609936451.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609907651.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 16, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_krgbfy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi9segq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "phil_hubb", "fullname": "t2_7inprr7f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_krgbfy", "score": 16, "author_fullname": "t2_7inprr7f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Calls on Audible.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201202:3:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Calls on Audible.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/krgbfy/bring_storytelling_back_og_wsb/gi9segq/", "num_reports": null, "locked": false, "name": "t1_gi9segq", "created": 1609937679.0, "author_flair_text": "\u001b201202:3:1", "treatment_tags": [], "created_utc": 1609908879.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_krgbfy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi9tbj5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "opieopieopi", "fullname": "t2_28xfjkvm"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_krgbfy", "score": 10, "author_fullname": "t2_28xfjkvm", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Read it all. Beautiful. 12 years of middle school and I never read anything as useful as this masterpiece.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Read it all. Beautiful. 12 years of middle school and I never read anything as useful as this masterpiece.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/krgbfy/bring_storytelling_back_og_wsb/gi9tbj5/", "num_reports": null, "locked": false, "name": "t1_gi9tbj5", "created": 1609938177.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609909377.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}