{"approved_at_utc": null, "selftext": "Hi everyone,\n\nLately I've been reading and watching on the news about Robinhood and I just wanted to give my two cents as somebody who actually researches Gambling disorder in the United States. My goal in this post is to hopefully encourage people on WSB to become politically active in preventing the regulations or removal of certain aspects that Robinhood allows on its investing platform. First, let me define some terms from the Gambling disorder field:\n\n* Gambling- placing something of value on a random outcome *in order to achieve a desired result or profit (this last part is added by me as I think it gives a better explanation of why an individual gambles in the first place)*;\n* Gambling disorder: A psychological disorder where an individual is unable to control their gambling to the point that they are experiencing consequences from the behavior. The behavior also has to occur without the presence of Mania, other biological co-morbidity, or under the influence of a psychoactive substance.\n\nIn this post I will address a few arguments at Robinhood. The first is regarding the \"gambling\" nature of investment that Robinhood purportedly encourages. The second is that the average investor needs to be \"protected\" because they lack the information and knowledge to participate on the app.\n\nWhen I first downloaded Robinhood, I was skeptical at first and proceeded to uninstall and reinstall it multiple times before I deposited $350 to invest in stock. The app provided me a \"scratch-off\" with my first deposit that rewarded me with my first stock (some medical company). That was the only time that event occurred. If we look at my prior definition of gambling, technically that is not a form of gambling. I placed nothing of value on this random outcome. If the actual act of investing in stock is gambling this leads to an interesting analogy regarding trading platforms, not just Robinhood.\n\nStocks are the game (roulette, blackjack, craps), Robinhood and trading platforms are the dealers (giving information on the rules of the game and how much it costs to place a bet), and the liberal market is the casino.\n\nIn this analogy everybody is in the Casino, and if you don't play the game you stand to lose regardless as your money loses value to inflation. Even worse, if the casino folds the people that didn't cash out or were fully invested in the casino never collapsing  (The Great Depression, the recession of 2008 the coronavirus recession) can stand to lose everything even if they didn't participate (regular person that was laid off) or were placing safe bets (ETF's Blue chip stocks etc).\n\nThe Massachusetts Secretary of the Commonwealth, William Galvin, is addressing the wrong issue by suing Robinhood. What should be addressed is the reasons that people even participate in Robinhood or in any trading platform. The average individual doesn't understand the market and the United States does not address this ignorance by providing information on how to properly invest for retirement or provide a welfare structure that protects against poverty as individuals become unable to participate fully in the economy due to injury, developmental disability, age, discrimination or lack of access to the \"free\" market. To claim that people on Robinhood \"gamble\" for excitement or risk is reductive. People invest their money on Robinhood for the potential accumulate life changing \"tendies\" that will protect them from the eventuality that they will be unable to participate in the economy and the government will not insulate them from the fiscal impact an individual will (not if) have to deal with in regards rising medical cost for their healthcare and any other services they would require in order to lead a normal life. If William Galvin is actually concerned about the \"gamefying\" of investment, he should focus on regulating Wall Street and the Banking sector, because last time I checked investors on Robinhood invest with their own money, not the money of other people.\n\nThe argument that the average investor isn't informed also leads to more issues that I guarantee the government doesn't want to address or even ask because it would require an expansion of the welfare state and higher taxes on companies and individuals. If the average American is too dumb to invest using Robinhood that what is the solution? The U.S. government has always fought any sort of government guaranteed income or services to insulate an individual against against insolvency from the free market as can be seen by the desire to privatize almost all forms of government programs such as Social Security, Medicare, Food Stamps and Medicaid. This has already occurred with certain programs at the federal level such as HUD which doesn't do anything to help people get affordable housing and the drastic reduction in funding for colleges and universities especially after boomers were done getting their degrees for essentially free.\n\nSo lets examine what the average person has to understand in the American economy,\n\n* they have to be able to plan and invest for their retirement,\n* understand  loans (including all the fine print such as interest) to pay for college, and purchasing of necessary items for certain areas such as housing or a car;\n* Navigate a Byzantine like medical industry that can easily bankrupt the average American even with insurance;\n\nSo the average American is suppose to navigate all of the aforementioned areas with little to no government assistance. But Robinhood should be regulated, makes sense. Let's not even talk about that most Americans read at about an 8th grade level and have a tough time understanding that a quarter pounder is less than a one third hamburger...\n\n\"Why the third pound hamburger failed: One of the most vivid arithmetic failings displayed by Americans occurred in the early 1980s, when the A&W restaurant chain released a new hamburger to rival the McDonald’s Quarter Pounder. With a third-pound of beef, the A&W burger had more meat than the Quarter Pounder; in taste tests, customers preferred A&W’s burger. And it was less expensive. A lavish A&W television and radio marketing campaign cited these benefits. Yet instead of leaping at the great value, customers snubbed it. Only when the company held customer focus groups did it become clear why. The Third Pounder presented the American public with a test in fractions. And we failed. Misunderstanding the value of one-third, customers believed they were being overcharged. **Why, they asked the researchers, should they pay the same amount for a third of a pound of meat as they did for a quarter-pound of meat at McDonald’s. The “4” in “¼,” larger than the “3” in “⅓,” led them astray**. --Elizabeth Green, NYT Magazine, on losing money by overestimating the American Public Intelligence.\"\n\nThe **REAL QUESTION** is what responsibility does the government have to insulate the average American from an economy that by its very nature is predatory, especially when the argument set forth by William Galvinson is that the public doesn't understand how to invest on Robinhood. Especially since the government has told the public from day one to take care of themselves as they get older through investing instead of expecting the government to provide assistance. By removing or regulating Robinhood, the fungibility of the average American's dollar will drop in value because they are prevented from another avenue of wealth accumulation, which research shows (at least for those in poverty) they turn to gambling as a means of wealth accumulation because even though the return on a gamble is less it is technically even since their dollar is also worth less.\n\nI think I may have gone on a rant, sorry.\n\nTL; DR,\n\nPlease buy me some tendies William Galvin, because I like to be wined and dined before I GET FUCKED!\n\nRobinhood isn't gambling. Robinhood just provides a service to investing on Wall Street, the actual gambling is our devotion to supply side economics which is the original, STONKS ONLY GO UP 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀\n\nAlso, if we are going to start regulating Robinhood because of the actions of a minority (WSB) then we should start regulating other industries that are WAY more predatory and impact a larger amount of the U.S. such as, payday loans, guns, pharma industry, surprise medical bills from emergency rooms, childcare, prison industry, bail industry etc. I bet you the cost to the U.S. economy from those industries is way more than anything Robinhood has done.\n\nPositions: SAVE at 18.45 67 shares;  and TQQQ 5 shares at 174.71", "author_fullname": "t2_80uapkxn", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Robinhood can be a gambling platform, but it's not and removing it or regulating it will exacerbate the divide between the wealthy and the rest of the U.S.", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kgf0er", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.92, "author_flair_background_color": null, "subreddit_type": "public", "ups": 67, "total_awards_received": 2, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 67, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1608408836.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {"gid_1": 1}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1608436640.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Hi everyone,</p>\n\n<p>Lately I&#39;ve been reading and watching on the news about Robinhood and I just wanted to give my two cents as somebody who actually researches Gambling disorder in the United States. My goal in this post is to hopefully encourage people on WSB to become politically active in preventing the regulations or removal of certain aspects that Robinhood allows on its investing platform. First, let me define some terms from the Gambling disorder field:</p>\n\n<ul>\n<li>Gambling- placing something of value on a random outcome <em>in order to achieve a desired result or profit (this last part is added by me as I think it gives a better explanation of why an individual gambles in the first place)</em>;</li>\n<li>Gambling disorder: A psychological disorder where an individual is unable to control their gambling to the point that they are experiencing consequences from the behavior. The behavior also has to occur without the presence of Mania, other biological co-morbidity, or under the influence of a psychoactive substance.</li>\n</ul>\n\n<p>In this post I will address a few arguments at Robinhood. The first is regarding the &quot;gambling&quot; nature of investment that Robinhood purportedly encourages. The second is that the average investor needs to be &quot;protected&quot; because they lack the information and knowledge to participate on the app.</p>\n\n<p>When I first downloaded Robinhood, I was skeptical at first and proceeded to uninstall and reinstall it multiple times before I deposited $350 to invest in stock. The app provided me a &quot;scratch-off&quot; with my first deposit that rewarded me with my first stock (some medical company). That was the only time that event occurred. If we look at my prior definition of gambling, technically that is not a form of gambling. I placed nothing of value on this random outcome. If the actual act of investing in stock is gambling this leads to an interesting analogy regarding trading platforms, not just Robinhood.</p>\n\n<p>Stocks are the game (roulette, blackjack, craps), Robinhood and trading platforms are the dealers (giving information on the rules of the game and how much it costs to place a bet), and the liberal market is the casino.</p>\n\n<p>In this analogy everybody is in the Casino, and if you don&#39;t play the game you stand to lose regardless as your money loses value to inflation. Even worse, if the casino folds the people that didn&#39;t cash out or were fully invested in the casino never collapsing  (The Great Depression, the recession of 2008 the coronavirus recession) can stand to lose everything even if they didn&#39;t participate (regular person that was laid off) or were placing safe bets (ETF&#39;s Blue chip stocks etc).</p>\n\n<p>The Massachusetts Secretary of the Commonwealth, William Galvin, is addressing the wrong issue by suing Robinhood. What should be addressed is the reasons that people even participate in Robinhood or in any trading platform. The average individual doesn&#39;t understand the market and the United States does not address this ignorance by providing information on how to properly invest for retirement or provide a welfare structure that protects against poverty as individuals become unable to participate fully in the economy due to injury, developmental disability, age, discrimination or lack of access to the &quot;free&quot; market. To claim that people on Robinhood &quot;gamble&quot; for excitement or risk is reductive. People invest their money on Robinhood for the potential accumulate life changing &quot;tendies&quot; that will protect them from the eventuality that they will be unable to participate in the economy and the government will not insulate them from the fiscal impact an individual will (not if) have to deal with in regards rising medical cost for their healthcare and any other services they would require in order to lead a normal life. If William Galvin is actually concerned about the &quot;gamefying&quot; of investment, he should focus on regulating Wall Street and the Banking sector, because last time I checked investors on Robinhood invest with their own money, not the money of other people.</p>\n\n<p>The argument that the average investor isn&#39;t informed also leads to more issues that I guarantee the government doesn&#39;t want to address or even ask because it would require an expansion of the welfare state and higher taxes on companies and individuals. If the average American is too dumb to invest using Robinhood that what is the solution? The U.S. government has always fought any sort of government guaranteed income or services to insulate an individual against against insolvency from the free market as can be seen by the desire to privatize almost all forms of government programs such as Social Security, Medicare, Food Stamps and Medicaid. This has already occurred with certain programs at the federal level such as HUD which doesn&#39;t do anything to help people get affordable housing and the drastic reduction in funding for colleges and universities especially after boomers were done getting their degrees for essentially free.</p>\n\n<p>So lets examine what the average person has to understand in the American economy,</p>\n\n<ul>\n<li>they have to be able to plan and invest for their retirement,</li>\n<li>understand  loans (including all the fine print such as interest) to pay for college, and purchasing of necessary items for certain areas such as housing or a car;</li>\n<li>Navigate a Byzantine like medical industry that can easily bankrupt the average American even with insurance;</li>\n</ul>\n\n<p>So the average American is suppose to navigate all of the aforementioned areas with little to no government assistance. But Robinhood should be regulated, makes sense. Let&#39;s not even talk about that most Americans read at about an 8th grade level and have a tough time understanding that a quarter pounder is less than a one third hamburger...</p>\n\n<p>&quot;Why the third pound hamburger failed: One of the most vivid arithmetic failings displayed by Americans occurred in the early 1980s, when the A&amp;W restaurant chain released a new hamburger to rival the McDonald’s Quarter Pounder. With a third-pound of beef, the A&amp;W burger had more meat than the Quarter Pounder; in taste tests, customers preferred A&amp;W’s burger. And it was less expensive. A lavish A&amp;W television and radio marketing campaign cited these benefits. Yet instead of leaping at the great value, customers snubbed it. Only when the company held customer focus groups did it become clear why. The Third Pounder presented the American public with a test in fractions. And we failed. Misunderstanding the value of one-third, customers believed they were being overcharged. <strong>Why, they asked the researchers, should they pay the same amount for a third of a pound of meat as they did for a quarter-pound of meat at McDonald’s. The “4” in “¼,” larger than the “3” in “⅓,” led them astray</strong>. --Elizabeth Green, NYT Magazine, on losing money by overestimating the American Public Intelligence.&quot;</p>\n\n<p>The <strong>REAL QUESTION</strong> is what responsibility does the government have to insulate the average American from an economy that by its very nature is predatory, especially when the argument set forth by William Galvinson is that the public doesn&#39;t understand how to invest on Robinhood. Especially since the government has told the public from day one to take care of themselves as they get older through investing instead of expecting the government to provide assistance. By removing or regulating Robinhood, the fungibility of the average American&#39;s dollar will drop in value because they are prevented from another avenue of wealth accumulation, which research shows (at least for those in poverty) they turn to gambling as a means of wealth accumulation because even though the return on a gamble is less it is technically even since their dollar is also worth less.</p>\n\n<p>I think I may have gone on a rant, sorry.</p>\n\n<p>TL; DR,</p>\n\n<p>Please buy me some tendies William Galvin, because I like to be wined and dined before I GET FUCKED!</p>\n\n<p>Robinhood isn&#39;t gambling. Robinhood just provides a service to investing on Wall Street, the actual gambling is our devotion to supply side economics which is the original, STONKS ONLY GO UP 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀</p>\n\n<p>Also, if we are going to start regulating Robinhood because of the actions of a minority (WSB) then we should start regulating other industries that are WAY more predatory and impact a larger amount of the U.S. such as, payday loans, guns, pharma industry, surprise medical bills from emergency rooms, childcare, prison industry, bail industry etc. I bet you the cost to the U.S. economy from those industries is way more than anything Robinhood has done.</p>\n\n<p>Positions: SAVE at 18.45 67 shares;  and TQQQ 5 shares at 174.71</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [{"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 300, "id": "award_28e8196b-d4e9-45bc-b612-cd4c7d3ed4b3", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=16&height=16&auto=webp&s=24fc4d912e595c3fed2ce0deef1c13f70df56056", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=32&height=32&auto=webp&s=f9d869602e0d8b719186cc603864a42699e5c96e", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=48&height=48&auto=webp&s=b223ac8fdd206b683b840c2782307c3f01b04fb7", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=64&height=64&auto=webp&s=a0b840c6ecdee904012a6c53c40194733b72bca8", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=128&height=128&auto=webp&s=b2e2ca67e067f82ff9b4ea1fe1b39395ca622894", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "When an upvote just isn't enough, smash the Rocket Like.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Rocket Like", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=16&height=16&auto=webp&s=24fc4d912e595c3fed2ce0deef1c13f70df56056", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=32&height=32&auto=webp&s=f9d869602e0d8b719186cc603864a42699e5c96e", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=48&height=48&auto=webp&s=b223ac8fdd206b683b840c2782307c3f01b04fb7", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=64&height=64&auto=webp&s=a0b840c6ecdee904012a6c53c40194733b72bca8", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png?width=128&height=128&auto=webp&s=b2e2ca67e067f82ff9b4ea1fe1b39395ca622894", "width": 128, "height": 128}], "icon_format": null, "icon_height": 2048, "penny_price": null, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/9fmmyy3c68361_RocketLikeSanta.png"}, {"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 100, "id": "gid_1", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Shows the Silver Award... and that's it.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Silver", "resized_static_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_format": null, "icon_height": 512, "penny_price": null, "award_type": "global", "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kgf0er", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "TankMainOW77", "fullname": "t2_80uapkxn"}, "discussion_type": null, "num_comments": 21, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/", "subreddit_subscribers": 1720705, "created_utc": 1608407840.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 36, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggf8nyz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "a-smooth-brain", "fullname": "t2_5cs1gqib"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kgf0er", "score": 36, "author_fullname": "t2_5cs1gqib", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "So you came here and gambled on someone reading that wall of text?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>So you came here and gambled on someone reading that wall of text?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggf8nyz/", "num_reports": null, "locked": false, "name": "t1_ggf8nyz", "created": 1608452738.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608423938.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggfje4z", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "04210219", "fullname": "t2_4r602jfb"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggf8nyz", "score": 5, "author_fullname": "t2_4r602jfb", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "yeah def a gamble there but it’s honestly a decent read. and 100% agreed w/ the premise. i don’t even use robinhood but i love how it’s disrupting an industry w/ high barriers to entry re: knowledge/capital. by far no more predatory than so many other companies leeching off folks in this country.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>yeah def a gamble there but it’s honestly a decent read. and 100% agreed w/ the premise. i don’t even use robinhood but i love how it’s disrupting an industry w/ high barriers to entry re: knowledge/capital. by far no more predatory than so many other companies leeching off folks in this country.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggfje4z/", "num_reports": null, "locked": false, "name": "t1_ggfje4z", "created": 1608458871.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608430071.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggfabjt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ShadowsRevealed", "fullname": "t2_bzw0gs8"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggf8nyz", "score": 2, "author_fullname": "t2_bzw0gs8", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "This is the BEST comment", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This is the BEST comment</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggfabjt/", "num_reports": null, "locked": false, "name": "t1_ggfabjt", "created": 1608453680.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608424880.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 13, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggevzsh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "boom1chaching", "fullname": "t2_3nb3694m"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kgf0er", "score": 13, "author_fullname": "t2_3nb3694m", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "If RH is gambling, then isn't ANY platform, in-person, phone, etc. of accessing the stock market also gambling?\n\nThat's what I don't get past their argument. How can you say \"It's on a phone, therefore 'gameified'.\"", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>If RH is gambling, then isn&#39;t ANY platform, in-person, phone, etc. of accessing the stock market also gambling?</p>\n\n<p>That&#39;s what I don&#39;t get past their argument. How can you say &quot;It&#39;s on a phone, therefore &#39;gameified&#39;.&quot;</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggevzsh/", "num_reports": null, "locked": false, "name": "t1_ggevzsh", "created": 1608447656.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608418856.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggfikb8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "chaser676", "fullname": "t2_7gjlh"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggevzsh", "score": 6, "author_fullname": "t2_7gjlh", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "That's essentially it. It's literally the same classist horseshit that led to PDT. They don't like how retail investors make the market so volatile.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>That&#39;s essentially it. It&#39;s literally the same classist horseshit that led to PDT. They don&#39;t like how retail investors make the market so volatile.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggfikb8/", "num_reports": null, "locked": false, "name": "t1_ggfikb8", "created": 1608458398.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608429598.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": "efb6a476-24c5-11e9-b89a-0ecd4fdb4da4", "likes": null, "user_reports": [], "saved": false, "id": "ggflj6g", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "thisusername_isnot", "fullname": "t2_7sxdkpzr"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggevzsh", "score": 1, "author_fullname": "t2_7sxdkpzr", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "You play games too on a computer too so I really don't understand that", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "suspicious moustache"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>You play games too on a computer too so I really don&#39;t understand that</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggflj6g/", "num_reports": null, "locked": false, "name": "t1_ggflj6g", "created": 1608460112.0, "author_flair_text": "suspicious moustache", "treatment_tags": [], "created_utc": 1608431312.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "#b8001f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 17, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kgf0er", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggenqbo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "crumbycanadianpoutin", "fullname": "t2_15xah71k"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kgf0er", "score": 17, "author_fullname": "t2_15xah71k", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Lay off the hard drugs going forward.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Lay off the hard drugs going forward.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kgf0er/robinhood_can_be_a_gambling_platform_but_its_not/ggenqbo/", "num_reports": null, "locked": false, "name": "t1_ggenqbo", "created": 1608444380.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608415580.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}