{"approved_at_utc": null, "selftext": "Good Saturday morning to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning November 30th, 2020.\n\n# **Stocks on track to close out month of big gains as jobs data looms  - [(Source)](https://www.cnbc.com/2020/11/27/stocks-on-track-to-close-out-month-of-big-gains-next-week-as-jobs-data-looms.html)**\n*****\n> Stocks next week will come off one of their best months ever into a busy week of economic data and the ongoing tensions between the spreading virus and positive news on vaccines and treatments.\n*****\n> Another highlight of the week is expected to be Tuesday’s testimony from Fed Chairman Jerome Powell and Treasury Secretary Steven Mnuchin before the Senate Banking Committee. They will be discussing the emergency measures taken to help the economy after the outbreak of the pandemic.\n*****\n> The Dow was up nearly 13% for November so far, and if it holds its gains into Monday’s close, it will chalk up its best month since January, 1987. The S&P 500 closed at a record 3,638 and was up 11.3% for the month. The gain is its best performance since April’s 12.7%, which was the third best month for the S&P 500 since its origin in 1957.\n*****\n> November was a big month also for market rotation, with investors favoring stocks that would benefit from a rebounding economy and showing less love for long-held favorites among big tech and internet names. Financials were up more than 17% in the past month, and industrials rose nearly 15%, as investors bet vaccines would help the economy return to normal next year.\n*****\n> Tech notched a single digit gain for the month so far and lagged the broader market. But some strategists expect big tech and internet names, stay-at-home stocks, to fare better in December.\n*****\n> “The death of big tech has been announced over and over again, and we see that the market doesn’t abandon them, but in fact migrates to big tech whenever there are concerns,” said Quincy Krosby, chief market strategist at Prudential Financial. “The post-pandemic question is whether big tech can co-exist with the small and mid-cap.” Small caps were one of the biggest winners in November, with the Russell 2000, up 20.6%.\n*****\n> “We did not see major selling in Nasdaq,” as investors put funds in cyclicals and value, she said. Nasdaq was up 11.9% for the month so far, slightly better than the S&P 500.\n*****\n> Experts have warned that there could an even bigger surge in virus cases, following the Thanksgiving holiday which could start to show up in the coming week. There have been more than 12.6 million cases in the U.S.\n*****\n> # Jobs report\n> There are some important economic reports in the week ahead, the most important being Friday’s November employment report. There is is also ISM manufacturing data Tuesday.\n*****\n> “My thought here is the data is going to matter because if you listen to the Fed, and if you read through the Fed’s minutes, they’re in transition here. They’re becoming more concerned about the rise in Covid cases, certainly about the lack of fiscal support,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities.\n*****\n> Strategists say another key report will be weekly jobless claims, which showed an increase in each of the last two weeks. “The employment data clearly has been weakening,” said Faranello. If it continues, it will keep a lid on Treasury yields, which move opposite prices.\n*****\n> Jefferies economist Tom Simons expects the elimination of Census Bureau workers to detract from the job gains in November, and he forecasts the economy added just 340,000 jobs.\n*****\n> “It is hard to envision a particularly strong report coming out on Friday,” noted Simons.\n*****\n> Bank of America economists forecast just 150,000 payrolls were added for November, compared to 638,000 in October. The private sector is expected to add 300,000, but expected government layoffs impacted total payrolls in their forecast.\n*****\n> Faranello said he expects the bond market to be much more active than normal this December because of the pending change in the White House, as well as the runoff election in Georgia Jan. 5 that will decide whether Republicans keep their Senate majority. The market has also been concerned about the lack of stimulus from Washington.\n*****\n> “The theme in the market right now is definitely hope and optimism versus the on the ground dynamic with Covid,” said Faranello. “The real question is can the vaccine rally hold up if we see the virus rise and we continue to see shutdowns. How does the market perform in light of that?”\n*****\n> Krosby said she expects the market to watch for vaccine news. “The question I think is now whether or not we see the emergency authorization given to Pfizer and followed by Moderna,” she said. “I think that is a catalyst to the market because that is when you will start to see the vaccine distributed.” The Food and Drug Administration’s vaccine advisory committee has a meeting set for Dec. 10 to discuss emergency authorization for the Pfizer\n*****\n> Analysts expect investors to continue to gravitate to value and cyclicals, since they could have the biggest gains compared to already high priced big tech. But tech is still attractive.\n*****\n> “We still see the Nasdaq leading,” said Krosby. “Whereas we enjoyed the vaccine related boom in the market, the fact is that investors and and traders are looking for big tech names to give them that growth in earnings and revenues.”\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/ZTiIHZf.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/kSw4HNb.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/oXE2aJo.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/30Iefrr.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/TEArZTK.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/BzpCasV.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/2DhrB6V.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/cRtEdkM.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/ShSvr9G.png))**\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/e5ILGPd.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK!](https://i.imgur.com/e5ILGPd.png))**\n\n*****\n\n> # December Almanac: Small Caps Have Shined\n\n> December is now the number three S&P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the top Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not highly likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.\n\n> In the last seventeen election years, December’s ranking changed modestly to #2 DJIA, #5 NASDAQ, but S&P 500 remains #3. Small caps, measured by the Russell 2000, have had a field day in election-year Decembers. Since 1980, the Russell 2000 has lost ground just once in ten election years in December. The average small cap gain in all ten years is a solid 3.0%. The Russell 2000’s single loss was in 1980 when the Prime Rate was 21.5%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://64.media.tumblr.com/a451723116af31d8c7273c588c33b6c8/950092ad30c7af73-09/s400x600/360e0edef191c0c34d744f4a5ecd32fd8845da9d.jpg))**\n\n*****\n\n> # Sector Weights Rising and Falling\n\n> For most of the past year, one significant trend on a sector by sector basis has been the outperformance of sectors like Technology and Consumer Discretionary. The relative strength lines of these sectors have consistently shown outperformance versus the rest of the S&P 500 as a whole, but since August, other sectors have begun to take the wheel. As we noted in today's Sector Snapshot, just about every sector has had a banner month in November with some of the biggest month to date rallies of the past 30 years, but some sectors have seen much larger returns than others. One of the best examples of this has been Energy which has risen over 35% in November. Similarly, Financials has risen an astounding 19.5% this month compared to more modest but still significant rallies of around 10% from Tech and Consumer Discretionary. Given those large degrees of outperformance, the relative strength lines of Energy and Financials have taken a sharp turn higher in recent weeks. Similarly, they have seen a turnaround in their weightings in the S&P 500 as shown in the charts below.\n\n> Over the past three months, the Financial sector has gained a full percentage point weighting while the Technology sector has lost 1.36 percentage points with a decline in weighting in three straight months. For Financials, that is the largest gain in weighting in a three month span since January 2017. For Tech, outside of the reshuffling in 2018 that saw a large share of its weight change into Communication Services, the last time the sector lost this much or more in weighting in three months was November of 2008. Prior to this recent string of losing weight over the past three months, Tech had seen weight gain in every month from October of last year through August. Even though the weight loss has been significant, it has only put a dent in the increased share of the entirety of the past year as the sector's weight is only back down to where it was in May.\n\n> Similarly, looking at the other sectors, while Financials have added a full percentage point in share over the past few months, that follows nine months of declines running from last December through August. That brings the sector's weighting back above 10% in the S&P 500, but that is only at the highest level since March. Similarly, Materials and Industrials have also seen their weights rise for three and four months in a row, respectively. As for Energy, the 0.44 percentage point gain in November is set to snap six straight months of declines; the longest such streak since at least 1990. As with Financials, that turn around this month has only put a dent in the longer term trend of weight loss as Energy's weighting is now only back to its highest level since July. Opposite of Energy, Consumer Discretionary is on pace to lose weight for the first time since March.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112720-Sector-Weights.png))**\n\n*****\n\n> # A Month to Be Thankful For\n\n> Heading into today with just three trading days left in November, the average Russell 1,000 stock was up 17.44% month to date. As shown below, not one of the five largest stocks is up even close to 17% on the month. For a market that had recently been driven higher in large part because of the five mega-cap Tech names, November has seen the mega-caps stall a bit while the rest of the market has seen broad participation. This is the type of breadth that market bulls have been waiting and hoping for.\n\n> Of the 35 largest stocks in the Russell 1,000, Tesla (TSLA) is up the most so far this month with a gain of 43%. The other big winners include Chevron (CVX), JP Morgan (JPM), Bank of America (BAC), Disney (DIS), and Comcast (CMCSA). Not one stock in the top 35 is down on the month, but the ones that are up the least are Netflix (NFLX), Procter & Gamble (PG), Amazon (AMZN), and Home Depot (HD).\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/largeststocks.png))**\n\n> Looking at sectors, the average Energy stock in the Russell 1,000 is up 46% month-to-date but still down 27% year-to-date. Three other sectors have seen their stocks average MTD gains of more than 20%: Financials, Industrials, and Real Estate. Stocks in the Health Care and Utilities sectors are up the least on an average basis this month, but even these underperformers are still up more than 5%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/avgpctchg.png))**\n\n> There are 37 stocks in the Russell 1,000 up more than 50% so far in November. Below is a list of this month's biggest winners. Coty (COTY) and Nordstrom (JWN) stand out the most with gains of more than 100%, followed by Spirit AeroSystems (SPR), Occidental Petroleum (OXY), Diamondback Energy (FANG), and Empire State Realty (ESRT). The list of biggest winners this month is full of names that got hit hardest by COVID in areas like energy, travel, retail, and real estate. Notably, while these stocks are up an average of 68.5% in November, they're still down an average of 23% on the year. On a median basis, they're down even more year-to-date at -31.55%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/best-mtd.png))**\n\n*****\n\n> # Biden - Best Since Reagan\n\n> The market started off November on a positive note, and even after the election has continued to add to its gains. Through the close today (11/24), the S&P 500 is up 7.90% since the close on Election Day. Relative to every other Presidential election since the beginning of the S&P back in 1928, the three-week performance of the S&P 500 following this Election Day ranks as the second-best of all time. It came down right to the wire, but the only other US President to see a stronger market reaction to their election (or re-election) was Ronald Reagan in 1980 (7.97%). Behind Reagan and Biden, the only other Presidents where the S&P 500 experienced an upside move of 5%+ in reaction to their elections were Hoover in 1928 and Clinton in 1996.\n\n> On the downside, the most negative reaction of the market in the three weeks after Election Day was the 14.75% decline following President Obama's election in 2008. In addition to Obama, the S&P 500's four other three-week downside moves of more than 5% came after the elections of Truman in 1948, the election of George W Bush in 2000 (although at the time it was unknown who was the winner of that election), the election of Franklin D Roosevelt in 1932, and Dwight D Eisenhower's re-election in 1956.\n\n> In aggregate, the S&P 500 hasn't historically responded all that great in the three weeks after a Presidential election. For every one since 1928, the median return of the S&P 500 in the three weeks after Election Day has been a gain of just 0.35%. Breaking out returns by party, in the three weeks after a Democratic candidate is elected, the S&P 500's median performance is a decline of 1.11% compared to a median gain of 3.04% when a Republican is elected.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-President.png))**\n\n*****\n\n> # DJIA 1,000 Point Thresholds\n\n> What a wild year 2020 has been! With the DJIA closing above 30,000 today, it was the second first-time upside break of a 1,000 point threshold this year. While there have only been two new upside crosses of 1,000 point thresholds, due to the sharp pullback in March from the pandemic that briefly took the DJIA below 19,000 on a closing basis, there have actually been 12 different upside 1,000 point thresholds at some point in the year.\n\n> The table below lists the first time that the DJIA closed above each 1,000 point threshold in its history along with the total number of times the index has crossed that level on a closing basis throughout history. The thousand point level that has seen the most crosses on a closing basis was 11,000 (87 crosses) while 10,000 ranks second at 67.\n\n> Obviously, the higher the DJIA goes, the less impactful a move of 1,000 points becomes. At current levels, 1,000 points represents just 3.3%, which is really nothing more than a very bad day in the market. Given the diminishing impact of 1,000 points in the DJIA these days, their significance declines. Even still, the twelve new 1,000-point crosses since the 2016 election has given the President (who has publicly discussed the stock market more than any other President in history) plenty of ammunition to tweet about.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/11/112420-1000-Points-Threshold.png))**\n\n*****\n\n> # 30,000 Reasons To Be Thankful\n\n> As 2020 winds down, it has been an extremely tough year on all of us. Still, there are many reasons to be thankful and today we will share some reasons investors should be thankful.\n\n> Stocks have had one of the largest reversals ever in 2020, something to be thankful for. In fact, this could be the first year ever to see the S&P 500 down more than 30% peak-to-trough and finish higher.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Revised-Chart-1.png?ssl=1))**\n\n> We should also be thankful that Congress was split in 2020, likely marking the 11th consecutive year the S&P 500 gained under a split Congress. Gridlock is good they tell us and that very well could be true yet again.\n\n> Want something else to be thankful for? We likely will have a split Congress for another two years after the two Georgia runoffs are official.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-2-11.25.20.png?ssl=1))**\n\n> Let’s be thankful that it is looking like stocks once again will be higher the year a President is up for re-election. In fact, you have to go back to FDR in the ‘40s the last time the S&P 500 was lower for the year when a President was up for re-election.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-3-11.25.20.png?ssl=1))**\n\n> Let’s be thankful that the fastest bear market in history (only 16 days) is officially a thing of the past.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-4-11.25.20.png?ssl=1))**\n\n> We are thankful that we are in a new bull market, which if history plays out once again, could have a lot of life left to it. In fact, the average bull market has lasted more than five years.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-5-11.25.20.png?ssl=1))**\n\n> “Let’s be thankful that the huge move off the March lows was a major clue of more strength,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We noted at the time (many different ways) that the enormous move we saw off the March lows likely suggested significantly higher prices, while many ignored the market signals and instead looked for a re-test for months on end.”\n\n> The 20-days off the March lows was the second best 20-day rally ever and sure enough, the returns have been very strong.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-6-11.25.20.png?ssl=1))**\n\n> We are finally seeing many stocks participate in this bull market, another reason to be thankful. In fact, the Value Line Arithmetic Index recently made new all-time highs. This index is a great look at what the ‘average’ stock is doing and is a sign that this move isn’t being led by just a few large cap tech stocks.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-7-11.25.20.png?ssl=1))**\n\n> Let’s be thankful that the NYSE Cumulative Advance/Decline line is at new highs. This looks at how many stocks are going up versus down and new highs are a sign of very healthy participation.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-8-11.25.20.png?ssl=1))**\n\n> Emerging markets have started to turn higher and we are thankful that this group could be on the verge of a major breakout to new highs, clearing their peak from 2007. As we move into ’21, this is one group we think could continue to do quite well for investors.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-9-11.25.20.png?ssl=1))**\n\n> Global investors should be thankful, as the MSCI Global Index broke out to new highs as well, suggesting this rally isn’t only about the US anymore.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-10-11.25.20.png?ssl=1))**\n\n> We upgraded our view on small caps in September and the Russell 2000 Index is currently on pace to have its best monthly return ever. Investors should be thankful that this group is finally participating, as there are many more small caps than large caps, another sign of improving breadth, while small caps are also more domestic by nature and could be suggesting a strong US economy next year.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11-11.25.20.png?ssl=1))**\n\n> Investors should be thankful for the incredible strength around the election, as the S&P 500 gained more than 1% four consecutive days. This is extremely rare, yet, extremely bullish going out a year.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-12-11.25.20.png?ssl=1))**\n\n> As we showed in Frothy Sentiment Rides Bullish Technicals, the huge number of stocks in the S&P 500 making new monthly highs should make bulls quite thankful.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-13-11.25.20.png?ssl=1))**\n\n> Earnings are expected to see a major bounce back, as the global economy gets back online next year, making many investors quite thankful.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-14-11.25.20.png?ssl=1))**\n\n> Economic forecasts may not develop as predicted.\n\n> As shown in the LPL Chart of the Day, the final reason to be thankful? Dow at 30,000!\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Blog-Chart-15.png?ssl=1))**\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/ShSvr9G.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/MNeVkWY.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 11.30.20 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/K9YO8LE.png))\n\n> # ***Monday 11.30.20 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!](https://i.imgur.com/K07am7f.png))\n\n*****\n\n> # ***Tuesday  12.1.20 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/mDMs2lS.png))\n\n> # ***Tuesday 12.1.20 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/i1pDKHj.png))\n\n*****\n\n> # ***Wednesday 12.2.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/VI1tdCh.png))\n\n> # ***Wednesday 12.2.20 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/XXBd26p.png))\n\n*****\n\n> # ***Thursday 12.3.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/XLmV1VW.png))\n\n> # ***Thursday 12.3.20 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/RZQI60z.png))\n\n*****\n\n> # ***Friday 12.4.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # ***Friday 12.4.20 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # Zoom Video Communications, Inc. $471.61\n**Zoom Video Communications, Inc. (ZM)** is confirmed to report earnings at approximately 4:05 PM ET on Monday, November 30, 2020. The consensus earnings estimate is $0.75 per share on revenue of $694.51 million and the Earnings Whisper ® number is $0.99 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share on revenue of $685.00 million to $690.00 million. Consensus estimates are for year-over-year earnings growth of 971.43% with revenue increasing by 316.89%. The stock has drifted higher by 7.3% from its open following the earnings release to be 72.1% above its 200 day moving average of $274.11. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,957 contracts of the $500.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 15.3% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ZM&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Salesforce $247.63\n**Salesforce (CRM)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.75 per share on revenue of $5.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for earnings of $0.73 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 16.33%. Short interest has increased by 47.7% since the company's last earnings release while the stock has drifted lower by 1.7% from its open following the earnings release to be 23.9% above its 200 day moving average of $199.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 8,759 contracts of the $260.00 call and 8,560 contracts of the $260.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.9% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRM&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # At Home Group Inc. $19.14\n**At Home Group Inc. (HOME)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.63 per share on revenue of $470.00 million and the Earnings Whisper ® number is $0.67 per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estiamtes are for year-over-year revenue growth of 47.46%. Short interest has increased by 9.6% since the company's last earnings release while the stock has drifted higher by 4.8% from its open following the earnings release to be 93.5% above its 200 day moving average of $9.89. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 522 contracts of the $18.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 13.7% move on earnings and the stock has averaged a 26.2% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=HOME&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # CrowdStrike, Inc. $150.83\n**CrowdStrike, Inc. (CRWD)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 2, 2020. The consensus earnings estimate is $0.01 per share on revenue of $213.70 million and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company's earnings release has 80% expecting an earnings beat The company's guidance was for revenue of $211.00 million to $215.00 million. Consensus estimates are for year-over-year earnings growth of 111.11% with revenue increasing by 70.80%. Short interest has increased by 43.9% since the company's last earnings release while the stock has drifted higher by 15.1% from its open following the earnings release to be 51.8% above its 200 day moving average of $99.38. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, November 12, 2020 there was some notable buying of 3,249 contracts of the $115.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.7% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CRWD&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # DocuSign $226.87\n**DocuSign (DOCU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.14 per share on revenue of $360.38 million and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for revenue of $358.00 million to $362.00 million. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 44.44%. The stock has drifted lower by 3.0% from its open following the earnings release to be 38.6% above its 200 day moving average of $163.71. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 6,534 contracts of the $180.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 11.0% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DOCU&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Dollar General Corporation $218.01\n**Dollar General Corporation (DG)** is confirmed to report earnings at approximately 6:55 AM ET on Thursday, December 3, 2020. The consensus earnings estimate is $1.97 per share on revenue of $8.00 billion and the Earnings Whisper ® number is $2.30 per share. Investor sentiment going into the company's earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.73% with revenue increasing by 14.43%. Short interest has increased by 8.9% since the company's last earnings release while the stock has drifted higher by 5.8% from its open following the earnings release to be 16.1% above its 200 day moving average of $187.80. Overall earnings estimates have been revised higher since the company's last earnings release. On Thursday, November 19, 2020 there was some notable buying of 893 contracts of the $220.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.3% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=DG&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # OrganiGram $1.33\n**OrganiGram (OGI)** is confirmed to report earnings at approximately 6:00 AM ET on Monday, November 30, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $14.77 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company's earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 40.00% with revenue increasing by 20.20%. Short interest has increased by 7.4% since the company's last earnings release while the stock has drifted lower by 6.3% from its open following the earnings release to be 12.4% below its 200 day moving average of $1.52. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 1,470 contracts of the $5.00 call expiring on Friday, June 18, 2021. The stock has averaged a 14.3% move on earnings in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=OGI&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Momo Inc. $15.12\n**Momo Inc. (MOMO)** is confirmed to report earnings at approximately 4:15 AM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.38 per share on revenue of $542.76 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company's earnings release has 63% expecting an earnings beat The company's guidance was for revenue of $542.00 million to $557.00 million. Consensus estimates are for earnings to decline year-over-year by 43.28% with revenue decreasing by 12.85%. Short interest has decreased by 25.5% since the company's last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 22.7% below its 200 day moving average of $19.56. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 13, 2020 there was some notable buying of 4,128 contracts of the $19.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 12.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MOMO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Marvell Technology Group Ltd. $45.11\n**Marvell Technology Group Ltd. (MRVL)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.25 per share on revenue of $750.38 million and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company's earnings release has 78% expecting an earnings beat The company's guidance was for earnings of $0.22 to $0.28 per share on revenue of $712.00 million to $788.00 million. Consensus estimates are for year-over-year earnings growth of 47.06% with revenue increasing by 13.27%. Short interest has increased by 69.3% since the company's last earnings release while the stock has drifted higher by 22.7% from its open following the earnings release to be 36.9% above its 200 day moving average of $32.94. Overall earnings estimates have been revised lower since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 13,018 contracts of the $50.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=MRVL&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Autohome Inc. $105.89\n**Autohome Inc. (ATHM)** is confirmed to report earnings at approximately 5:30 AM ET on Monday, November 30, 2020. The consensus earnings estimate is $1.08 per share on revenue of $326.75 million and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company's earnings release has 39% expecting an earnings beat The company's guidance was for revenue of $317.00 million to $323.00 million. Consensus estimates are for year-over-year earnings growth of 31.71% with revenue increasing by 7.62%. Short interest has decreased by 12.8% since the company's last earnings release while the stock has drifted higher by 20.5% from its open following the earnings release to be 25.3% above its 200 day moving average of $84.51. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 17, 2020 there was some notable buying of 1,382 contracts of the $90.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.4% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ATHM&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.", "author_fullname": "t2_eaak0", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Wall Street Week Ahead for the trading week beginning November 30th, 2020", "link_flair_richtext": [{"e": "text", "t": "Stocks"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "stocks", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k2pj9d", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.96, "author_flair_background_color": "", "subreddit_type": "public", "ups": 22, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Stocks", "can_mod_post": false, "score": 22, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [{"e": "text", "t": "ʕ•ᴥ•ʔ🐻"}], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1606606239.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "richtext", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday morning to all of you here on <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning November 30th, 2020.</p>\n\n<h1><strong>Stocks on track to close out month of big gains as jobs data looms  - <a href=\"https://www.cnbc.com/2020/11/27/stocks-on-track-to-close-out-month-of-big-gains-next-week-as-jobs-data-looms.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Stocks next week will come off one of their best months ever into a busy week of economic data and the ongoing tensions between the spreading virus and positive news on vaccines and treatments.</p>\n\n<hr/>\n\n<p>Another highlight of the week is expected to be Tuesday’s testimony from Fed Chairman Jerome Powell and Treasury Secretary Steven Mnuchin before the Senate Banking Committee. They will be discussing the emergency measures taken to help the economy after the outbreak of the pandemic.</p>\n\n<hr/>\n\n<p>The Dow was up nearly 13% for November so far, and if it holds its gains into Monday’s close, it will chalk up its best month since January, 1987. The S&amp;P 500 closed at a record 3,638 and was up 11.3% for the month. The gain is its best performance since April’s 12.7%, which was the third best month for the S&amp;P 500 since its origin in 1957.</p>\n\n<hr/>\n\n<p>November was a big month also for market rotation, with investors favoring stocks that would benefit from a rebounding economy and showing less love for long-held favorites among big tech and internet names. Financials were up more than 17% in the past month, and industrials rose nearly 15%, as investors bet vaccines would help the economy return to normal next year.</p>\n\n<hr/>\n\n<p>Tech notched a single digit gain for the month so far and lagged the broader market. But some strategists expect big tech and internet names, stay-at-home stocks, to fare better in December.</p>\n\n<hr/>\n\n<p>“The death of big tech has been announced over and over again, and we see that the market doesn’t abandon them, but in fact migrates to big tech whenever there are concerns,” said Quincy Krosby, chief market strategist at Prudential Financial. “The post-pandemic question is whether big tech can co-exist with the small and mid-cap.” Small caps were one of the biggest winners in November, with the Russell 2000, up 20.6%.</p>\n\n<hr/>\n\n<p>“We did not see major selling in Nasdaq,” as investors put funds in cyclicals and value, she said. Nasdaq was up 11.9% for the month so far, slightly better than the S&amp;P 500.</p>\n\n<hr/>\n\n<p>Experts have warned that there could an even bigger surge in virus cases, following the Thanksgiving holiday which could start to show up in the coming week. There have been more than 12.6 million cases in the U.S.</p>\n\n<hr/>\n\n<h1>Jobs report</h1>\n\n<p>There are some important economic reports in the week ahead, the most important being Friday’s November employment report. There is is also ISM manufacturing data Tuesday.</p>\n\n<hr/>\n\n<p>“My thought here is the data is going to matter because if you listen to the Fed, and if you read through the Fed’s minutes, they’re in transition here. They’re becoming more concerned about the rise in Covid cases, certainly about the lack of fiscal support,” said Gregory Faranello, head of U.S. rates at AmeriVet Securities.</p>\n\n<hr/>\n\n<p>Strategists say another key report will be weekly jobless claims, which showed an increase in each of the last two weeks. “The employment data clearly has been weakening,” said Faranello. If it continues, it will keep a lid on Treasury yields, which move opposite prices.</p>\n\n<hr/>\n\n<p>Jefferies economist Tom Simons expects the elimination of Census Bureau workers to detract from the job gains in November, and he forecasts the economy added just 340,000 jobs.</p>\n\n<hr/>\n\n<p>“It is hard to envision a particularly strong report coming out on Friday,” noted Simons.</p>\n\n<hr/>\n\n<p>Bank of America economists forecast just 150,000 payrolls were added for November, compared to 638,000 in October. The private sector is expected to add 300,000, but expected government layoffs impacted total payrolls in their forecast.</p>\n\n<hr/>\n\n<p>Faranello said he expects the bond market to be much more active than normal this December because of the pending change in the White House, as well as the runoff election in Georgia Jan. 5 that will decide whether Republicans keep their Senate majority. The market has also been concerned about the lack of stimulus from Washington.</p>\n\n<hr/>\n\n<p>“The theme in the market right now is definitely hope and optimism versus the on the ground dynamic with Covid,” said Faranello. “The real question is can the vaccine rally hold up if we see the virus rise and we continue to see shutdowns. How does the market perform in light of that?”</p>\n\n<hr/>\n\n<p>Krosby said she expects the market to watch for vaccine news. “The question I think is now whether or not we see the emergency authorization given to Pfizer and followed by Moderna,” she said. “I think that is a catalyst to the market because that is when you will start to see the vaccine distributed.” The Food and Drug Administration’s vaccine advisory committee has a meeting set for Dec. 10 to discuss emergency authorization for the Pfizer</p>\n\n<hr/>\n\n<p>Analysts expect investors to continue to gravitate to value and cyclicals, since they could have the biggest gains compared to already high priced big tech. But tech is still attractive.</p>\n\n<hr/>\n\n<p>“We still see the Nasdaq leading,” said Krosby. “Whereas we enjoyed the vaccine related boom in the market, the fact is that investors and and traders are looking for big tech names to give them that growth in earnings and revenues.”</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ZTiIHZf.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/kSw4HNb.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/oXE2aJo.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/30Iefrr.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/TEArZTK.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/BzpCasV.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/2DhrB6V.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/cRtEdkM.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ShSvr9G.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/e5ILGPd.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/e5ILGPd.png\">CLICK HERE FOR THE CHART LINK!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>December Almanac: Small Caps Have Shined</h1>\n\n<p>December is now the number three S&amp;P 500 and Dow Jones Industrials month since 1950, averaging gains of 1.5% on each index. It’s the top Russell 2000 (1979) month and third best for NASDAQ (1971) and Russell 1000 (1979). In 2018, DJIA suffered its worst December performance since 1931 and its fourth worst December going all the way back to 1901. However, the market rarely falls precipitously in December and a repeat of 2018 is not highly likely. When December is down it is usually a turning point in the market—near a top or bottom. If the market has experienced fantastic gains leading up to December, stocks can pullback in the first half of the month.</p>\n\n<p>In the last seventeen election years, December’s ranking changed modestly to #2 DJIA, #5 NASDAQ, but S&amp;P 500 remains #3. Small caps, measured by the Russell 2000, have had a field day in election-year Decembers. Since 1980, the Russell 2000 has lost ground just once in ten election years in December. The average small cap gain in all ten years is a solid 3.0%. The Russell 2000’s single loss was in 1980 when the Prime Rate was 21.5%.</p>\n\n<h6><strong>(<a href=\"https://64.media.tumblr.com/a451723116af31d8c7273c588c33b6c8/950092ad30c7af73-09/s400x600/360e0edef191c0c34d744f4a5ecd32fd8845da9d.jpg\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Sector Weights Rising and Falling</h1>\n\n<p>For most of the past year, one significant trend on a sector by sector basis has been the outperformance of sectors like Technology and Consumer Discretionary. The relative strength lines of these sectors have consistently shown outperformance versus the rest of the S&amp;P 500 as a whole, but since August, other sectors have begun to take the wheel. As we noted in today&#39;s Sector Snapshot, just about every sector has had a banner month in November with some of the biggest month to date rallies of the past 30 years, but some sectors have seen much larger returns than others. One of the best examples of this has been Energy which has risen over 35% in November. Similarly, Financials has risen an astounding 19.5% this month compared to more modest but still significant rallies of around 10% from Tech and Consumer Discretionary. Given those large degrees of outperformance, the relative strength lines of Energy and Financials have taken a sharp turn higher in recent weeks. Similarly, they have seen a turnaround in their weightings in the S&amp;P 500 as shown in the charts below.</p>\n\n<p>Over the past three months, the Financial sector has gained a full percentage point weighting while the Technology sector has lost 1.36 percentage points with a decline in weighting in three straight months. For Financials, that is the largest gain in weighting in a three month span since January 2017. For Tech, outside of the reshuffling in 2018 that saw a large share of its weight change into Communication Services, the last time the sector lost this much or more in weighting in three months was November of 2008. Prior to this recent string of losing weight over the past three months, Tech had seen weight gain in every month from October of last year through August. Even though the weight loss has been significant, it has only put a dent in the increased share of the entirety of the past year as the sector&#39;s weight is only back down to where it was in May.</p>\n\n<p>Similarly, looking at the other sectors, while Financials have added a full percentage point in share over the past few months, that follows nine months of declines running from last December through August. That brings the sector&#39;s weighting back above 10% in the S&amp;P 500, but that is only at the highest level since March. Similarly, Materials and Industrials have also seen their weights rise for three and four months in a row, respectively. As for Energy, the 0.44 percentage point gain in November is set to snap six straight months of declines; the longest such streak since at least 1990. As with Financials, that turn around this month has only put a dent in the longer term trend of weight loss as Energy&#39;s weighting is now only back to its highest level since July. Opposite of Energy, Consumer Discretionary is on pace to lose weight for the first time since March.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/112720-Sector-Weights.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>A Month to Be Thankful For</h1>\n\n<p>Heading into today with just three trading days left in November, the average Russell 1,000 stock was up 17.44% month to date. As shown below, not one of the five largest stocks is up even close to 17% on the month. For a market that had recently been driven higher in large part because of the five mega-cap Tech names, November has seen the mega-caps stall a bit while the rest of the market has seen broad participation. This is the type of breadth that market bulls have been waiting and hoping for.</p>\n\n<p>Of the 35 largest stocks in the Russell 1,000, Tesla (TSLA) is up the most so far this month with a gain of 43%. The other big winners include Chevron (CVX), JP Morgan (JPM), Bank of America (BAC), Disney (DIS), and Comcast (CMCSA). Not one stock in the top 35 is down on the month, but the ones that are up the least are Netflix (NFLX), Procter &amp; Gamble (PG), Amazon (AMZN), and Home Depot (HD).</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/largeststocks.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Looking at sectors, the average Energy stock in the Russell 1,000 is up 46% month-to-date but still down 27% year-to-date. Three other sectors have seen their stocks average MTD gains of more than 20%: Financials, Industrials, and Real Estate. Stocks in the Health Care and Utilities sectors are up the least on an average basis this month, but even these underperformers are still up more than 5%.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/avgpctchg.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>There are 37 stocks in the Russell 1,000 up more than 50% so far in November. Below is a list of this month&#39;s biggest winners. Coty (COTY) and Nordstrom (JWN) stand out the most with gains of more than 100%, followed by Spirit AeroSystems (SPR), Occidental Petroleum (OXY), Diamondback Energy (FANG), and Empire State Realty (ESRT). The list of biggest winners this month is full of names that got hit hardest by COVID in areas like energy, travel, retail, and real estate. Notably, while these stocks are up an average of 68.5% in November, they&#39;re still down an average of 23% on the year. On a median basis, they&#39;re down even more year-to-date at -31.55%.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/best-mtd.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Biden - Best Since Reagan</h1>\n\n<p>The market started off November on a positive note, and even after the election has continued to add to its gains. Through the close today (11/24), the S&amp;P 500 is up 7.90% since the close on Election Day. Relative to every other Presidential election since the beginning of the S&amp;P back in 1928, the three-week performance of the S&amp;P 500 following this Election Day ranks as the second-best of all time. It came down right to the wire, but the only other US President to see a stronger market reaction to their election (or re-election) was Ronald Reagan in 1980 (7.97%). Behind Reagan and Biden, the only other Presidents where the S&amp;P 500 experienced an upside move of 5%+ in reaction to their elections were Hoover in 1928 and Clinton in 1996.</p>\n\n<p>On the downside, the most negative reaction of the market in the three weeks after Election Day was the 14.75% decline following President Obama&#39;s election in 2008. In addition to Obama, the S&amp;P 500&#39;s four other three-week downside moves of more than 5% came after the elections of Truman in 1948, the election of George W Bush in 2000 (although at the time it was unknown who was the winner of that election), the election of Franklin D Roosevelt in 1932, and Dwight D Eisenhower&#39;s re-election in 1956.</p>\n\n<p>In aggregate, the S&amp;P 500 hasn&#39;t historically responded all that great in the three weeks after a Presidential election. For every one since 1928, the median return of the S&amp;P 500 in the three weeks after Election Day has been a gain of just 0.35%. Breaking out returns by party, in the three weeks after a Democratic candidate is elected, the S&amp;P 500&#39;s median performance is a decline of 1.11% compared to a median gain of 3.04% when a Republican is elected.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/112420-President.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>DJIA 1,000 Point Thresholds</h1>\n\n<p>What a wild year 2020 has been! With the DJIA closing above 30,000 today, it was the second first-time upside break of a 1,000 point threshold this year. While there have only been two new upside crosses of 1,000 point thresholds, due to the sharp pullback in March from the pandemic that briefly took the DJIA below 19,000 on a closing basis, there have actually been 12 different upside 1,000 point thresholds at some point in the year.</p>\n\n<p>The table below lists the first time that the DJIA closed above each 1,000 point threshold in its history along with the total number of times the index has crossed that level on a closing basis throughout history. The thousand point level that has seen the most crosses on a closing basis was 11,000 (87 crosses) while 10,000 ranks second at 67.</p>\n\n<p>Obviously, the higher the DJIA goes, the less impactful a move of 1,000 points becomes. At current levels, 1,000 points represents just 3.3%, which is really nothing more than a very bad day in the market. Given the diminishing impact of 1,000 points in the DJIA these days, their significance declines. Even still, the twelve new 1,000-point crosses since the 2016 election has given the President (who has publicly discussed the stock market more than any other President in history) plenty of ammunition to tweet about.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/11/112420-1000-Points-Threshold.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>30,000 Reasons To Be Thankful</h1>\n\n<p>As 2020 winds down, it has been an extremely tough year on all of us. Still, there are many reasons to be thankful and today we will share some reasons investors should be thankful.</p>\n\n<p>Stocks have had one of the largest reversals ever in 2020, something to be thankful for. In fact, this could be the first year ever to see the S&amp;P 500 down more than 30% peak-to-trough and finish higher.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Revised-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We should also be thankful that Congress was split in 2020, likely marking the 11th consecutive year the S&amp;P 500 gained under a split Congress. Gridlock is good they tell us and that very well could be true yet again.</p>\n\n<p>Want something else to be thankful for? We likely will have a split Congress for another two years after the two Georgia runoffs are official.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-2-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Let’s be thankful that it is looking like stocks once again will be higher the year a President is up for re-election. In fact, you have to go back to FDR in the ‘40s the last time the S&amp;P 500 was lower for the year when a President was up for re-election.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-3-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Let’s be thankful that the fastest bear market in history (only 16 days) is officially a thing of the past.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-4-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We are thankful that we are in a new bull market, which if history plays out once again, could have a lot of life left to it. In fact, the average bull market has lasted more than five years.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-5-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>“Let’s be thankful that the huge move off the March lows was a major clue of more strength,” explained LPL Financial Chief Market Strategist Ryan Detrick. “We noted at the time (many different ways) that the enormous move we saw off the March lows likely suggested significantly higher prices, while many ignored the market signals and instead looked for a re-test for months on end.”</p>\n\n<p>The 20-days off the March lows was the second best 20-day rally ever and sure enough, the returns have been very strong.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-6-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We are finally seeing many stocks participate in this bull market, another reason to be thankful. In fact, the Value Line Arithmetic Index recently made new all-time highs. This index is a great look at what the ‘average’ stock is doing and is a sign that this move isn’t being led by just a few large cap tech stocks.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/blog-chart-7-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Let’s be thankful that the NYSE Cumulative Advance/Decline line is at new highs. This looks at how many stocks are going up versus down and new highs are a sign of very healthy participation.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-8-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Emerging markets have started to turn higher and we are thankful that this group could be on the verge of a major breakout to new highs, clearing their peak from 2007. As we move into ’21, this is one group we think could continue to do quite well for investors.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-9-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Global investors should be thankful, as the MSCI Global Index broke out to new highs as well, suggesting this rally isn’t only about the US anymore.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-10-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>We upgraded our view on small caps in September and the Russell 2000 Index is currently on pace to have its best monthly return ever. Investors should be thankful that this group is finally participating, as there are many more small caps than large caps, another sign of improving breadth, while small caps are also more domestic by nature and could be suggesting a strong US economy next year.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-11-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Investors should be thankful for the incredible strength around the election, as the S&amp;P 500 gained more than 1% four consecutive days. This is extremely rare, yet, extremely bullish going out a year.</p>\n\n<h6><strong>(<a href=\"https://i2.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-12-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>As we showed in Frothy Sentiment Rides Bullish Technicals, the huge number of stocks in the S&amp;P 500 making new monthly highs should make bulls quite thankful.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-13-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Earnings are expected to see a major bounce back, as the global economy gets back online next year, making many investors quite thankful.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/11/Blog-chart-14-11.25.20.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Economic forecasts may not develop as predicted.</p>\n\n<p>As shown in the LPL Chart of the Day, the final reason to be thankful? Dow at 30,000!</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/11/11.25.20-Blog-Chart-15.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ShSvr9G.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/MNeVkWY.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 11.30.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/K9YO8LE.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 11.30.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/K07am7f.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  12.1.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/mDMs2lS.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 12.1.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/i1pDKHj.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 12.2.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/VI1tdCh.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 12.2.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/XXBd26p.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 12.3.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/XLmV1VW.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 12.3.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/RZQI60z.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 12.4.20 Before Market Open:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 12.4.20 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Zoom Video Communications, Inc. $471.61</h1>\n\n<p><strong>Zoom Video Communications, Inc. (ZM)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Monday, November 30, 2020. The consensus earnings estimate is $0.75 per share on revenue of $694.51 million and the Earnings Whisper ® number is $0.99 per share. Investor sentiment going into the company&#39;s earnings release has 80% expecting an earnings beat The company&#39;s guidance was for earnings of $0.73 to $0.74 per share on revenue of $685.00 million to $690.00 million. Consensus estimates are for year-over-year earnings growth of 971.43% with revenue increasing by 316.89%. The stock has drifted higher by 7.3% from its open following the earnings release to be 72.1% above its 200 day moving average of $274.11. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,957 contracts of the $500.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 15.3% move on earnings and the stock has averaged a 15.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=ZM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Salesforce $247.63</h1>\n\n<p><strong>Salesforce (CRM)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.75 per share on revenue of $5.25 billion and the Earnings Whisper ® number is $0.83 per share. Investor sentiment going into the company&#39;s earnings release has 80% expecting an earnings beat The company&#39;s guidance was for earnings of $0.73 to $0.74 per share. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 16.33%. Short interest has increased by 47.7% since the company&#39;s last earnings release while the stock has drifted lower by 1.7% from its open following the earnings release to be 23.9% above its 200 day moving average of $199.80. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 8,759 contracts of the $260.00 call and 8,560 contracts of the $260.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.1% move on earnings and the stock has averaged a 6.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CRM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>At Home Group Inc. $19.14</h1>\n\n<p><strong>At Home Group Inc. (HOME)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.63 per share on revenue of $470.00 million and the Earnings Whisper ® number is $0.67 per share. Investor sentiment going into the company&#39;s earnings release has 55% expecting an earnings beat. Consensus estiamtes are for year-over-year revenue growth of 47.46%. Short interest has increased by 9.6% since the company&#39;s last earnings release while the stock has drifted higher by 4.8% from its open following the earnings release to be 93.5% above its 200 day moving average of $9.89. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 522 contracts of the $18.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 13.7% move on earnings and the stock has averaged a 26.2% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=HOME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>CrowdStrike, Inc. $150.83</h1>\n\n<p><strong>CrowdStrike, Inc. (CRWD)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 2, 2020. The consensus earnings estimate is $0.01 per share on revenue of $213.70 million and the Earnings Whisper ® number is $0.04 per share. Investor sentiment going into the company&#39;s earnings release has 80% expecting an earnings beat The company&#39;s guidance was for revenue of $211.00 million to $215.00 million. Consensus estimates are for year-over-year earnings growth of 111.11% with revenue increasing by 70.80%. Short interest has increased by 43.9% since the company&#39;s last earnings release while the stock has drifted higher by 15.1% from its open following the earnings release to be 51.8% above its 200 day moving average of $99.38. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, November 12, 2020 there was some notable buying of 3,249 contracts of the $115.00 put expiring on Friday, June 18, 2021. Option traders are pricing in a 11.3% move on earnings and the stock has averaged a 10.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CRWD&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>DocuSign $226.87</h1>\n\n<p><strong>DocuSign (DOCU)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.14 per share on revenue of $360.38 million and the Earnings Whisper ® number is $0.19 per share. Investor sentiment going into the company&#39;s earnings release has 78% expecting an earnings beat The company&#39;s guidance was for revenue of $358.00 million to $362.00 million. Consensus estimates are for year-over-year earnings growth of 7.69% with revenue increasing by 44.44%. The stock has drifted lower by 3.0% from its open following the earnings release to be 38.6% above its 200 day moving average of $163.71. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Friday, November 13, 2020 there was some notable buying of 6,534 contracts of the $180.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.6% move on earnings and the stock has averaged a 11.0% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DOCU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Dollar General Corporation $218.01</h1>\n\n<p><strong>Dollar General Corporation (DG)</strong> is confirmed to report earnings at approximately 6:55 AM ET on Thursday, December 3, 2020. The consensus earnings estimate is $1.97 per share on revenue of $8.00 billion and the Earnings Whisper ® number is $2.30 per share. Investor sentiment going into the company&#39;s earnings release has 68% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 38.73% with revenue increasing by 14.43%. Short interest has increased by 8.9% since the company&#39;s last earnings release while the stock has drifted higher by 5.8% from its open following the earnings release to be 16.1% above its 200 day moving average of $187.80. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Thursday, November 19, 2020 there was some notable buying of 893 contracts of the $220.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 5.0% move on earnings and the stock has averaged a 5.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=DG&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>OrganiGram $1.33</h1>\n\n<p><strong>OrganiGram (OGI)</strong> is confirmed to report earnings at approximately 6:00 AM ET on Monday, November 30, 2020. The consensus estimate is for a loss of $0.03 per share on revenue of $14.77 million and the Earnings Whisper ® number is ($0.01) per share. Investor sentiment going into the company&#39;s earnings release has 55% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 40.00% with revenue increasing by 20.20%. Short interest has increased by 7.4% since the company&#39;s last earnings release while the stock has drifted lower by 6.3% from its open following the earnings release to be 12.4% below its 200 day moving average of $1.52. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 1,470 contracts of the $5.00 call expiring on Friday, June 18, 2021. The stock has averaged a 14.3% move on earnings in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=OGI&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Momo Inc. $15.12</h1>\n\n<p><strong>Momo Inc. (MOMO)</strong> is confirmed to report earnings at approximately 4:15 AM ET on Tuesday, December 1, 2020. The consensus earnings estimate is $0.38 per share on revenue of $542.76 million and the Earnings Whisper ® number is $0.42 per share. Investor sentiment going into the company&#39;s earnings release has 63% expecting an earnings beat The company&#39;s guidance was for revenue of $542.00 million to $557.00 million. Consensus estimates are for earnings to decline year-over-year by 43.28% with revenue decreasing by 12.85%. Short interest has decreased by 25.5% since the company&#39;s last earnings release while the stock has drifted lower by 16.7% from its open following the earnings release to be 22.7% below its 200 day moving average of $19.56. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Friday, November 13, 2020 there was some notable buying of 4,128 contracts of the $19.00 call expiring on Friday, December 4, 2020. Option traders are pricing in a 12.4% move on earnings and the stock has averaged a 6.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MOMO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Marvell Technology Group Ltd. $45.11</h1>\n\n<p><strong>Marvell Technology Group Ltd. (MRVL)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 3, 2020. The consensus earnings estimate is $0.25 per share on revenue of $750.38 million and the Earnings Whisper ® number is $0.27 per share. Investor sentiment going into the company&#39;s earnings release has 78% expecting an earnings beat The company&#39;s guidance was for earnings of $0.22 to $0.28 per share on revenue of $712.00 million to $788.00 million. Consensus estimates are for year-over-year earnings growth of 47.06% with revenue increasing by 13.27%. Short interest has increased by 69.3% since the company&#39;s last earnings release while the stock has drifted higher by 22.7% from its open following the earnings release to be 36.9% above its 200 day moving average of $32.94. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 13,018 contracts of the $50.00 call expiring on Friday, January 15, 2021. Option traders are pricing in a 7.2% move on earnings and the stock has averaged a 5.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=MRVL&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Autohome Inc. $105.89</h1>\n\n<p><strong>Autohome Inc. (ATHM)</strong> is confirmed to report earnings at approximately 5:30 AM ET on Monday, November 30, 2020. The consensus earnings estimate is $1.08 per share on revenue of $326.75 million and the Earnings Whisper ® number is $1.10 per share. Investor sentiment going into the company&#39;s earnings release has 39% expecting an earnings beat The company&#39;s guidance was for revenue of $317.00 million to $323.00 million. Consensus estimates are for year-over-year earnings growth of 31.71% with revenue increasing by 7.62%. Short interest has decreased by 12.8% since the company&#39;s last earnings release while the stock has drifted higher by 20.5% from its open following the earnings release to be 25.3% above its 200 day moving average of $84.51. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, November 17, 2020 there was some notable buying of 1,382 contracts of the $90.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 8.6% move on earnings and the stock has averaged a 5.4% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=ATHM&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?auto=webp&s=5c7c5bd01ca479308d9be2030c0f70cd18acfc8e", "width": 1233, "height": 761}, "resolutions": [{"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=108&crop=smart&auto=webp&s=9f9e914d80fceddf91d8552ad27716b6657a199e", "width": 108, "height": 66}, {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=216&crop=smart&auto=webp&s=07e71ef2eb966faffe8f0c87583df8d9ad047a6f", "width": 216, "height": 133}, {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=320&crop=smart&auto=webp&s=05f653b1d564b94bee0488d021192c0256ee97c3", "width": 320, "height": 197}, {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=640&crop=smart&auto=webp&s=db8095070022c807765f886fbcbb19393fa1f425", "width": 640, "height": 395}, {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=960&crop=smart&auto=webp&s=70c7c68ac914bdd4ff182cf329008c60a784dcaa", "width": 960, "height": 592}, {"url": "https://external-preview.redd.it/IIlocleANyt5esKlOaUAwukVJiZCV0iOnHrepaADDFM.png?width=1080&crop=smart&auto=webp&s=55e1f29122496f0d3ec5d93b1fe470698548e734", "width": 1080, "height": 666}], "variants": {}, "id": "lgLmrb7N3-_WrnK86sgkiR36NkrdinQ9bY7z7lTdeVg"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 125, "id": "award_5f123e3d-4f48-42f4-9c11-e98b566d5897", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=16&height=16&auto=webp&s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=32&height=32&auto=webp&s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=48&height=48&auto=webp&s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=64&height=64&auto=webp&s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=128&height=128&auto=webp&s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "When you come across a feel-good thing.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Wholesome", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=16&height=16&auto=webp&s=92932f465d58e4c16b12b6eac4ca07d27e3d11c0", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=32&height=32&auto=webp&s=d11484a208d68a318bf9d4fcf371171a1cb6a7ef", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=48&height=48&auto=webp&s=febdf28b6f39f7da7eb1365325b85e0bb49a9f63", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=64&height=64&auto=webp&s=b4406a2d88bf86fa3dc8a45aacf7e0c7bdccc4fb", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png?width=128&height=128&auto=webp&s=19555b13e3e196b62eeb9160d1ac1d1b372dcb0b", "width": 128, "height": 128}], "icon_format": null, "icon_height": 2048, "penny_price": null, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/5izbv4fn0md41_Wholesome.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "234fbd78-ad54-11e5-b4c5-0e73c33c5a0b", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": "ʕ•ᴥ•ʔ🐻", "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#6189c0", "id": "k2pj9d", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "bigbear0083", "fullname": "t2_eaak0"}, "discussion_type": null, "num_comments": 10, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": "dark", "permalink": "/r/wallstreetbets/comments/k2pj9d/wall_street_week_ahead_for_the_trading_week/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k2pj9d/wall_street_week_ahead_for_the_trading_week/", "subreddit_subscribers": 1627136, "created_utc": 1606577439.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 9, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k2pj9d", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gdvw0wn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "DTisLOVE", "fullname": "t2_11m4fs"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k2pj9d", "score": 9, "author_fullname": "t2_11m4fs", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "i cant believe you do this shit for free every week even though nobody is going to fucking read the entire thing\n\napplause for you man", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>i cant believe you do this shit for free every week even though nobody is going to fucking read the entire thing</p>\n\n<p>applause for you man</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k2pj9d/wall_street_week_ahead_for_the_trading_week/gdvw0wn/", "num_reports": null, "locked": false, "name": "t1_gdvw0wn", "created": 1606608699.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606579899.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k2pj9d", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "gdvq63v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_k2pj9d", "score": 5, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k2pj9d/wall_street_week_ahead_for_the_trading_week/gdvq63v/", "num_reports": null, "locked": false, "name": "t1_gdvq63v", "created": 1606606241.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1606577441.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k2pj9d", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gdvrkzi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "trumpshairyclit", "fullname": "t2_3xf9y50y"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k2pj9d", "score": 4, "author_fullname": "t2_3xf9y50y", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Marry me.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Marry me.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k2pj9d/wall_street_week_ahead_for_the_trading_week/gdvrkzi/", "num_reports": null, "locked": false, "name": "t1_gdvrkzi", "created": 1606606859.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606578059.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}