{"approved_at_utc": null, "selftext": "WARNING: 8TH GRADE READING LEVEL REQUIRED FOR MATERIAL\n\n# Intro/Disclaimer\n\nyeah its long as fuck, but read for tendies. If its too long suck a bear dick and move on. This is real analysis of the business model, not just a bunch of emojis. It is so long because of the niche field it is operating in and how a lot of key points are not understood well by the WSB community. This company really is a diamond in the rough and a great way to play future trends with less risk as you're not picking winners. Its the \"picks and shovels\" play of electrification and renewable energies. I'll explain the realistic case for how this company is soon going to be running the best tendie mine for decades to come.\n\nThis is my second DD post on now $MP, formerly $FVAC, and i'm back to discuss the developments of the company since my pre-merger post and add some further analysis about the valuation of the company and its future. **There has been too much really shitty DD** from both bulls and bears **on this company**where very few people on here have a real understanding of this company, their business model, and the future.\n\nFirst - read my original DD post in order to have a decent understanding of the backstory cause I'm not about to type out all that shit again or explain what I've already written. Read that first then come back:\n\n[https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac\\_dd\\_evchina\\_tension\\_play/](https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac_dd_evchina_tension_play/)\n\nThat post discusses mainly international tensions and the role REE's but this one i'll speak more on the business case of this company and how even without geopolitical tensions it is a true tendie mine.\n\nSecond - no I'm not a bag holder Ive been in since it was a pre-merged SPAC my average on my shares is about $14 and my LEAP is far far ITM and no I'm not selling any of them. Also, as i referenced in the post I work in a very similar field and interned in college at a mineral mine in the refining aspect as a chemical engineer, so while I'm not an expert at this I have more insight than the average retard and I am trying to give out tendies before the boomers take them from us. I will try my best to explain the business model of a mining company and why this company is the most unique and interesting way to get tech company level growth with the associated free cash flow while not having to be anywhere near as innovative. Ill discuss a lot of the bear arguments for this company as well and try to de-bunk them as most don't really hold water once you look into them the slightest bit.\n\n# Background of NdPr\n\nWhile the company produces as basket of Rare Earth, the plant is aiming to focus on NdPr and other permanent magnet materials in order to play the trend of EV's and electrification. These magnets are extremely important for so many technologies due to how Electric motors work. To put it simply, at current technology the only way to convert electricity to motion or the only way to convert motion to electricity relies on permanent magnets. Im not gonna try to explain more than that because I too am retarded but if you don't believe me or want to learn how watch this  [video](https://www.youtube.com/watch?v=CWulQ1ZSE3c):\n\nyeah i know you didn't watch that video, but just imagine you did and now believe me.\n\nHowever, because it works both ways BOTH electric motors AND electric generators rely on this technology. This is key for understanding how NdPr is the best way to play both the trends of electrification AND renewables. First, electrification is most embodied by the rise in EV's in the future, and while that is predicted to be the fastest growing segment of NdPr demand it is foolish to not to account for other evolving technologies reliant on electric motors as well. Robotics will be a huge growth market and electrification of other industries will rely on NdPr permanent magnets. The other massive growth opportunity for permanent magnets is through renewable energies. Wind energy (and possible future motion based energy harvesting tech like tidal energy) work through harvesting mechanical motion and turning a generator to create electricity. Wind power doesn't work without electric generators which don't work without magnets. In addition, wind tech is advancing down a path to require even more magnets due to improvements is Permanent Magnet Direct-Drive (PMDD) technology from the current Gearbox doubly-fed induction Generator (DFIG). Essentially what that means is the new technology will take out the gearbox currently used in wind mills and replacing them with more efficient direct driving technology allowing more mechanical motion into electricity. These new generators require stronger magnets, thus more magnetic material. Read more about that [here](https://www.goldwindamericas.com/pmdd):\n\n**TLDR**: They mine mainly permanent magnet materials that at current scientific understanding CANNOT be replaced due to their unique electromagnetic properties.\n\n**TLDR on the TLDR**: Special Rocks no replacing. Need special rocks.\n\n# $MP's expansion plans\n\nA lot of bears like to bring up the fact that $MP is still reliant on China to do their refining and they're correct... for now. Currently they mine on site and refine to REE concentrates which they then send to china to refine into Rare Earth Oxides (REO's), which then get send to become metal alloys and then finally to magnets. Currently is the only location in the world to refine past concentrate material so $MP is forced to send their material there, but that is why the went public. The intent of them going public was to raise funds in order build an on-site REO facitility, which is scheduled for completion in 2022 and is already started. They already have enough cash on hand to furnish this upgrade as they had over $500M on hand at the end of Q3, and they also are a cash flow positive company already before even moving downstream. There are EV infrastructure plays with much worse valuations and years away from breaking even on cash flow, yes I'm talking to you $QS bagholders... that tech is unproven and there are so many battery competitors in a field where there WILL be a winner\n\nWhy would they want to move downstream when they're already profitable??? Because the further downstream they go the higher margins they earn and the more tendies they can mine for us. Refining raw materials to useful materials is a value adding process and thus creates more value for the company that does it. Once they complete this expansion they plan on going to stage 3 of their business model, the ability to build magnets and other final products of REE's in America. They have not decided/disclosed their plans for this, whether it is through construction of an onsite facility, an acquisition, or a joint venture, but it is in the plans. This is expected to come online around 2025 and when the insane cash flow can begin for the company. I don't have any reason to doubt the validity of their intention as its just a continuation of the business model they are currently implementing and the majority of the corporate rhetoric is related to \"mine-to-magnet\" and \"restoring the REE supply chain to America.\"\n\nWhat does this mean for the company? as they move further and further downstream they will increase their margins from this action alone, but it gets even better. This can be shown in their in-house calculations of their 2023 adj. EBITDA target of $252M\n\n&#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/7eiobfp84f961.png?width=1258&format=png&auto=webp&s=a41e24edbdadb0b1e55ec53ae92f7c4109f19b8d)\n\nit is important to note that those numbers are from the current step they are taking right now in building the REO refining facility. Adding further downstream capabilities will only cause that EBITDA value to grow as margins improve, but next I'll discuss where their margins will improve from EVEN MORE.\n\n**TLDR**: downstream expansion is a way to increase margins and therefore free cash flow for the company.\n\n**TLDR of TLDR**: Special rock get more special. Get more tendies for special rock.\n\n# Business model of mining companies and why $MP has insane growth potential\n\n*\\*\\*\\*This is the most important part of this long ass post, if you read one section, then read this\\*\\**\n\nA big disconnect on a lot of DD in this sub and analysis elsewhere is the economics of how a mining company works. A mine is by definition a COMMODITY PLAY, which I know is not as exciting as a tech company, BUT it will experience tech sector growth for a period of time and then experience a period of time in which develop into a cash cow business reaping huge dividends for shareholders.\n\nWhat i mean by a commodity play is through the economics of how a mine operates. Given a mine at a fixed production volume, the costs on a year in year out basis are relatively similar. What i mean by this is the cost $MP to mine and refine into concentrate will be the same no matter the price of their product. However, the revenue they receive is dependent on the market price of their product, which is what varies the most. An easy way to describe this is through taking a look at their Q3 2020 financial results presentation:\n\n&#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/ijzcpgmc4f961.png?width=760&format=png&auto=webp&s=d8bbfb1ba67f429886dc4abb6b6f1a9ef5862db1)\n\nThat value of Production cost (at the current stage of just creating REE concentrates) will realistically stay the same as that value is from the cost of labor, energy for machinery, administrative costs, etc. While these numbers will vary from quarter to quarter these are costs not predicted to experience rapid growth and this is what is important to realize. It costs roughly the same amount of money to pay someone to blast ore, dig it into dump trucks, pay operators to refine into ore, etc. Don't trust me, look into how steel companies operate, like this sub's favorite $MT. The revenue they receive is dependent on the price of REE's, which is NOT PREDICTED TO BE FLAT. Here is the historic graph of Neodymium from 2011-current:\n\n&#x200B;\n\n[https:\\/\\/tradingeconomics.com\\/commodity\\/neodymium](https://preview.redd.it/q1ytv5ch4f961.png?width=1502&format=png&auto=webp&s=6b5ddfa993ccb75cdf3638d13cbdf2748ccb7c9c)\n\n\\*\\*If you are an investor in $MP (which you should be) this is an important website to pay attention to because understanding the market dynamics of their product is important to understanding the valuation of this company. \\*\\*\n\nAllow me to disect that graph a little bit:\n\n1st Peak: From the aftermath of the supply shock from 2010/2011 from the Japanese Navy and Chinese fisherman story i discusses in my previous $FVAC post i linked above. China lowered exports by 40% and the price shot up drastically as industries across the world tried to gobble up as much NdPr as fast as possible in order to ensure their production lines. That was then followed by china flooding the market and selling back that backlog. that caused prices to fall off a cliff and ended up taking molyorp out of business. I'll discuss the Molycorp saga later more in depth and the differences of them and $MP.\n\n2nd Peak: This peak (late 2017) is from the Trade war trump caused with china and is another good explanation of the correlation between REE's and geopolitics i discussed in my last DD post. The middle 2019 peak is again the trade war heating up again.\n\n3rd peak: where we are now. This is from the increased tailwind of EV adoption, more from asia and Europe than the US **and** because china has been threatening to use REE's as a political tool again, which again i referenced more in my last DD post.\n\nHowever going forward if you want to predict the amount of revenue MP will earn its important to understand the market dynamic and I'd like to discuss why the price is geopolitics aside predicted to steadily increase at a very fast rate. MP, like any other commodity play, relies on the supply-demand dynamic of the sector, and REE demand growth is on track to far outstrip the supply growth. This will result increased prices per ton, but MP's costs stay the same. This is the beauty of the company, as the price goes up their margins go up too! MP and market analysts predicted over a 100% growth in NdPr magnets in the next 10 years:\n\n&#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/v0ta2r1l4f961.png?width=872&format=png&auto=webp&s=6281317204c497d54b7024e5208e7f04b8254db7)\n\nDon't believe that metric? check this more in depth one:\n\n&#x200B;\n\n[https:\\/\\/www.arultd.com\\/products\\/supply-and-demand.html](https://preview.redd.it/7kjnncgn4f961.jpg?width=6279&format=pjpg&auto=webp&s=97e90f92aa1b996a80b0dacc02fb2ecc09086815)\n\nThis graph shows most important metric as it shows that the world at current rate is not scaling up to meet demand. THIS GRAPH INCLUDES CURRENT PLANNED EXPANSIONS INCLUDING INCREASED RECYCLING. What does this mean?? There is a huge mismatch in projected demand and supply and if you don't know what that will mean then ask your wife's boyfriend about supply-demand graphs from their economics class. The result will be massively increased prices of permanent magnet materials because the world will not be able to mine and refine enough to satisfy demand, so they will be able to increase their prices. BUT AS I SAID EARLIER, MP'S COSTS PER TON WILL REMAIN THE SAME. So what is the gist of this coupled with MP moving toward downstream expansion? MP's margins will increase incredibly from a double whammy of moving downstream AND supply-demand imbalance. Now what does that mean for you?? that means $MP has a very realistic and conservative path toward becoming a company with RIDICULOUS free cash flow.\n\nWhat does that mean for MP? That means that the company will be raking in cash and will be extremely flexible due to their balance sheet. They will be able to expand operations or acquire competitors in order to increase their market share and production volumes OR they will be able to transition into a boomer dividend company that will pay you tendies each year. They could do either of those very easily because the company HAS NO DEBT. In fact, $MP ended Q3 2020 with $507M CASH on hand to finance their future expansions. Okay, i know dividends are boring but the market will begin to price in that future dividend potential and give your calls many tendies along the path to pricing in their dividend power.\n\n**TLDR**: Supply demand imbalance (with geopolitical tensions as a wild card) will result in insane free cash flow in the future for this company.\n\n**TLDR of the TLDR**: People want more special rock more than can make special rock. People give you more tendies for special rocks.\n\n# Why Supply won't be able to scale up as fast\n\nA very important assumption in my analysis is the inability for supply to scale up as fast as demand and I'd like to explain this more in depth as it is the crux of this DD. This is where my experience in mineral refining is valuable as I can weigh in on this aspect. Over time there will be more suppliers that come into the business and we are seeing that already, however this is where the timetables of that come into play. Simply put supply can't go up because companies will be slowed greatly due to the time it will take to get up and running and the incredible amount of upfront capital needed before even starting up the mine. If a company is interested in getting into the field there isn't a fast path in because the companies can't just decide to go into the business and then go to the \"REE refining machinery store\" and buy the equipment and have them get set up. All the machinery in chemical manufacturing plants (REE refining counts as chemical engineering so hear me out) has a long path in order to reach the optimum design. Ill outline the gist of this here:\n\n1. Lab Scale Testing: This is laboratory scale testing in which very small batches are prepared testing different procedures and methods in order to find the optimum refining process for the goals of the operation. This is when the deciding of the catalysts, solvents, additive chemicals, etc is done in order to decide **what to do** to the ore to get the best product.\n2. Pilot Plant Design and Testing: This step in the design process is designing and building a small scale model of machinery to run the process decided upon in lab scale testing in order to determine different operating conditions, determine control points, etc. This is when different tests and procedures are determined and also a proof of concept to begin economic calculations for designing the next step.\n3. Full scale design and building: This is when the full size, real-deal machinery is designed and constructed. But again, there is not \"REE refining manufacturing store\" to get much of this machinery. Refining plants are custom designed (minus certain machinery like pumps and basic ass shit like that) and custom built. These are custom designed, custom fabricated large scale machinery designed in every aspect from material, area, volume, and depth in order to lower manufacturing costs while also allowing for 24/7 continuous operation. The 24/7 operation aspect is important because it is why the machinery is designed so meticulously. The most economic operations are ones that require little down time and little maintenance and a lot of work is put in to optimize this aspect. That means it takes even more time to produce.\n4. Permitting and Certification: Now at this point the company is years into the development of REE refining, but they still can't start operating despite the entire operation up and running. In the US, now the lovely and very fast government gets to come in. Mining and refining operations don't operate under OSHA rules and procedures, they get to operate under OSHA's much meaner, expensive, and safety prone brother, the Mining Safety and Health Administration (MSHA). Government inspectors have to come in and permit and certify EVERY PIECE OF MACHINERY, inspect every single moving part and permit them, and do a shit ton of other stuff for the government to allow you to begin operations. Now due to the stimulus bill's provisions toward stimulating REE capabilities in the United states I assume that MSHA will be (or already has been) told to prioritize REE companies and they will probably be fast tracked, but even fast tracking them will take a lot of time. In addition EPA has to come in and sign off on the environmental plans of the company and probably even more government entities will have to come in to sign off on stuff that was past my exposure when I interned in the field.\n\nNow you've seen how long it would take to get up and running, but another constraint worth mentioning is who does these? Larger Chemical or mining companies (Dow, DuPont, Chemours, BASF, etc) looking to enter the field probably have their own design teams that would be able to do it in house. Smaller, non-conglomerate entities would have to hire a chemical engineering design/consulting firm to come in and do the designing, write the procedures, and train the production engineers and operators. That means there is some decent intellectual constraints as to how many people have the know-how to design at the rate needed to scale up.\n\n**Here is what is important,** any entity trying to enter the sector will have enormous upfront costs in buying the land, designing the plant, buying the machinery like excavators, dump trucks, pipelines, pay employees well before starting due to training on the machinery. Im not sure the exact amounts of money needed but it would easily be in the 100s of millions at least. Then once all that upfront capital is sourced, plant designed, people trained, etc the operation would take YEARS to get out of all that debt and achieve meaningful positive cash flow. It is only a matter of time for $MP to have significant domestic competition, but by the time these operations could begin operating $MP will be so far ahead in production and have a significantly stronger balance sheet than these companies could have. **$MP will remain years ahead of any other domestic competitors**, even though competition will come.\n\n**TLDR**: At current outlook supply growth won't match demand growth and even if more competitors pop up to compete it'll take years to start operating and even more years to match $MP's ability.\n\n**TLDR on the TLDR**: Not enough people finding special rock. More people want special rock than can get special rock. They pay more for special rock.\n\n# $MP's competitors, both domestic and international\n\nA large argument that bears like to make is that competition is coming in the US, and they are 100% correct.... but it won't matter because AGAIN this is a commodity play, not a tech company. They make magnets, their revenue will depend on the price of their product. Buyers from this are not looking at $MP like you would look at $TSLA vs. $NIO or apple vs android where you could argue one is better than the other or consumers will adopt one over the other. There isn't brand recognition, increased utility, or consumer favorites in magnets, they're fucking magnets. Think about it like another commodity, lumber. If you go to $HD to buy some wood you aren't staring at two different planks of the same type of tree and picking one because of which timber company felled it or which milling company milled it. You just buy lumber and go home because it is wood. A timber company isn't outright threatened by another timber company popping up, as long as the demand-supply dynamic in the market stays the same the first timber company is unaffected. That is why it won't matter WHEN more domestic and international competitors pop up. As long as demand outstrips supply then commodity companies will make more and more money. Now I am not trying to bullshit people so I'll discuss the international and domestic competition, but Ill explain more in depth why i don't give a shit about them.\n\nDomestic: The ticker that cannot be named due to it being banned. If you take a look at that company it is a Uranium producer that is going to re-purpose machinery onsite from uranium production to REE production and they have successfully done pilot plant level processing. However if you analyze their production numbers you'll see that the scale they plan on producing is not quite at the level $MP will. They plan on refining 15,000 tons of ore per year with an estimated 55% REE concentration, which leaves an estimated 8,250 tons of REE per year, of which 22% is NdP (all their numbers not mine), which leaves annual production of 1,815 tons/yr. These numbers are pretty good and I do own a stake in this company because I like the potential, but its scale is not quite the scale of $MP. $MP is predicting a run rate of 6,075 tons/yr of NdPr, so yes the banned ticker is a decent competitor but its only predicting to be 1/3 the size of $MP annual production volume. A downside of the banned ticker is that they still are focusing on Uranium production so its not a pure REE play, but Uranium has a pretty decent bull case for the future so i don't want to slander that ticker too much. However, again, these are commodity plays, $MP having competition, even domestic, doest really affect their business plans or bull case. Additionally, the banned ticker is sourcing its ore rom Chemours' location in GA, but getting milled in Utah, so this is a long term inefficiency to consider as well that $MP won't have to worry about once their stage 2 REO mill is complete. the banned tickers financial health is pretty decent, but its market cap is $516M at close 1/4 which is just slightly above amount of cash on hand $MP had at the end of Q3 2020, $502M. That company is more of an investment opportunity than a competitor, if its even worth investing in.\n\nOther emerging domestic competitors: [link to article explaining them all](https://www.reuters.com/article/us-usa-rareearths-projects-factbox/factbox-rare-earths-projects-under-development-in-u-s-idUSKCN2241L6) Im not going to go deep into each one but you can see that many are slowed down to the process I explained above about how expensive and time consuming it is to reach operational status. These companies will be coming online, but won't be profitable for a while and won't be able to provide the same returns to investors for even longer.\n\nInternational competitors: Lynas Corp. This is an Australian mining company that has also received pentagon funds to improve the non-China production capacity. They trade over the counter and are a real deal competitor and also worth investing in but their growth potential isn't as clear or easy as in the US. They have pentagon funding more so out of desperation by the pentagon to get more production in the western world than loving to invest in an Australian company. In the future I would imagine a lot of this government support will go toward US based companies.\n\nInternational competitors: all the china ones. yes they produce the largest amount of material in the world and do it the cheapest but this is the result of none to very little environmental protection. Once the supply chain can go \"mine to magnet\" many companies will look to diminish their exposure to chinese companies to ensure their supply chains are not at the whims of the Chinese government. In addition, $MP is the cleanest REE mine in the world and a lot of environmentally conscious companies will want to support clean mined REE's and once domestic production is high enough there could be regulations passed to further incentivize purchasing domestically produced REE's.\n\n**All these companies were included in the forecast of supply in 2030. Even with these companies coming online $MP is still positioned for incredible returns.**\n\n**TLDR**: Yes competition is coming, but there is already competition. Its also a commodity play so its not facing replacement or redundancy like many other growth markets\n\n**TLDR on the TLDR**: Others find special rock. Your special rock still worth many tendies. You still get many tendies.\n\n# Why this is NOT molycorp 2.0\n\nThe most common point of argument against this company is that people bring up the fact that the mine $MP operates used to be run by Molycorp, which went bankrupt. However if you read into that transaction it really isn't that scary. Molycorp did go under but this was in a period of price instability and they were not running as good of an operation. Molycorp operated during the 2010-2011 peak of REE's when china restricted supply. Molycorp stock went up a ton in addition to their revenue and thus they decided to invest in milling capabilities to create REO's (I know this is $MP's plan but don't get scared yet). Because of US EPA restrictions it was wildly expensive and at bankruptcy they had $1.7B in investments into capital projects to improve their refining capability, but the subsequent REE price collapse when china \"turned the taps back on\" to the world supply caused them to not afford operation. The site then changed hands back and forth until it was [bought by $MP's current management for $40M](https://en.wikipedia.org/wiki/Molycorp). They then invested in it after literally buying for less than pennies on the dollar and got it up and running more efficiently than before. Last quarter Q3 2020 they ran 3.2x the REE concentrate production volume than Molycorp ever did:\n\n&#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/c53c5a8w4f961.png?width=704&format=png&auto=webp&s=5a5d9f65cad202807588fe516b399ca954cef08a)\n\nThey got to buy over $1.7B worth of investments for $40M and have proven they have turned those investments into operating profit. In addition, previous operations prioritized Cerium production for FCC catalysts. $MP has transitioned the goal product to be NdPr as it has much better growth potential to give it long term possibility. In addition, the market climate Molycorp operated under was not as forgiving as now. Back then there wasn't the tailwind of increasing EV adoption, or the rise of other high tech growth sector reliant on REE's. Molycorp was too early and inefficient to win in the market and didn't have anywhere close to the amount of governmental support for the industry. There is bipartisan support on all levels, i mentioned this a bit in my last DD post, but since then - and this is big and shows the scale of gov support- [THE LAST STIMULUS BILL HAD $800M IN SUPPORT OF INCREASING DOMESTIC REE PRODUCTION](https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/miners-laud-800m-rare-earth-fund-in-omnibus-bill-61939620)! Molycorp didn't have anywhere close to this level of government support. And again, the pentagon invested $9M into $MP to help fund their REO mill because the pentagon views the ability to refine REO's as a matter of national security.\n\n# Discussing Concerns about Biden Presidency\n\nPeople who say this shit clearly have no idea what they are talking about. Biden (or his puppet masters but who cares money is all green) has said he supports REE mining multiple times [source](https://www.reuters.com/article/usa-election-mining/exclusive-biden-campaign-tells-miners-it-supports-domestic-production-of-ev-metals-idUSKBN27808B). His team knows their big environmental initiatives rely on REE production and that domestic production is important to keep American industry at the whims of China. Yeah Trump was more hawkish with china but lets not act like a democratic presidency is going to let china walk all over the US or that Biden and other democrats will stop their push for EV's and clean energy. REE's are a cornerstone piece to so many of Biden's plans there is no way he turns his back on this company.\n\n# Discussion of Shenghe Resources and China and their relationships with $MP\n\nThe one real concern that people have is their partnership with Shenghe Resources where Shenghe has agreed to buy all $MP concentrate through 2021 and shenghe is a stakeholder in $MP. Many view this as a negative, but i think it should be seen as a good way to ensure survival in the gap between now and the final magnet production. A big issue would be if China chose to stop importing the MP concentrate, which would give MP no customers. Since this would adversely affect Shenge it makes it less likely and also the fact that MP produces 15% of the world's REE concentrate it would hurt the supply in china, which is huge. In fact, China removed their 25% tariff on importing REE material, read this [source](https://www.argusmedia.com/en/news/2104418-china-to-remove-import-tariff-on-us-rare-earth-ores) as it also shows how china is buying up all the concentrate they can. Japan has the capability to go from REO to NdPr magnet as well so if china ends up fucking MP, starting in 2022 when their REO site is in operation then they will be able to sell their REO to Japanese companies to bridge the gap before they have their own magnet making capability.\n\n&#x200B;\n\n[https:\\/\\/s25.q4cdn.com\\/570172628\\/files\\/doc\\_financials\\/2020\\/q3\\/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf](https://preview.redd.it/fnvxv8415f961.png?width=2494&format=png&auto=webp&s=67a5db04a13d3e1c32d0f20de57b0f291e5b841a)\n\nChina is not likely to fuck MP and stop buying their concentrate as it will hurt china's wallet and ability to produce goods while only increasing the US government support for going mine to magnet domestically. China realistically views their dominance as ending at some point now, but they know they will still be able to control the market because of their scale regardless of whether they buy MP concentrates or not.\n\nAlso, if Shenghe doesn't buy their concentrates then they forfeit their stake in MP. they wouldn't be allowed to sell them on the market, the shares would just disappear, so it would effectively be a massive stock buyback and as long as the REO mill is complete then they just sell to Japanese magnet makers.\n\n# Mine Life discussion\n\nTheir S-1 states that at current proven reserves they have about 47 years of mine life left. That can be grown from drilling and exploration of more mineable material, which they stated they plan on doing. in addition, if they for some reason don't find more mineable ore on their land and don't buy more land with ore, then they could simply refine ore from other mines as the real cost barrier isn't the digging out of the ground, it is the milling.\n\n# TLDR\n\n$MP will to the moon over the next few years.\n\nPostions: shares for virgins and LEAPs for chads.\n\n&#x200B;\n\nEdit: addressing $QS collapse today (1/4 after a -40% on $QS) and the associated EV infrastructure. I think $QS hitting the shitter, well, predictable. People flooded to it as a result of attempting to find a parallel way to play the rise of EV's without understanding the company. $QS is a solid state battery technology, but I have never held a stake in it because, well, all it is is an idea or concept. It fell today as a result of a report criticizing the basis of its technology and I have to agree, the tech is not proven and even if it works as advertised there is a question of whether it could ever solidify its valuation, even after its collapse today. Solid state batteries MAY be the future, but for now their real place is in university and R&D laboratories as the tech is not proven to work as advertised. They are in the same situation as liquid metal batteries, cool ideas without the proof they will be successful in the market. HOWEVER, $MP is a way to play EV's & Renewable energy without the risk because $MP is not relying on scientific breakthroughs, it is a commodity producer. They don't care who wins the EV race, the battery tech or company that wins the battery race, or the wind energy companies that win contracts, all they care about is the mass adoption fo those technologies. It is a unique way to play these trends without having to bet on winners or losers in the field as you're betting solely on the industry. The company is positioned to benefit greatly regardless of who wins and lets be real, the market is incredibly saturated with companies that won't win. Look at all the different EV makers big and small, the different battery companies, etc. I have a tough believing that all the small EV makers will have a shot when the large auto companies get more involved. I believe the best way to see profit without that risk is through symmetrical bets with no breakthroughs needed, just the market to develop", "author_fullname": "t2_5tfc11ce", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "$MP mega-DD -- MP Materials: The Money Printer --EV/Renewable Infrastructure and REEEEEEEEEE's", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 105, "top_awarded_type": null, "hide_score": false, "media_metadata": {"7eiobfp84f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 20, "x": 108, "u": "https://preview.redd.it/7eiobfp84f961.png?width=108&crop=smart&auto=webp&s=124b05d028f2b9776a1620573153a8a8614ea1bb"}, {"y": 40, "x": 216, "u": "https://preview.redd.it/7eiobfp84f961.png?width=216&crop=smart&auto=webp&s=3a0e8bb4ad2e727bba5fb9dea967644969642301"}, {"y": 60, "x": 320, "u": "https://preview.redd.it/7eiobfp84f961.png?width=320&crop=smart&auto=webp&s=c51374908cefb323df39c9ed3f3b5d734509b67f"}, {"y": 120, "x": 640, "u": "https://preview.redd.it/7eiobfp84f961.png?width=640&crop=smart&auto=webp&s=75d8ca9ad08fe7cca24f83eb436687673f68bd7e"}, {"y": 180, "x": 960, "u": "https://preview.redd.it/7eiobfp84f961.png?width=960&crop=smart&auto=webp&s=702aa7223d2a96c616110959121ec5b997774030"}, {"y": 202, "x": 1080, "u": "https://preview.redd.it/7eiobfp84f961.png?width=1080&crop=smart&auto=webp&s=751017588e7147c6f65fae789395dd59f07b8133"}], "s": {"y": 236, "x": 1258, "u": "https://preview.redd.it/7eiobfp84f961.png?width=1258&format=png&auto=webp&s=a41e24edbdadb0b1e55ec53ae92f7c4109f19b8d"}, "id": "7eiobfp84f961"}, "ijzcpgmc4f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 23, "x": 108, "u": "https://preview.redd.it/ijzcpgmc4f961.png?width=108&crop=smart&auto=webp&s=68c46c2e3680b4f279809237264594931301cba3"}, {"y": 46, "x": 216, "u": "https://preview.redd.it/ijzcpgmc4f961.png?width=216&crop=smart&auto=webp&s=518c57d0eeb755a9e07c1eb6860d1f5dc2bacdcd"}, {"y": 68, "x": 320, "u": "https://preview.redd.it/ijzcpgmc4f961.png?width=320&crop=smart&auto=webp&s=203020508f878b99477fd9ac0b938adbc3f80be2"}, {"y": 136, "x": 640, "u": "https://preview.redd.it/ijzcpgmc4f961.png?width=640&crop=smart&auto=webp&s=75195ed47439af0dc88fe31c2377b66a0a6e4105"}], "s": {"y": 162, "x": 760, "u": "https://preview.redd.it/ijzcpgmc4f961.png?width=760&format=png&auto=webp&s=d8bbfb1ba67f429886dc4abb6b6f1a9ef5862db1"}, "id": "ijzcpgmc4f961"}, "v0ta2r1l4f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 137, "x": 108, "u": "https://preview.redd.it/v0ta2r1l4f961.png?width=108&crop=smart&auto=webp&s=2ad8b312e647e41f4872df4e84f939cfbc384d04"}, {"y": 275, "x": 216, "u": "https://preview.redd.it/v0ta2r1l4f961.png?width=216&crop=smart&auto=webp&s=c68f570a0b5b3b4b1199cadded2ce8a4249c3852"}, {"y": 408, "x": 320, "u": "https://preview.redd.it/v0ta2r1l4f961.png?width=320&crop=smart&auto=webp&s=e4364faf26dd59696f43cc4b254d179104dc43a4"}, {"y": 816, "x": 640, "u": "https://preview.redd.it/v0ta2r1l4f961.png?width=640&crop=smart&auto=webp&s=de31bc4cac83621d941b9d25344dcbec19f7b090"}], "s": {"y": 1112, "x": 872, "u": "https://preview.redd.it/v0ta2r1l4f961.png?width=872&format=png&auto=webp&s=6281317204c497d54b7024e5208e7f04b8254db7"}, "id": "v0ta2r1l4f961"}, "q1ytv5ch4f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 61, "x": 108, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=108&crop=smart&auto=webp&s=30f886779f6874350579df92c8eca7104c93316d"}, {"y": 123, "x": 216, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=216&crop=smart&auto=webp&s=d43ba7b9dd0cb0a3bc0d6252d173832b96c3bbbb"}, {"y": 182, "x": 320, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=320&crop=smart&auto=webp&s=7b25782352bc712d8c18c24900ba2dac4c78b398"}, {"y": 365, "x": 640, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=640&crop=smart&auto=webp&s=8a935fea6f94dc42db1acb6dbd7e8820278c9ad6"}, {"y": 548, "x": 960, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=960&crop=smart&auto=webp&s=73712081e450e3ae985ff69fbfbaa2a66262cc64"}, {"y": 616, "x": 1080, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=1080&crop=smart&auto=webp&s=ffd7bc3cf6f2e8b172dac213d18a90275f104231"}], "s": {"y": 858, "x": 1502, "u": "https://preview.redd.it/q1ytv5ch4f961.png?width=1502&format=png&auto=webp&s=6b5ddfa993ccb75cdf3638d13cbdf2748ccb7c9c"}, "id": "q1ytv5ch4f961"}, "7kjnncgn4f961": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 126, "x": 108, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=108&crop=smart&auto=webp&s=e4b0b5f5612d2c6bea27e43f08500e64f33ad67d"}, {"y": 253, "x": 216, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=216&crop=smart&auto=webp&s=9f060d5b331d861ee426b7ece99e436a46cab047"}, {"y": 376, "x": 320, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=320&crop=smart&auto=webp&s=eab866ba146e4e7c852c580928389a1104af26e4"}, {"y": 752, "x": 640, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=640&crop=smart&auto=webp&s=b62f9031fc2f50907cf890332ac6eb371dd5f0ec"}, {"y": 1128, "x": 960, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=960&crop=smart&auto=webp&s=ef583230ffd0c5aa69b7e074b63efae90f50715b"}, {"y": 1269, "x": 1080, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=1080&crop=smart&auto=webp&s=46266ab5eabcec1f1afeb8b39c8fcd152796f447"}], "s": {"y": 7380, "x": 6279, "u": "https://preview.redd.it/7kjnncgn4f961.jpg?width=6279&format=pjpg&auto=webp&s=97e90f92aa1b996a80b0dacc02fb2ecc09086815"}, "id": "7kjnncgn4f961"}, "fnvxv8415f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 39, "x": 108, "u": "https://preview.redd.it/fnvxv8415f961.png?width=108&crop=smart&auto=webp&s=ed22f9963f91d7872af21bd0fb7795123173318c"}, {"y": 78, "x": 216, "u": "https://preview.redd.it/fnvxv8415f961.png?width=216&crop=smart&auto=webp&s=1f39f2e56692426082d7778beb7e18bd70e88f09"}, {"y": 116, "x": 320, "u": "https://preview.redd.it/fnvxv8415f961.png?width=320&crop=smart&auto=webp&s=d2b4e74000b5a8f6d77917f75e1217e7113245a3"}, {"y": 233, "x": 640, "u": "https://preview.redd.it/fnvxv8415f961.png?width=640&crop=smart&auto=webp&s=aae032f9fecd8fc02fa48bac507447aa6f8bda84"}, {"y": 350, "x": 960, "u": "https://preview.redd.it/fnvxv8415f961.png?width=960&crop=smart&auto=webp&s=76b3eb9a19329a3fff8daab7b260f0e4677a73a8"}, {"y": 394, "x": 1080, "u": "https://preview.redd.it/fnvxv8415f961.png?width=1080&crop=smart&auto=webp&s=77829d6fd16f58fed42b9e6c5f119a570f0989dd"}], "s": {"y": 910, "x": 2494, "u": "https://preview.redd.it/fnvxv8415f961.png?width=2494&format=png&auto=webp&s=67a5db04a13d3e1c32d0f20de57b0f291e5b841a"}, "id": "fnvxv8415f961"}, "c53c5a8w4f961": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 169, "x": 108, "u": "https://preview.redd.it/c53c5a8w4f961.png?width=108&crop=smart&auto=webp&s=7cfadf3b49c65c1c486dc57ee9946ce99b4d597e"}, {"y": 339, "x": 216, "u": "https://preview.redd.it/c53c5a8w4f961.png?width=216&crop=smart&auto=webp&s=83bfda8817cff6a3a67de58a12cc5b20ed3385c5"}, {"y": 502, "x": 320, "u": "https://preview.redd.it/c53c5a8w4f961.png?width=320&crop=smart&auto=webp&s=9eca9bb1749351c59b4daba8dfa7fdfd92bcb5d6"}, {"y": 1005, "x": 640, "u": "https://preview.redd.it/c53c5a8w4f961.png?width=640&crop=smart&auto=webp&s=0706ee29b7d8b7df5715d20a5c470ac741f27662"}], "s": {"y": 1106, "x": 704, "u": "https://preview.redd.it/c53c5a8w4f961.png?width=704&format=png&auto=webp&s=5a5d9f65cad202807588fe516b399ca954cef08a"}, "id": "c53c5a8w4f961"}}, "name": "t3_kqnld7", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.91, "author_flair_background_color": null, "subreddit_type": "public", "ups": 57, "total_awards_received": 1, "media_embed": {"content": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CWulQ1ZSE3c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "width": 356, "scrolling": false, "height": 200}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "How does an Electric Motor work?  (DC Motor)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CWulQ1ZSE3c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "author_name": "Jared Owen", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/CWulQ1ZSE3c/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/c/JaredOwen"}}, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {"content": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CWulQ1ZSE3c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "width": 356, "scrolling": false, "media_domain_url": "https://www.redditmedia.com/mediaembed/kqnld7", "height": 200}, "link_flair_text": "DD", "can_mod_post": false, "score": 57, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/DhdTuXQyeFjTtYqVq3B8Gv1cUutJ1MPYHDXq6uXpUdg.jpg", "edited": 1609822469.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609839972.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>WARNING: 8TH GRADE READING LEVEL REQUIRED FOR MATERIAL</p>\n\n<h1>Intro/Disclaimer</h1>\n\n<p>yeah its long as fuck, but read for tendies. If its too long suck a bear dick and move on. This is real analysis of the business model, not just a bunch of emojis. It is so long because of the niche field it is operating in and how a lot of key points are not understood well by the WSB community. This company really is a diamond in the rough and a great way to play future trends with less risk as you&#39;re not picking winners. Its the &quot;picks and shovels&quot; play of electrification and renewable energies. I&#39;ll explain the realistic case for how this company is soon going to be running the best tendie mine for decades to come.</p>\n\n<p>This is my second DD post on now $MP, formerly $FVAC, and i&#39;m back to discuss the developments of the company since my pre-merger post and add some further analysis about the valuation of the company and its future. <strong>There has been too much really shitty DD</strong> from both bulls and bears <strong>on this company</strong>where very few people on here have a real understanding of this company, their business model, and the future.</p>\n\n<p>First - read my original DD post in order to have a decent understanding of the backstory cause I&#39;m not about to type out all that shit again or explain what I&#39;ve already written. Read that first then come back:</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac_dd_evchina_tension_play/\">https://www.reddit.com/r/wallstreetbets/comments/jgvarn/fvac_dd_evchina_tension_play/</a></p>\n\n<p>That post discusses mainly international tensions and the role REE&#39;s but this one i&#39;ll speak more on the business case of this company and how even without geopolitical tensions it is a true tendie mine.</p>\n\n<p>Second - no I&#39;m not a bag holder Ive been in since it was a pre-merged SPAC my average on my shares is about $14 and my LEAP is far far ITM and no I&#39;m not selling any of them. Also, as i referenced in the post I work in a very similar field and interned in college at a mineral mine in the refining aspect as a chemical engineer, so while I&#39;m not an expert at this I have more insight than the average retard and I am trying to give out tendies before the boomers take them from us. I will try my best to explain the business model of a mining company and why this company is the most unique and interesting way to get tech company level growth with the associated free cash flow while not having to be anywhere near as innovative. Ill discuss a lot of the bear arguments for this company as well and try to de-bunk them as most don&#39;t really hold water once you look into them the slightest bit.</p>\n\n<h1>Background of NdPr</h1>\n\n<p>While the company produces as basket of Rare Earth, the plant is aiming to focus on NdPr and other permanent magnet materials in order to play the trend of EV&#39;s and electrification. These magnets are extremely important for so many technologies due to how Electric motors work. To put it simply, at current technology the only way to convert electricity to motion or the only way to convert motion to electricity relies on permanent magnets. Im not gonna try to explain more than that because I too am retarded but if you don&#39;t believe me or want to learn how watch this  <a href=\"https://www.youtube.com/watch?v=CWulQ1ZSE3c\">video</a>:</p>\n\n<p>yeah i know you didn&#39;t watch that video, but just imagine you did and now believe me.</p>\n\n<p>However, because it works both ways BOTH electric motors AND electric generators rely on this technology. This is key for understanding how NdPr is the best way to play both the trends of electrification AND renewables. First, electrification is most embodied by the rise in EV&#39;s in the future, and while that is predicted to be the fastest growing segment of NdPr demand it is foolish to not to account for other evolving technologies reliant on electric motors as well. Robotics will be a huge growth market and electrification of other industries will rely on NdPr permanent magnets. The other massive growth opportunity for permanent magnets is through renewable energies. Wind energy (and possible future motion based energy harvesting tech like tidal energy) work through harvesting mechanical motion and turning a generator to create electricity. Wind power doesn&#39;t work without electric generators which don&#39;t work without magnets. In addition, wind tech is advancing down a path to require even more magnets due to improvements is Permanent Magnet Direct-Drive (PMDD) technology from the current Gearbox doubly-fed induction Generator (DFIG). Essentially what that means is the new technology will take out the gearbox currently used in wind mills and replacing them with more efficient direct driving technology allowing more mechanical motion into electricity. These new generators require stronger magnets, thus more magnetic material. Read more about that <a href=\"https://www.goldwindamericas.com/pmdd\">here</a>:</p>\n\n<p><strong>TLDR</strong>: They mine mainly permanent magnet materials that at current scientific understanding CANNOT be replaced due to their unique electromagnetic properties.</p>\n\n<p><strong>TLDR on the TLDR</strong>: Special Rocks no replacing. Need special rocks.</p>\n\n<h1>$MP&#39;s expansion plans</h1>\n\n<p>A lot of bears like to bring up the fact that $MP is still reliant on China to do their refining and they&#39;re correct... for now. Currently they mine on site and refine to REE concentrates which they then send to china to refine into Rare Earth Oxides (REO&#39;s), which then get send to become metal alloys and then finally to magnets. Currently is the only location in the world to refine past concentrate material so $MP is forced to send their material there, but that is why the went public. The intent of them going public was to raise funds in order build an on-site REO facitility, which is scheduled for completion in 2022 and is already started. They already have enough cash on hand to furnish this upgrade as they had over $500M on hand at the end of Q3, and they also are a cash flow positive company already before even moving downstream. There are EV infrastructure plays with much worse valuations and years away from breaking even on cash flow, yes I&#39;m talking to you $QS bagholders... that tech is unproven and there are so many battery competitors in a field where there WILL be a winner</p>\n\n<p>Why would they want to move downstream when they&#39;re already profitable??? Because the further downstream they go the higher margins they earn and the more tendies they can mine for us. Refining raw materials to useful materials is a value adding process and thus creates more value for the company that does it. Once they complete this expansion they plan on going to stage 3 of their business model, the ability to build magnets and other final products of REE&#39;s in America. They have not decided/disclosed their plans for this, whether it is through construction of an onsite facility, an acquisition, or a joint venture, but it is in the plans. This is expected to come online around 2025 and when the insane cash flow can begin for the company. I don&#39;t have any reason to doubt the validity of their intention as its just a continuation of the business model they are currently implementing and the majority of the corporate rhetoric is related to &quot;mine-to-magnet&quot; and &quot;restoring the REE supply chain to America.&quot;</p>\n\n<p>What does this mean for the company? as they move further and further downstream they will increase their margins from this action alone, but it gets even better. This can be shown in their in-house calculations of their 2023 adj. EBITDA target of $252M</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7eiobfp84f961.png?width=1258&amp;format=png&amp;auto=webp&amp;s=a41e24edbdadb0b1e55ec53ae92f7c4109f19b8d\">https://s25.q4cdn.com/570172628/files/doc_financials/2020/q3/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf</a></p>\n\n<p>it is important to note that those numbers are from the current step they are taking right now in building the REO refining facility. Adding further downstream capabilities will only cause that EBITDA value to grow as margins improve, but next I&#39;ll discuss where their margins will improve from EVEN MORE.</p>\n\n<p><strong>TLDR</strong>: downstream expansion is a way to increase margins and therefore free cash flow for the company.</p>\n\n<p><strong>TLDR of TLDR</strong>: Special rock get more special. Get more tendies for special rock.</p>\n\n<h1>Business model of mining companies and why $MP has insane growth potential</h1>\n\n<p><em>\\</em>**This is the most important part of this long ass post, if you read one section, then read this***</p>\n\n<p>A big disconnect on a lot of DD in this sub and analysis elsewhere is the economics of how a mining company works. A mine is by definition a COMMODITY PLAY, which I know is not as exciting as a tech company, BUT it will experience tech sector growth for a period of time and then experience a period of time in which develop into a cash cow business reaping huge dividends for shareholders.</p>\n\n<p>What i mean by a commodity play is through the economics of how a mine operates. Given a mine at a fixed production volume, the costs on a year in year out basis are relatively similar. What i mean by this is the cost $MP to mine and refine into concentrate will be the same no matter the price of their product. However, the revenue they receive is dependent on the market price of their product, which is what varies the most. An easy way to describe this is through taking a look at their Q3 2020 financial results presentation:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ijzcpgmc4f961.png?width=760&amp;format=png&amp;auto=webp&amp;s=d8bbfb1ba67f429886dc4abb6b6f1a9ef5862db1\">https://s25.q4cdn.com/570172628/files/doc_financials/2020/q3/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf</a></p>\n\n<p>That value of Production cost (at the current stage of just creating REE concentrates) will realistically stay the same as that value is from the cost of labor, energy for machinery, administrative costs, etc. While these numbers will vary from quarter to quarter these are costs not predicted to experience rapid growth and this is what is important to realize. It costs roughly the same amount of money to pay someone to blast ore, dig it into dump trucks, pay operators to refine into ore, etc. Don&#39;t trust me, look into how steel companies operate, like this sub&#39;s favorite $MT. The revenue they receive is dependent on the price of REE&#39;s, which is NOT PREDICTED TO BE FLAT. Here is the historic graph of Neodymium from 2011-current:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/q1ytv5ch4f961.png?width=1502&amp;format=png&amp;auto=webp&amp;s=6b5ddfa993ccb75cdf3638d13cbdf2748ccb7c9c\">https://tradingeconomics.com/commodity/neodymium</a></p>\n\n<p>**If you are an investor in $MP (which you should be) this is an important website to pay attention to because understanding the market dynamics of their product is important to understanding the valuation of this company. **</p>\n\n<p>Allow me to disect that graph a little bit:</p>\n\n<p>1st Peak: From the aftermath of the supply shock from 2010/2011 from the Japanese Navy and Chinese fisherman story i discusses in my previous $FVAC post i linked above. China lowered exports by 40% and the price shot up drastically as industries across the world tried to gobble up as much NdPr as fast as possible in order to ensure their production lines. That was then followed by china flooding the market and selling back that backlog. that caused prices to fall off a cliff and ended up taking molyorp out of business. I&#39;ll discuss the Molycorp saga later more in depth and the differences of them and $MP.</p>\n\n<p>2nd Peak: This peak (late 2017) is from the Trade war trump caused with china and is another good explanation of the correlation between REE&#39;s and geopolitics i discussed in my last DD post. The middle 2019 peak is again the trade war heating up again.</p>\n\n<p>3rd peak: where we are now. This is from the increased tailwind of EV adoption, more from asia and Europe than the US <strong>and</strong> because china has been threatening to use REE&#39;s as a political tool again, which again i referenced more in my last DD post.</p>\n\n<p>However going forward if you want to predict the amount of revenue MP will earn its important to understand the market dynamic and I&#39;d like to discuss why the price is geopolitics aside predicted to steadily increase at a very fast rate. MP, like any other commodity play, relies on the supply-demand dynamic of the sector, and REE demand growth is on track to far outstrip the supply growth. This will result increased prices per ton, but MP&#39;s costs stay the same. This is the beauty of the company, as the price goes up their margins go up too! MP and market analysts predicted over a 100% growth in NdPr magnets in the next 10 years:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v0ta2r1l4f961.png?width=872&amp;format=png&amp;auto=webp&amp;s=6281317204c497d54b7024e5208e7f04b8254db7\">https://s25.q4cdn.com/570172628/files/doc_financials/2020/q3/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf</a></p>\n\n<p>Don&#39;t believe that metric? check this more in depth one:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7kjnncgn4f961.jpg?width=6279&amp;format=pjpg&amp;auto=webp&amp;s=97e90f92aa1b996a80b0dacc02fb2ecc09086815\">https://www.arultd.com/products/supply-and-demand.html</a></p>\n\n<p>This graph shows most important metric as it shows that the world at current rate is not scaling up to meet demand. THIS GRAPH INCLUDES CURRENT PLANNED EXPANSIONS INCLUDING INCREASED RECYCLING. What does this mean?? There is a huge mismatch in projected demand and supply and if you don&#39;t know what that will mean then ask your wife&#39;s boyfriend about supply-demand graphs from their economics class. The result will be massively increased prices of permanent magnet materials because the world will not be able to mine and refine enough to satisfy demand, so they will be able to increase their prices. BUT AS I SAID EARLIER, MP&#39;S COSTS PER TON WILL REMAIN THE SAME. So what is the gist of this coupled with MP moving toward downstream expansion? MP&#39;s margins will increase incredibly from a double whammy of moving downstream AND supply-demand imbalance. Now what does that mean for you?? that means $MP has a very realistic and conservative path toward becoming a company with RIDICULOUS free cash flow.</p>\n\n<p>What does that mean for MP? That means that the company will be raking in cash and will be extremely flexible due to their balance sheet. They will be able to expand operations or acquire competitors in order to increase their market share and production volumes OR they will be able to transition into a boomer dividend company that will pay you tendies each year. They could do either of those very easily because the company HAS NO DEBT. In fact, $MP ended Q3 2020 with $507M CASH on hand to finance their future expansions. Okay, i know dividends are boring but the market will begin to price in that future dividend potential and give your calls many tendies along the path to pricing in their dividend power.</p>\n\n<p><strong>TLDR</strong>: Supply demand imbalance (with geopolitical tensions as a wild card) will result in insane free cash flow in the future for this company.</p>\n\n<p><strong>TLDR of the TLDR</strong>: People want more special rock more than can make special rock. People give you more tendies for special rocks.</p>\n\n<h1>Why Supply won&#39;t be able to scale up as fast</h1>\n\n<p>A very important assumption in my analysis is the inability for supply to scale up as fast as demand and I&#39;d like to explain this more in depth as it is the crux of this DD. This is where my experience in mineral refining is valuable as I can weigh in on this aspect. Over time there will be more suppliers that come into the business and we are seeing that already, however this is where the timetables of that come into play. Simply put supply can&#39;t go up because companies will be slowed greatly due to the time it will take to get up and running and the incredible amount of upfront capital needed before even starting up the mine. If a company is interested in getting into the field there isn&#39;t a fast path in because the companies can&#39;t just decide to go into the business and then go to the &quot;REE refining machinery store&quot; and buy the equipment and have them get set up. All the machinery in chemical manufacturing plants (REE refining counts as chemical engineering so hear me out) has a long path in order to reach the optimum design. Ill outline the gist of this here:</p>\n\n<ol>\n<li>Lab Scale Testing: This is laboratory scale testing in which very small batches are prepared testing different procedures and methods in order to find the optimum refining process for the goals of the operation. This is when the deciding of the catalysts, solvents, additive chemicals, etc is done in order to decide <strong>what to do</strong> to the ore to get the best product.</li>\n<li>Pilot Plant Design and Testing: This step in the design process is designing and building a small scale model of machinery to run the process decided upon in lab scale testing in order to determine different operating conditions, determine control points, etc. This is when different tests and procedures are determined and also a proof of concept to begin economic calculations for designing the next step.</li>\n<li>Full scale design and building: This is when the full size, real-deal machinery is designed and constructed. But again, there is not &quot;REE refining manufacturing store&quot; to get much of this machinery. Refining plants are custom designed (minus certain machinery like pumps and basic ass shit like that) and custom built. These are custom designed, custom fabricated large scale machinery designed in every aspect from material, area, volume, and depth in order to lower manufacturing costs while also allowing for 24/7 continuous operation. The 24/7 operation aspect is important because it is why the machinery is designed so meticulously. The most economic operations are ones that require little down time and little maintenance and a lot of work is put in to optimize this aspect. That means it takes even more time to produce.</li>\n<li>Permitting and Certification: Now at this point the company is years into the development of REE refining, but they still can&#39;t start operating despite the entire operation up and running. In the US, now the lovely and very fast government gets to come in. Mining and refining operations don&#39;t operate under OSHA rules and procedures, they get to operate under OSHA&#39;s much meaner, expensive, and safety prone brother, the Mining Safety and Health Administration (MSHA). Government inspectors have to come in and permit and certify EVERY PIECE OF MACHINERY, inspect every single moving part and permit them, and do a shit ton of other stuff for the government to allow you to begin operations. Now due to the stimulus bill&#39;s provisions toward stimulating REE capabilities in the United states I assume that MSHA will be (or already has been) told to prioritize REE companies and they will probably be fast tracked, but even fast tracking them will take a lot of time. In addition EPA has to come in and sign off on the environmental plans of the company and probably even more government entities will have to come in to sign off on stuff that was past my exposure when I interned in the field.</li>\n</ol>\n\n<p>Now you&#39;ve seen how long it would take to get up and running, but another constraint worth mentioning is who does these? Larger Chemical or mining companies (Dow, DuPont, Chemours, BASF, etc) looking to enter the field probably have their own design teams that would be able to do it in house. Smaller, non-conglomerate entities would have to hire a chemical engineering design/consulting firm to come in and do the designing, write the procedures, and train the production engineers and operators. That means there is some decent intellectual constraints as to how many people have the know-how to design at the rate needed to scale up.</p>\n\n<p><strong>Here is what is important,</strong> any entity trying to enter the sector will have enormous upfront costs in buying the land, designing the plant, buying the machinery like excavators, dump trucks, pipelines, pay employees well before starting due to training on the machinery. Im not sure the exact amounts of money needed but it would easily be in the 100s of millions at least. Then once all that upfront capital is sourced, plant designed, people trained, etc the operation would take YEARS to get out of all that debt and achieve meaningful positive cash flow. It is only a matter of time for $MP to have significant domestic competition, but by the time these operations could begin operating $MP will be so far ahead in production and have a significantly stronger balance sheet than these companies could have. <strong>$MP will remain years ahead of any other domestic competitors</strong>, even though competition will come.</p>\n\n<p><strong>TLDR</strong>: At current outlook supply growth won&#39;t match demand growth and even if more competitors pop up to compete it&#39;ll take years to start operating and even more years to match $MP&#39;s ability.</p>\n\n<p><strong>TLDR on the TLDR</strong>: Not enough people finding special rock. More people want special rock than can get special rock. They pay more for special rock.</p>\n\n<h1>$MP&#39;s competitors, both domestic and international</h1>\n\n<p>A large argument that bears like to make is that competition is coming in the US, and they are 100% correct.... but it won&#39;t matter because AGAIN this is a commodity play, not a tech company. They make magnets, their revenue will depend on the price of their product. Buyers from this are not looking at $MP like you would look at $TSLA vs. $NIO or apple vs android where you could argue one is better than the other or consumers will adopt one over the other. There isn&#39;t brand recognition, increased utility, or consumer favorites in magnets, they&#39;re fucking magnets. Think about it like another commodity, lumber. If you go to $HD to buy some wood you aren&#39;t staring at two different planks of the same type of tree and picking one because of which timber company felled it or which milling company milled it. You just buy lumber and go home because it is wood. A timber company isn&#39;t outright threatened by another timber company popping up, as long as the demand-supply dynamic in the market stays the same the first timber company is unaffected. That is why it won&#39;t matter WHEN more domestic and international competitors pop up. As long as demand outstrips supply then commodity companies will make more and more money. Now I am not trying to bullshit people so I&#39;ll discuss the international and domestic competition, but Ill explain more in depth why i don&#39;t give a shit about them.</p>\n\n<p>Domestic: The ticker that cannot be named due to it being banned. If you take a look at that company it is a Uranium producer that is going to re-purpose machinery onsite from uranium production to REE production and they have successfully done pilot plant level processing. However if you analyze their production numbers you&#39;ll see that the scale they plan on producing is not quite at the level $MP will. They plan on refining 15,000 tons of ore per year with an estimated 55% REE concentration, which leaves an estimated 8,250 tons of REE per year, of which 22% is NdP (all their numbers not mine), which leaves annual production of 1,815 tons/yr. These numbers are pretty good and I do own a stake in this company because I like the potential, but its scale is not quite the scale of $MP. $MP is predicting a run rate of 6,075 tons/yr of NdPr, so yes the banned ticker is a decent competitor but its only predicting to be 1/3 the size of $MP annual production volume. A downside of the banned ticker is that they still are focusing on Uranium production so its not a pure REE play, but Uranium has a pretty decent bull case for the future so i don&#39;t want to slander that ticker too much. However, again, these are commodity plays, $MP having competition, even domestic, doest really affect their business plans or bull case. Additionally, the banned ticker is sourcing its ore rom Chemours&#39; location in GA, but getting milled in Utah, so this is a long term inefficiency to consider as well that $MP won&#39;t have to worry about once their stage 2 REO mill is complete. the banned tickers financial health is pretty decent, but its market cap is $516M at close 1/4 which is just slightly above amount of cash on hand $MP had at the end of Q3 2020, $502M. That company is more of an investment opportunity than a competitor, if its even worth investing in.</p>\n\n<p>Other emerging domestic competitors: <a href=\"https://www.reuters.com/article/us-usa-rareearths-projects-factbox/factbox-rare-earths-projects-under-development-in-u-s-idUSKCN2241L6\">link to article explaining them all</a> Im not going to go deep into each one but you can see that many are slowed down to the process I explained above about how expensive and time consuming it is to reach operational status. These companies will be coming online, but won&#39;t be profitable for a while and won&#39;t be able to provide the same returns to investors for even longer.</p>\n\n<p>International competitors: Lynas Corp. This is an Australian mining company that has also received pentagon funds to improve the non-China production capacity. They trade over the counter and are a real deal competitor and also worth investing in but their growth potential isn&#39;t as clear or easy as in the US. They have pentagon funding more so out of desperation by the pentagon to get more production in the western world than loving to invest in an Australian company. In the future I would imagine a lot of this government support will go toward US based companies.</p>\n\n<p>International competitors: all the china ones. yes they produce the largest amount of material in the world and do it the cheapest but this is the result of none to very little environmental protection. Once the supply chain can go &quot;mine to magnet&quot; many companies will look to diminish their exposure to chinese companies to ensure their supply chains are not at the whims of the Chinese government. In addition, $MP is the cleanest REE mine in the world and a lot of environmentally conscious companies will want to support clean mined REE&#39;s and once domestic production is high enough there could be regulations passed to further incentivize purchasing domestically produced REE&#39;s.</p>\n\n<p><strong>All these companies were included in the forecast of supply in 2030. Even with these companies coming online $MP is still positioned for incredible returns.</strong></p>\n\n<p><strong>TLDR</strong>: Yes competition is coming, but there is already competition. Its also a commodity play so its not facing replacement or redundancy like many other growth markets</p>\n\n<p><strong>TLDR on the TLDR</strong>: Others find special rock. Your special rock still worth many tendies. You still get many tendies.</p>\n\n<h1>Why this is NOT molycorp 2.0</h1>\n\n<p>The most common point of argument against this company is that people bring up the fact that the mine $MP operates used to be run by Molycorp, which went bankrupt. However if you read into that transaction it really isn&#39;t that scary. Molycorp did go under but this was in a period of price instability and they were not running as good of an operation. Molycorp operated during the 2010-2011 peak of REE&#39;s when china restricted supply. Molycorp stock went up a ton in addition to their revenue and thus they decided to invest in milling capabilities to create REO&#39;s (I know this is $MP&#39;s plan but don&#39;t get scared yet). Because of US EPA restrictions it was wildly expensive and at bankruptcy they had $1.7B in investments into capital projects to improve their refining capability, but the subsequent REE price collapse when china &quot;turned the taps back on&quot; to the world supply caused them to not afford operation. The site then changed hands back and forth until it was <a href=\"https://en.wikipedia.org/wiki/Molycorp\">bought by $MP&#39;s current management for $40M</a>. They then invested in it after literally buying for less than pennies on the dollar and got it up and running more efficiently than before. Last quarter Q3 2020 they ran 3.2x the REE concentrate production volume than Molycorp ever did:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/c53c5a8w4f961.png?width=704&amp;format=png&amp;auto=webp&amp;s=5a5d9f65cad202807588fe516b399ca954cef08a\">https://s25.q4cdn.com/570172628/files/doc_financials/2020/q3/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf</a></p>\n\n<p>They got to buy over $1.7B worth of investments for $40M and have proven they have turned those investments into operating profit. In addition, previous operations prioritized Cerium production for FCC catalysts. $MP has transitioned the goal product to be NdPr as it has much better growth potential to give it long term possibility. In addition, the market climate Molycorp operated under was not as forgiving as now. Back then there wasn&#39;t the tailwind of increasing EV adoption, or the rise of other high tech growth sector reliant on REE&#39;s. Molycorp was too early and inefficient to win in the market and didn&#39;t have anywhere close to the amount of governmental support for the industry. There is bipartisan support on all levels, i mentioned this a bit in my last DD post, but since then - and this is big and shows the scale of gov support- <a href=\"https://www.spglobal.com/marketintelligence/en/news-insights/latest-news-headlines/miners-laud-800m-rare-earth-fund-in-omnibus-bill-61939620\">THE LAST STIMULUS BILL HAD $800M IN SUPPORT OF INCREASING DOMESTIC REE PRODUCTION</a>! Molycorp didn&#39;t have anywhere close to this level of government support. And again, the pentagon invested $9M into $MP to help fund their REO mill because the pentagon views the ability to refine REO&#39;s as a matter of national security.</p>\n\n<h1>Discussing Concerns about Biden Presidency</h1>\n\n<p>People who say this shit clearly have no idea what they are talking about. Biden (or his puppet masters but who cares money is all green) has said he supports REE mining multiple times <a href=\"https://www.reuters.com/article/usa-election-mining/exclusive-biden-campaign-tells-miners-it-supports-domestic-production-of-ev-metals-idUSKBN27808B\">source</a>. His team knows their big environmental initiatives rely on REE production and that domestic production is important to keep American industry at the whims of China. Yeah Trump was more hawkish with china but lets not act like a democratic presidency is going to let china walk all over the US or that Biden and other democrats will stop their push for EV&#39;s and clean energy. REE&#39;s are a cornerstone piece to so many of Biden&#39;s plans there is no way he turns his back on this company.</p>\n\n<h1>Discussion of Shenghe Resources and China and their relationships with $MP</h1>\n\n<p>The one real concern that people have is their partnership with Shenghe Resources where Shenghe has agreed to buy all $MP concentrate through 2021 and shenghe is a stakeholder in $MP. Many view this as a negative, but i think it should be seen as a good way to ensure survival in the gap between now and the final magnet production. A big issue would be if China chose to stop importing the MP concentrate, which would give MP no customers. Since this would adversely affect Shenge it makes it less likely and also the fact that MP produces 15% of the world&#39;s REE concentrate it would hurt the supply in china, which is huge. In fact, China removed their 25% tariff on importing REE material, read this <a href=\"https://www.argusmedia.com/en/news/2104418-china-to-remove-import-tariff-on-us-rare-earth-ores\">source</a> as it also shows how china is buying up all the concentrate they can. Japan has the capability to go from REO to NdPr magnet as well so if china ends up fucking MP, starting in 2022 when their REO site is in operation then they will be able to sell their REO to Japanese companies to bridge the gap before they have their own magnet making capability.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/fnvxv8415f961.png?width=2494&amp;format=png&amp;auto=webp&amp;s=67a5db04a13d3e1c32d0f20de57b0f291e5b841a\">https://s25.q4cdn.com/570172628/files/doc_financials/2020/q3/MP-3Q20-Earnings-Deck-FINAL-11.23.2020.pdf</a></p>\n\n<p>China is not likely to fuck MP and stop buying their concentrate as it will hurt china&#39;s wallet and ability to produce goods while only increasing the US government support for going mine to magnet domestically. China realistically views their dominance as ending at some point now, but they know they will still be able to control the market because of their scale regardless of whether they buy MP concentrates or not.</p>\n\n<p>Also, if Shenghe doesn&#39;t buy their concentrates then they forfeit their stake in MP. they wouldn&#39;t be allowed to sell them on the market, the shares would just disappear, so it would effectively be a massive stock buyback and as long as the REO mill is complete then they just sell to Japanese magnet makers.</p>\n\n<h1>Mine Life discussion</h1>\n\n<p>Their S-1 states that at current proven reserves they have about 47 years of mine life left. That can be grown from drilling and exploration of more mineable material, which they stated they plan on doing. in addition, if they for some reason don&#39;t find more mineable ore on their land and don&#39;t buy more land with ore, then they could simply refine ore from other mines as the real cost barrier isn&#39;t the digging out of the ground, it is the milling.</p>\n\n<h1>TLDR</h1>\n\n<p>$MP will to the moon over the next few years.</p>\n\n<p>Postions: shares for virgins and LEAPs for chads.</p>\n\n<p>&#x200B;</p>\n\n<p>Edit: addressing $QS collapse today (1/4 after a -40% on $QS) and the associated EV infrastructure. I think $QS hitting the shitter, well, predictable. People flooded to it as a result of attempting to find a parallel way to play the rise of EV&#39;s without understanding the company. $QS is a solid state battery technology, but I have never held a stake in it because, well, all it is is an idea or concept. It fell today as a result of a report criticizing the basis of its technology and I have to agree, the tech is not proven and even if it works as advertised there is a question of whether it could ever solidify its valuation, even after its collapse today. Solid state batteries MAY be the future, but for now their real place is in university and R&amp;D laboratories as the tech is not proven to work as advertised. They are in the same situation as liquid metal batteries, cool ideas without the proof they will be successful in the market. HOWEVER, $MP is a way to play EV&#39;s &amp; Renewable energy without the risk because $MP is not relying on scientific breakthroughs, it is a commodity producer. They don&#39;t care who wins the EV race, the battery tech or company that wins the battery race, or the wind energy companies that win contracts, all they care about is the mass adoption fo those technologies. It is a unique way to play these trends without having to bet on winners or losers in the field as you&#39;re betting solely on the industry. The company is positioned to benefit greatly regardless of who wins and lets be real, the market is incredibly saturated with companies that won&#39;t win. Look at all the different EV makers big and small, the different battery companies, etc. I have a tough believing that all the small EV makers will have a shot when the large auto companies get more involved. I believe the best way to see profit without that risk is through symmetrical bets with no breakthroughs needed, just the market to develop</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/-usWv0k5BjQbAd3YfL3Mi11SA3R4LH5g1OL8DGPXMKY.jpg?auto=webp&s=a5ccb0118b6b711cb284f1b54480979f17193137", "width": 480, "height": 360}, "resolutions": [{"url": "https://external-preview.redd.it/-usWv0k5BjQbAd3YfL3Mi11SA3R4LH5g1OL8DGPXMKY.jpg?width=108&crop=smart&auto=webp&s=8b0715f2f72735c3f3cdd6d016e7b6a1245297d5", "width": 108, "height": 81}, {"url": "https://external-preview.redd.it/-usWv0k5BjQbAd3YfL3Mi11SA3R4LH5g1OL8DGPXMKY.jpg?width=216&crop=smart&auto=webp&s=78bcfc6e54254382de5a15706759172f9f48c755", "width": 216, "height": 162}, {"url": "https://external-preview.redd.it/-usWv0k5BjQbAd3YfL3Mi11SA3R4LH5g1OL8DGPXMKY.jpg?width=320&crop=smart&auto=webp&s=deea2a6254d2d8d86c5755f148e668816e93c1b9", "width": 320, "height": 240}], "variants": {}, "id": "NRKsrAkWkuHKdIFXkECtZjdNh4kzG0f37hoE-JYvVGM"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 150, "id": "award_f44611f1-b89e-46dc-97fe-892280b13b82", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=16&height=16&auto=webp&s=a5662dfbdb402bf67866c050aa76c31c147c2f45", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=32&height=32&auto=webp&s=a6882eb3f380e8e88009789f4d0072e17b8c59f1", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=48&height=48&auto=webp&s=e50064b090879e8a0b55e433f6ee61d5cb5fbe1d", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=64&height=64&auto=webp&s=8e5bb2e76683cb6b161830bcdd9642049d6adc11", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=128&height=128&auto=webp&s=eda4a9246f95f42ee6940cc0ec65306fd20de878", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Thank you stranger. Shows the award.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Helpful", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=16&height=16&auto=webp&s=a5662dfbdb402bf67866c050aa76c31c147c2f45", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=32&height=32&auto=webp&s=a6882eb3f380e8e88009789f4d0072e17b8c59f1", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=48&height=48&auto=webp&s=e50064b090879e8a0b55e433f6ee61d5cb5fbe1d", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=64&height=64&auto=webp&s=8e5bb2e76683cb6b161830bcdd9642049d6adc11", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png?width=128&height=128&auto=webp&s=eda4a9246f95f42ee6940cc0ec65306fd20de878", "width": 128, "height": 128}], "icon_format": null, "icon_height": 2048, "penny_price": null, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/klvxk1wggfd41_Helpful.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kqnld7", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "poopbutt6942069", "fullname": "t2_5tfc11ce"}, "discussion_type": null, "num_comments": 58, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kqnld7/mp_megadd_mp_materials_the_money_printer/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kqnld7/mp_megadd_mp_materials_the_money_printer/", "subreddit_subscribers": 1770183, "created_utc": 1609811172.0, "num_crossposts": 0, "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "How does an Electric Motor work?  (DC Motor)", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/CWulQ1ZSE3c?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "author_name": "Jared Owen", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/CWulQ1ZSE3c/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/c/JaredOwen"}}, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 42, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kqnld7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi4u8zh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "realtimetrader", "fullname": "t2_7ych24tn"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kqnld7", "score": 42, "author_fullname": "t2_7ych24tn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "A lot of words, fuck it I’m in", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>A lot of words, fuck it I’m in</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kqnld7/mp_megadd_mp_materials_the_money_printer/gi4u8zh/", "num_reports": null, "locked": false, "name": "t1_gi4u8zh", "created": 1609840229.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609811429.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 22, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kqnld7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi4undc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "SheasCode", "fullname": "t2_5fvzovtp"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kqnld7", "score": 22, "author_fullname": "t2_5fvzovtp", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I’m giving this to my 8th grade class as their English final.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I’m giving this to my 8th grade class as their English final.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kqnld7/mp_megadd_mp_materials_the_money_printer/gi4undc/", "num_reports": null, "locked": false, "name": "t1_gi4undc", "created": 1609840431.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609811631.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 19, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kqnld7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi4w7no", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "DownrightNeighborly", "fullname": "t2_t7a6b"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kqnld7", "score": 19, "author_fullname": "t2_t7a6b", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Holy fuck. Is this the longest DD to ever grace this sub?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201228:1:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Holy fuck. Is this the longest DD to ever grace this sub?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kqnld7/mp_megadd_mp_materials_the_money_printer/gi4w7no/", "num_reports": null, "locked": false, "name": "t1_gi4w7no", "created": 1609841219.0, "author_flair_text": "\u001b201228:1:1", "treatment_tags": [], "created_utc": 1609812419.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}