{"approved_at_utc": null, "selftext": "Alright. Hear me out autists. We all know bears are gay. But with TSLA shares reaching an ATH of $816.99, it sure seems like its fundamentals are completely divorced from reality. And the media analysts has been pounding on TSLA for seemingly years now. So is this a good company to be a gay bear on? Or Nah?\n\n&nbsp;\n\nOn 7 Jan 2020, Royal Bank of Canada admitted that \"There is no graceful way to put this other than to say we got TSLA's stock completely wrong\" and upgraded TSLA from $339 to $700. And on 6 Jan 2020, Morgan Stanley upgraded their TSLA price target to $810 when just 18 months ago they announced their comically low price target of $10 (that's $2 post split) resulting in a massive rally. Did  Morgan Stanley dive head first into WSB level 3 autism territory, or is there something that the uninitiated could be missing? Let's do a deep dive into Tesla the company and see if their stock really is in a bubble, or if there could be some substance behind the current insane rally.\n\n&nbsp;\n\n---\n\n&nbsp;\n\nThe common FUD narrative among TSLAQ is that TSLA's $700+ billion market cap is now larger than the 10 largest auto manufacturers combined. Indeed, this is quite insane. Even without us autists doing complex calculations, a simple google search shows that they would have to sell around 70 million vehicles a year to be priced at that level. So how many vehicles did Tesla produce? Tesla announced on 2 January 2020 that they've sold a little shy of 500K vehicles for CY 2020 with plans to increase production by 50% YoY. This would ultimately bring them to 20 million vehicles produced by 2030. \n\n&nbsp;\n\n20 mil by 2030. Although we all know the term \"Elon Time\", which refers to CEO Elon Musk casually announcing an estimate of a product and missing projected timelines by large margins, there seems to be some credibility to this statement. Back in 2014, Elon Musk [gave an interview (2:28)](https://youtu.be/arauCxOuDxU?t=148) where he stated that he \"feels comfortable being able to achieve at least half a million cars a year by 2020\". \n\n&nbsp;\n\nOK. So let's give him the benefit of the doubt. As a matter of fact, Tesla is actually building factories at breakneck speeds with construction literally running 24/7 and each of their large factories (Austin and Berlin) is said to be capable of producing up to 2 million vehicles a year. Giga Berlin which was an empty field 9 months ago is already [close to finishing its outer construction layer](https://cdn.shopify.com/s/files/1/0173/8204/7844/articles/2_c51cdcab-d351-40f5-860f-1aa95dd1d3d7_1800x.jpg?v=1609802044). Obviously they plan to announce more factory constructions in the future as well. So they do seem to be on track to grow on average 50% YoY for now. But 20 million cars produced by 2030 is still massively shy of 70 million vehicles. Even with growth factored in, TSLA's stock valuation still seems insanely high. So what gives? The common explanation among the Tesla fanboys is that TSLA is a tech company, not an automotive company, so it should be valued just so. \n\n&nbsp;\n\nSo what is this mystical technology the fanboys speak of, and how is it being deployed in terms of profitability for Tesla? Well, it turns out that Tesla has three main technological advantages and two main revenue streams that might put them leaps and bounds ahead of competitors.\n\n&nbsp;\n\n1. **Autonomous Driving** - Tesla is the current market leader in vehicle autonomy. It has over [3 billion miles logged](https://lexfridman.com/tesla-autopilot-miles-and-vehicles/) as of April 2020. The next industry leader Waymo (owned by google) has approximately 20 million miles logged. One thing for sure is that no company will be able to catch Tesla in terms of pure data advantage within the next 4-5 years. And when it comes to Artificial Intelligence, data is king. This could be the bread and butter of Tesla. Tesla already charges customers $10k per vehicle to enable full self driving in which 25% of their customers choose the option. However, Tesla hasn't taken full profits on their books yet due to it still being in beta mode. Once they solve autonomy, an over-the-air (OTA) software update will be sent out just like how your iPhone updates and bam! now you have self driving vehicle. Let's say Tesla charges $2k a year for a self driving vehicle that can also function as an autonomous uber driver which will help you pay down your vehicle or self driving subscription service. That's like selling two iPhone pros per every customer every year. And customers on their robotaxi network will also have to share 20% profits with Tesla.\n\n2. **Vehicle Manufacturing** - Tesla is an innovator when it comes to vehicle manufacturing technology, specifically robotics. Along with their insane factory automation process, they also have giga casters that mold car pieces quickly and efficiently that no other manufacturers have, and giant automated paint shops. This cuts down massively on labor and allows for quicker production while keeping margins high. Due to innovative technologies like these, it is estimated that Tesla's Shanghai Model 3 vehicles [net around 30% profit margins](https://www.cnbc.com/2019/11/13/teslas-shanghai-gigafactory-will-boost-margins-morgan-stanley.html), even after they've recently slashed their prices by 8%. Tesla recently slashed their [Model Y price by 30%](https://insideevs.com/news/463797/china-tesla-announced-new-prices-model-y-sales/) but still boast an [astonishing 29% profit margin](https://www.teslarati.com/tesla-china-model-y-gross-margin-30-percent-report/) which is approximately 3 times the industry average. So even if robotaxi doesn't work out, they are still an industry leader by a large stretch in terms of profit margins. These margins will only increase after Giga Berlin is operational due to no longer having to ship vehicles across the Pacific to European customers.\n\n3. **Vertical Integration** - Tesla is famous for its vertical integration. This is mainly due to having supply chain issues in the early days, but what this has enabled is agile production capability and larger profit margins. Due to this capability, Tesla improves components of their vehicles on the fly instead of the annual model release the traditional industry uses. Also, they don't have to share profits with suppliers or worry about constraints, delivery delays, or slow progress on contracts. \n\n4. **No Advertising & Dealerships** - Elon Musk is a walking billboard. The media literally gives Tesla free advertisement every day. As production increases, Tesla might have to start advertising in the future. But for now it seems like Teslas are selling themselves. Tesla has literally sold 100% of the vehicles they've ever produced, and they have never advertised any of their vehicles. Also, they do not have to share profits with dealerships with direct-to-consumer sales. If their market dominance and technology superiority continues, it is bound to stay the industry leader just like apple did with its iPhones. And if they solve autonomy first which they seem on track to do so, what's more to say?\n\n5. **Regulatory Credits AKA Carbon Credits** - This is one that TSLAQs love to bring up when it comes to Tesla profits. You see, a handful of US States enacted a law that requires manufacturers to sell a certain percentage of [Zero Emission Vehicles (ZEV) in their state](https://www.currentautomotive.com/what-is-a-zev-credit-and-how-does-tesla-make-money-with-them/) which will earn them ZEV credits. If not, they will either have to pay a massive penalty fine, or buy ZEV credits from vehicle manufacturers who have plenty to spare. And Tesla has an overflow of ZEV credits laying around. So Tesla is literally getting paid by other vehicle manufacturers to build their vehicles. TSLAQs (incorrectly) state that the only reason Tesla makes a profit is because of regulatory credits. However, Tesla's [**ZEV credits only make up around 5% of their revenue**](https://tesla-cdn.thron.com/static/4E7BR9_TSLA_Q3_2020_Update_P0Q85U.pdf?xseo=&response-content-disposition=inline%3Bfilename%3D%22TSLA-Q3-2020-Update.pdf%22) and it is slowly falling. No serious vehicle manufacturer will likely produce ICE vehicles in the year 2030 so ZEV credits fazing out is to be expected. Tesla vehicles are massively profitable as mentioned in bullet #2 even without the ZEV credits.\n\n&nbsp;\n\nSo we went over the main revenue streams of Tesla. And if all works out well, it seems likely that Tesla has a good chance of 'winning' if they maintain their market leadership. However, the competition is coming, right? We have our favorite EV players such as Nio, XPeng, Li, Rivian, BYD etc. Also the traditional ICE manufacturers VolksWagen has their ID.4, Ford has thier Mustang Mach-E, Audi has thier etron, Porche has their Tycan, and GM has the Chevy Bolt and 30 EVs planned for the future. It seems inevitable that these industry giants with their massive resources will overtake Tesla. Or will they?\n\n&nbsp;\n\n---\n\n&nbsp;\n\n## **Why the Competition is NOT Coming (Tesla's Moats)**:\n\n&nbsp;\n\n1. **Difficulties of creating an EV vs. Mass Production**: Creating a shell of an EV or a prototype is extremely easy. If anything, Nikola has showed this to be true. Rivian seems to be having the same issue Tesla had when starting up where they had to constantly push back release dates due to how difficult it is to engineer and manufacture an EV. So designing a prototype is easy. Manufacturing an EV is another thing. But mass production is a whole different beast. It took Tesla well over 16 years to perfect their technology and mass produce their model 3 despite having the best engineers in the world working for them. Ever wonder why every single vehicle manufacturer has constantly been pushed back their EV production timelines? It's because EVs are difficult. Also to note is that no vehicle manufacturer other than Tesla has been able to achieve mass production in EVs. And until then, Tesla has no competition in the near horizon.\n\n2. [**Supercharger network**](https://pbs.twimg.com/media/ErACHc5XUAA7RD-?format=jpg&name=medium): Tesla has the largest charging network in the world by orders of magnitude and they will continue to grow. VW is a low trailing second in the market due to penalties in their dieselgate scandel and as a lucky maneuver, [decided to build their electrify-america charging network](https://www.cnbc.com/2019/05/10/vws-2-billion-penalty-for-diesel-scam-builds-ev-charging-network-across-us.html). BTW, due to sunk costs, VW will likely be the only traditional ICE manufacturer that stands a chance in surviving in the long run. Tesla owners barely get range anxiety like they used to back in the day. This is because it is easy to find a charging station even if they are going on a long trip with their map integration. However, you cannot say the same for the other EVs.\n\n3. **Lidar vs. Camera**: Tesla's vehicles famously does not use lidar technology. Instead, they almost only rely on vision (cameras). There are three main reasons for this. (I.) Cameras are extremely cheap. Lidar is not. One of Waymo's vehicles are estimated to have cost over $250k back in a 2017 estimate. Although in recent years Waymo seems to have developed lidar hardware that costs 90% less at $7.5k, it is still ridiculously expensive compared to cameras without adding much value. Here is Elon Musk's explanation, massively paraphrased: \"Cameras augmented with AI can do almost all the things that lidar does chiefly depth sensing. Human vision does not require a separate depth sensor, and the entire driving infrastructure is built with human vision in mind. Lidar is a fools errand.\" Instead, Tesla augments its self driving technology with radar and maps. (II.) Lidar technology is usually augmented with something called HD maps. This is extreme detailed mapping (to the centimeter level) that helps lidar depth sensors with navigation. However, the issue with HD maps is that the file sizes are obviously large. And when detailed maps need to be updated due to construction or whatever which happens everywhere, every day, an OTA update needs to be sent out. And how do you update a fleet of all your vehicles when nationwide full coverage of 5G isn't a thing? So vehicles like Waymos are extremely good at driving within their geo-fenced locations, until they leave the area. And then they are absolute crap at it. OTOH, vision-based self driving vehicles are initially bad at the task until they have sufficient data and then they can drive well in almost every situation even without it being connected to the network. (III.) Vision-focused self driving AI can be augmented with additional sensors such as radar/lidar afterwards, but the inverse does not work. To put it short, if your lidar sensors disagree on the information they see at the moment, its entire system cannot function.\n\n4. **Technological Dominance**: Tesla's vertical integration and engineering produced innovative solutions such as the [octovalve](https://www.tesmanian.com/blogs/tesmanian-blog/deep-looks-into-tesla-model-y-s-octovalve), [heat pump](https://www.currentautomotive.com/model-y-is-the-first-tesla-with-a-heat-pump-heres-why-thats-a-big-deal/), [leadership in battery and vehicle efficiency](https://www.youtube.com/watch?v=HK79ioBW8Mg), [custom designed AI chips](https://youtu.be/Ucp0TTmvqOE) and a AI supercomputer server ([Tesla Dojo](https://www.tesmanian.com/blogs/tesmanian-blog/tesla-supercomputer-dojo-v1-0-will-be-ready-in-about-1-year-says-elon-musk#:~:text=The%20Dojo%20is%20a%20Neural,during%20Autonomy%20Day%20in%202019.)) specifically made for autonomous driving advancement. No other company can come close to what Tesla is currently doing.\n\n5. **Misdirected Competition**: Remember how we talked about ZEV credits? Well most ICE vehicle manufacturers only sell their vehicles in ZEV mandated states and nowhere else. They literally lose money when they sell their vehicles, or have to massively hike up their prices to make a profit even with tax credits, unlike Teslas. For this reason, they only make enough vehicles to make up for their ZEV credits. Naturally, one can assume the limits of effort gone into such vehicles. Now, let's talk about the EV start ups. I've already mentioned the massive growing pains they will have to reach mass production. However, the Chinese EV startups have one thing to their advantage - massive 5G infrastructure within China which will undoubtedly benefit automation, especially in the case of HD maps. However, this doesn't apply outside of China. To add to this, they do not produce in-house custom AI chipsets which is a [massive hinderance](https://equalocean.com/analysis/2020072714353) in processing data. Tesla did this with Nvidia for a while and ultimately decided that they had to design their own chips because of the lackluster performance.\n\n6. **OTA Software Updates** - A minor point, but Tesla has been designing their own software for years now. Well known to the public, Teslas update very frequently and with each update gets slightly better UI and performance. Yes - a software update allows Teslas to get better efficiency out of their vehicles. One can argue that any auto manufacturer can implement OTA software updates, but Tesla is leagues ahead at the moment with top notch software developers.\n\n7. **Talent Pool**: Guess what the [#1 company engineers want to work for](https://electrek.co/2020/11/11/tesla-most-attractive-company-engineering-students-massive-advantage/) is? That's right. Tesla. #2 is SpaceX. Try all they want, but the best engineers aren't going to want to work with Ford or GM.\n\n8. **\"The Competition\"**: I already mentioned the half-assedness of traditional ICE vehicle manufacturers but I wanted to bring up another point. One thing that traditional ICE manufacturers have weighing them down are their employees. Their ICE engineers don't translate well into a totally different EV drivetrain. There are sunk costs (equipment etc) that deal with ICE manufacturing processes. Also, Ford, GM, and VW all have unions, pension funds, and stockholders. What do you think their reaction will be when they decide to ditch the currently-profitable-but-soon-to-be-shrinking ICE vehicle component and transition into resource intensive EVs? That's right. They won't like it. The only solution is to half-ass it and slowly transition into EVs while trying to keep afloat their ICE vehicle component. With massive product line diversification and lack of focus, this is not going to be an easy transition. VW CEO Herbert Diess famously stated that \"*My goal for the future is clear: leading the Group into a sustainable and successful future. The global transformation in the industry will take roughly ten years, with or without Volkswagen*.\" and tried to convince board members basically stating that [**VW will need to transition into EVs within 10 years or go bankrupt**](https://www.linkedin.com/pulse/how-we-transform-volkswagen-herbert-diess). Ultimately, Diess wasn't successful in achieving full cooperation of the board and had to compromise in his goals to a more gradual transition. The competition is NOT coming. Oh, and as for Waymo and Uber? Well Uber recently sold off their self-driving startup, and Waymo famously sunk in at least $3.5 billion in the first few years of operation. I mean, they are paying drivers to monitor their expensive \"autonomous vehicles\" while Tesla gets this done while making a profit. As of 2020, Waymo still [only has 600 vehicles](https://www.ft.com/content/6b1b11ea-b50b-4dd5-802d-475c9731e89a) and has never left the bounds of Pheonix, AZ. \n\n&nbsp;\n\nOK. So I'm sure I've missed some points but I think this paints a decent picture on why Tesla is considered the one and only market leader at the moment. Now let's go into...\n\n&nbsp;\n\n---\n\n&nbsp;\n\n## **Tesla's Disruptive Potentials**:\n\n&nbsp;\n\n1. **The $25,000 EV**: In Tesla's battery day announcement, Tesla projected that their battery technology will enable them to build a $25k vehicle in the future. According to [projections using Wright's law](https://ark-invest.com/articles/analyst-research/wrights-law-predicts-teslas-gross-margin/), this seems to be plausible. Most think this will happen around 2023-4. Think of the disruption this will bring. EVs are famous for having lower maintenance cost vs. ICE vehicles due to not having as many moving parts. The true cost of ownership for a $25k vehicle will be vastly superior to a $20k ICE vehicle. Once this happens, **ICE vehicle demand will fall through the roof**. The only ICE vehicles being sold at high volume will be used vehicles. What happens to the traditional ICE manufacturers then?\n\n2. **Tesla Auto Insurance**: Tesla collects massive amounts of data. They easily profile their customers driving patterns, if they have self driving enabled, the route they drive etc. Currently Tesla vehicles are insured at a much higher premium vs. economic ICE vehicles. Once Tesla goes fully into the insurance business, traditional insurance companies will not be able to compete with them on price or margins.\n\n3. **Solar City** - Tesla's other business deals with solar panels, Tesla power walls, and their Autobidder software which sells the electricity that you generated back to the grid. Tesla is currently offers the lowest solar panel price in the U.S. and moreover, takes 20% profit on their autobidder software. Renewable energy is poised to grow. More than 50% annually is the current projection.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n## **Risks**: \n\n1. **Failing autonomous driving**: definitely a major risk as the current stock price is largely betting on this single technology to materialize. However, their current progress and the rate of improvement after rewriting their autopilot code seems promising.\n\n2. **Failing mass battery production (battery supply issues)**: Although Tesla is the largest producer of batteries in the world, they will need to produce more if they want to keep up with the current pace of expansion. This will be a major bottleneck for Tesla if they cannot solve this issue. As a solution, Tesla has reduced their reliance on copper and are said to be producing batteries with little to no copper. We shall see how this pans out.\n\n3. **Tesla has infamously poor Quality Control** on their vehicles and slow/poor customer Service. We shall see if time solves this issue\n\n4. **Lack of Tax Incentives**: Tesla's vehicles no longer provide Federal tax incentives to U.S. customers. However, they seem to be doing fine with over 80% marketshare in the U.S. alone.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n## **Alternative Tech**: \n\n&nbsp;\n\n1. **Solid State Battery** - Quantumscape which is currently the leader in this sector has plans to enter mass production by 2024. We shall see if their battery technology turns out to be as efficient as Tesla's.\n\n2. **Hydrogen Fuel Cell (HFC) Battery** - Likely not a good use for vehicles. [Very low efficiency and wasteful](https://insideevs.com/news/406676/battery-electric-hydrogen-fuel-cell-efficiency-comparison/#:~:text=Depending%20on%20the%20model%2C%20the,is%20from%2025%2D35%25.) vs lithium-ion batteries. Currently no infrastructure for HFC in place. Might be useful for freight shipping. Elon Musk famously stated that HFC's are \"Fool Cells\"\n\n&nbsp;\n\n---\n\n&nbsp;\n\n## **Tesla Future Products Lines**: \n\n1. **Cybertruck**: Insane profit margins, amazing performance. estimated production end of 2021 or 2022\n\n2. **Semi Truck**: estimated production 2022 or later\n\n3. **2020 Roadster**: Insane specs but surprise! The \"2020 Roadster\" renewal never happened and most are projecting 2022 or later\n\n4. **Model S Refresh**: Insane specs. Likely release is 2021\n\n5. **$25k EV**: 'nuff said\n\n&nbsp;\n\n---\n\n&nbsp;\n\nTSLA Institutional Ownership: 62.85%\n\nTSLA Insider Ownership: 5.21%\n\nTSLA Fanboy Ownership: estimated 5%+\n\nSo there is a stable 70%+ of ownership that will not sell this stock, unlike PLTR which has only 12% institutional ownership and 63% insider ownership.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n**Why did TSLA shoot up so quickly in 2020**: This is my personal opinion, but TSLA fans are known for doing deep research into the company. In the early days this was in forums such as the [Tesla Motors Club](https://teslamotorsclub.com/) where they shared their own research on revenue, projections, and potentials. Now we have YouTube and information dissemination has gotten easier. Interest in investing has skyrocketed in 2020. Stock market trading GLOBALLY has gotten easier via smartphone with apps such as Robinhood and the prosperity of the American stock market has no doubt attracted global retail investors. For years, Tesla's stock has been pushed down by FUD analysts. Paid by big oil and traditional ICE manufacturers? Or really that dumb not to do any DD and spread completely false information on a company that you are massively shorting. We might never find out. Retailers have caught onto Tesla's potential ahead of analysts this time. And as in Morgan Stanley and RBC's case, analysts have just been catching up on the future potential of Tesla to not make a further fool of themselves.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n**Future scenarios and Personal Opinion**: Currently, Tesla holds over 18% of the global EV marketshare. As more EV players come into space, it might seem like Tesla is in danger of losing marketshare. Not everyone wants a Tesla and that is understandable. But as the overall pie is growing, Tesla, with their 50% YoY production increase plans (which is exponential growth), will likely remain a market leader sustaining their current 18% market share even in 2030 just like how the iPhone did. \n\n&nbsp;\n\nEven if TSLA fails to develop their robo-taxi network technology, their full self driving subscription seems highly likely to materialize at the current pace albeit a lower revenue model. \n\n&nbsp;\n\nUltimately, do I think the current stock price is a bubble? Fuck yes I do, maybe by up to 20%. I'm not buying any more TSLA shares anywhere near this price. My FOMO was back when the stock price was $415 after doing my DD and this was with the intention to buy more even shares if the stock bottomed out. Well, it never bottomed because the S&P inclusion was announced shortly after I purchased it. \n\n&nbsp;\n\nBut if you ask my personal opinion, you gotta be a pulling a \"buy high sell low\" if you're looking for short term gains. I'm looking at long term, slow moving, boring, Bitcoin HODLing, Warren Buffet style \"time in market beats timing the market\" boomer gains here. My next purchase will be whenever the stock price, if ever, bottoms out. However, just because I think TSLA is overpriced doesn't mean that I'm shorting this stock either. \n\n&nbsp;\n\nAmazon famously was non-profitable or barely profitable until 2015 because they were reinvesting their profits into expansion. That is what Tesla is doing right now. Remember all the analysts who continuously warned investors for over a decade to stay away from AMZN because they are unprofitable? Well, I don't see any sane analysts parroting that narrative anymore. And then its stock price shot to the moon after they enabled profit mode. It's stock price nearly doubled due to the pandemic and I'm still not planning on shorting this stock even though the pandemic will likely go away in less than a year. \n\n&nbsp;\n\nI don't know how TSLA will do in the short term. Nonetheless, I do believe that Tesla has the best chance among any auto maker out there to reach a $2-10+ trillion valuation within 10 years. So I'm just going to lean back and enjoy the show.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n**TL;DR**: Tesla HAS NO COMPETITION. This is as if android wasn't developed until 4 years after the iPhone was released. Do NOT short or buy puts on TSLA. Although the current run seems absolutely insane, there is some substance to hold it up and possibly keep shooting up higher\n\n&nbsp;\n\n---\n\n&nbsp;\n\n**Positions**: TSLA shares @ $415 and a bunch more with an average price of $518. No calls because my wife's boyfriend did not permit.\n\n&nbsp;\n\n---\n\n&nbsp;\n\n**See also**: [ARK Invest's TSLA 2024 Price Target of $7,000 ($1500 post split)](https://ark-invest.com/articles/analyst-research/tesla-price-target/) written back in Jan 2020. Ark Invest has famously stated that their [2022 price target was $700-$4,000 ($140-$800 post split) back in 2018](https://ark-invest.com/articles/market-commentary/tesla-private/) when Elon Musk sent out his now infamous \"funding secured\" tweet. Tesla's stock was around $60 ($300 pre split) at the time.", "author_fullname": "t2_10ia7y", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "DD on Tesla ($TSLA). Bubble or Nah?", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_ksvrgz", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.88, "author_flair_background_color": null, "subreddit_type": "public", "ups": 60, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 60, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1610083186.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1610111435.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Alright. Hear me out autists. We all know bears are gay. But with TSLA shares reaching an ATH of $816.99, it sure seems like its fundamentals are completely divorced from reality. And the media analysts has been pounding on TSLA for seemingly years now. So is this a good company to be a gay bear on? Or Nah?</p>\n\n<p>&nbsp;</p>\n\n<p>On 7 Jan 2020, Royal Bank of Canada admitted that &quot;There is no graceful way to put this other than to say we got TSLA&#39;s stock completely wrong&quot; and upgraded TSLA from $339 to $700. And on 6 Jan 2020, Morgan Stanley upgraded their TSLA price target to $810 when just 18 months ago they announced their comically low price target of $10 (that&#39;s $2 post split) resulting in a massive rally. Did  Morgan Stanley dive head first into WSB level 3 autism territory, or is there something that the uninitiated could be missing? Let&#39;s do a deep dive into Tesla the company and see if their stock really is in a bubble, or if there could be some substance behind the current insane rally.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>The common FUD narrative among TSLAQ is that TSLA&#39;s $700+ billion market cap is now larger than the 10 largest auto manufacturers combined. Indeed, this is quite insane. Even without us autists doing complex calculations, a simple google search shows that they would have to sell around 70 million vehicles a year to be priced at that level. So how many vehicles did Tesla produce? Tesla announced on 2 January 2020 that they&#39;ve sold a little shy of 500K vehicles for CY 2020 with plans to increase production by 50% YoY. This would ultimately bring them to 20 million vehicles produced by 2030. </p>\n\n<p>&nbsp;</p>\n\n<p>20 mil by 2030. Although we all know the term &quot;Elon Time&quot;, which refers to CEO Elon Musk casually announcing an estimate of a product and missing projected timelines by large margins, there seems to be some credibility to this statement. Back in 2014, Elon Musk <a href=\"https://youtu.be/arauCxOuDxU?t=148\">gave an interview (2:28)</a> where he stated that he &quot;feels comfortable being able to achieve at least half a million cars a year by 2020&quot;. </p>\n\n<p>&nbsp;</p>\n\n<p>OK. So let&#39;s give him the benefit of the doubt. As a matter of fact, Tesla is actually building factories at breakneck speeds with construction literally running 24/7 and each of their large factories (Austin and Berlin) is said to be capable of producing up to 2 million vehicles a year. Giga Berlin which was an empty field 9 months ago is already <a href=\"https://cdn.shopify.com/s/files/1/0173/8204/7844/articles/2_c51cdcab-d351-40f5-860f-1aa95dd1d3d7_1800x.jpg?v=1609802044\">close to finishing its outer construction layer</a>. Obviously they plan to announce more factory constructions in the future as well. So they do seem to be on track to grow on average 50% YoY for now. But 20 million cars produced by 2030 is still massively shy of 70 million vehicles. Even with growth factored in, TSLA&#39;s stock valuation still seems insanely high. So what gives? The common explanation among the Tesla fanboys is that TSLA is a tech company, not an automotive company, so it should be valued just so. </p>\n\n<p>&nbsp;</p>\n\n<p>So what is this mystical technology the fanboys speak of, and how is it being deployed in terms of profitability for Tesla? Well, it turns out that Tesla has three main technological advantages and two main revenue streams that might put them leaps and bounds ahead of competitors.</p>\n\n<p>&nbsp;</p>\n\n<ol>\n<li><p><strong>Autonomous Driving</strong> - Tesla is the current market leader in vehicle autonomy. It has over <a href=\"https://lexfridman.com/tesla-autopilot-miles-and-vehicles/\">3 billion miles logged</a> as of April 2020. The next industry leader Waymo (owned by google) has approximately 20 million miles logged. One thing for sure is that no company will be able to catch Tesla in terms of pure data advantage within the next 4-5 years. And when it comes to Artificial Intelligence, data is king. This could be the bread and butter of Tesla. Tesla already charges customers $10k per vehicle to enable full self driving in which 25% of their customers choose the option. However, Tesla hasn&#39;t taken full profits on their books yet due to it still being in beta mode. Once they solve autonomy, an over-the-air (OTA) software update will be sent out just like how your iPhone updates and bam! now you have self driving vehicle. Let&#39;s say Tesla charges $2k a year for a self driving vehicle that can also function as an autonomous uber driver which will help you pay down your vehicle or self driving subscription service. That&#39;s like selling two iPhone pros per every customer every year. And customers on their robotaxi network will also have to share 20% profits with Tesla.</p></li>\n<li><p><strong>Vehicle Manufacturing</strong> - Tesla is an innovator when it comes to vehicle manufacturing technology, specifically robotics. Along with their insane factory automation process, they also have giga casters that mold car pieces quickly and efficiently that no other manufacturers have, and giant automated paint shops. This cuts down massively on labor and allows for quicker production while keeping margins high. Due to innovative technologies like these, it is estimated that Tesla&#39;s Shanghai Model 3 vehicles <a href=\"https://www.cnbc.com/2019/11/13/teslas-shanghai-gigafactory-will-boost-margins-morgan-stanley.html\">net around 30% profit margins</a>, even after they&#39;ve recently slashed their prices by 8%. Tesla recently slashed their <a href=\"https://insideevs.com/news/463797/china-tesla-announced-new-prices-model-y-sales/\">Model Y price by 30%</a> but still boast an <a href=\"https://www.teslarati.com/tesla-china-model-y-gross-margin-30-percent-report/\">astonishing 29% profit margin</a> which is approximately 3 times the industry average. So even if robotaxi doesn&#39;t work out, they are still an industry leader by a large stretch in terms of profit margins. These margins will only increase after Giga Berlin is operational due to no longer having to ship vehicles across the Pacific to European customers.</p></li>\n<li><p><strong>Vertical Integration</strong> - Tesla is famous for its vertical integration. This is mainly due to having supply chain issues in the early days, but what this has enabled is agile production capability and larger profit margins. Due to this capability, Tesla improves components of their vehicles on the fly instead of the annual model release the traditional industry uses. Also, they don&#39;t have to share profits with suppliers or worry about constraints, delivery delays, or slow progress on contracts. </p></li>\n<li><p><strong>No Advertising &amp; Dealerships</strong> - Elon Musk is a walking billboard. The media literally gives Tesla free advertisement every day. As production increases, Tesla might have to start advertising in the future. But for now it seems like Teslas are selling themselves. Tesla has literally sold 100% of the vehicles they&#39;ve ever produced, and they have never advertised any of their vehicles. Also, they do not have to share profits with dealerships with direct-to-consumer sales. If their market dominance and technology superiority continues, it is bound to stay the industry leader just like apple did with its iPhones. And if they solve autonomy first which they seem on track to do so, what&#39;s more to say?</p></li>\n<li><p><strong>Regulatory Credits AKA Carbon Credits</strong> - This is one that TSLAQs love to bring up when it comes to Tesla profits. You see, a handful of US States enacted a law that requires manufacturers to sell a certain percentage of <a href=\"https://www.currentautomotive.com/what-is-a-zev-credit-and-how-does-tesla-make-money-with-them/\">Zero Emission Vehicles (ZEV) in their state</a> which will earn them ZEV credits. If not, they will either have to pay a massive penalty fine, or buy ZEV credits from vehicle manufacturers who have plenty to spare. And Tesla has an overflow of ZEV credits laying around. So Tesla is literally getting paid by other vehicle manufacturers to build their vehicles. TSLAQs (incorrectly) state that the only reason Tesla makes a profit is because of regulatory credits. However, Tesla&#39;s <a href=\"https://tesla-cdn.thron.com/static/4E7BR9_TSLA_Q3_2020_Update_P0Q85U.pdf?xseo=&amp;response-content-disposition=inline%3Bfilename%3D%22TSLA-Q3-2020-Update.pdf%22\"><strong>ZEV credits only make up around 5% of their revenue</strong></a> and it is slowly falling. No serious vehicle manufacturer will likely produce ICE vehicles in the year 2030 so ZEV credits fazing out is to be expected. Tesla vehicles are massively profitable as mentioned in bullet #2 even without the ZEV credits.</p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<p>So we went over the main revenue streams of Tesla. And if all works out well, it seems likely that Tesla has a good chance of &#39;winning&#39; if they maintain their market leadership. However, the competition is coming, right? We have our favorite EV players such as Nio, XPeng, Li, Rivian, BYD etc. Also the traditional ICE manufacturers VolksWagen has their ID.4, Ford has thier Mustang Mach-E, Audi has thier etron, Porche has their Tycan, and GM has the Chevy Bolt and 30 EVs planned for the future. It seems inevitable that these industry giants with their massive resources will overtake Tesla. Or will they?</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h2><strong>Why the Competition is NOT Coming (Tesla&#39;s Moats)</strong>:</h2>\n\n<p>&nbsp;</p>\n\n<ol>\n<li><p><strong>Difficulties of creating an EV vs. Mass Production</strong>: Creating a shell of an EV or a prototype is extremely easy. If anything, Nikola has showed this to be true. Rivian seems to be having the same issue Tesla had when starting up where they had to constantly push back release dates due to how difficult it is to engineer and manufacture an EV. So designing a prototype is easy. Manufacturing an EV is another thing. But mass production is a whole different beast. It took Tesla well over 16 years to perfect their technology and mass produce their model 3 despite having the best engineers in the world working for them. Ever wonder why every single vehicle manufacturer has constantly been pushed back their EV production timelines? It&#39;s because EVs are difficult. Also to note is that no vehicle manufacturer other than Tesla has been able to achieve mass production in EVs. And until then, Tesla has no competition in the near horizon.</p></li>\n<li><p><a href=\"https://pbs.twimg.com/media/ErACHc5XUAA7RD-?format=jpg&amp;name=medium\"><strong>Supercharger network</strong></a>: Tesla has the largest charging network in the world by orders of magnitude and they will continue to grow. VW is a low trailing second in the market due to penalties in their dieselgate scandel and as a lucky maneuver, <a href=\"https://www.cnbc.com/2019/05/10/vws-2-billion-penalty-for-diesel-scam-builds-ev-charging-network-across-us.html\">decided to build their electrify-america charging network</a>. BTW, due to sunk costs, VW will likely be the only traditional ICE manufacturer that stands a chance in surviving in the long run. Tesla owners barely get range anxiety like they used to back in the day. This is because it is easy to find a charging station even if they are going on a long trip with their map integration. However, you cannot say the same for the other EVs.</p></li>\n<li><p><strong>Lidar vs. Camera</strong>: Tesla&#39;s vehicles famously does not use lidar technology. Instead, they almost only rely on vision (cameras). There are three main reasons for this. (I.) Cameras are extremely cheap. Lidar is not. One of Waymo&#39;s vehicles are estimated to have cost over $250k back in a 2017 estimate. Although in recent years Waymo seems to have developed lidar hardware that costs 90% less at $7.5k, it is still ridiculously expensive compared to cameras without adding much value. Here is Elon Musk&#39;s explanation, massively paraphrased: &quot;Cameras augmented with AI can do almost all the things that lidar does chiefly depth sensing. Human vision does not require a separate depth sensor, and the entire driving infrastructure is built with human vision in mind. Lidar is a fools errand.&quot; Instead, Tesla augments its self driving technology with radar and maps. (II.) Lidar technology is usually augmented with something called HD maps. This is extreme detailed mapping (to the centimeter level) that helps lidar depth sensors with navigation. However, the issue with HD maps is that the file sizes are obviously large. And when detailed maps need to be updated due to construction or whatever which happens everywhere, every day, an OTA update needs to be sent out. And how do you update a fleet of all your vehicles when nationwide full coverage of 5G isn&#39;t a thing? So vehicles like Waymos are extremely good at driving within their geo-fenced locations, until they leave the area. And then they are absolute crap at it. OTOH, vision-based self driving vehicles are initially bad at the task until they have sufficient data and then they can drive well in almost every situation even without it being connected to the network. (III.) Vision-focused self driving AI can be augmented with additional sensors such as radar/lidar afterwards, but the inverse does not work. To put it short, if your lidar sensors disagree on the information they see at the moment, its entire system cannot function.</p></li>\n<li><p><strong>Technological Dominance</strong>: Tesla&#39;s vertical integration and engineering produced innovative solutions such as the <a href=\"https://www.tesmanian.com/blogs/tesmanian-blog/deep-looks-into-tesla-model-y-s-octovalve\">octovalve</a>, <a href=\"https://www.currentautomotive.com/model-y-is-the-first-tesla-with-a-heat-pump-heres-why-thats-a-big-deal/\">heat pump</a>, <a href=\"https://www.youtube.com/watch?v=HK79ioBW8Mg\">leadership in battery and vehicle efficiency</a>, <a href=\"https://youtu.be/Ucp0TTmvqOE\">custom designed AI chips</a> and a AI supercomputer server (<a href=\"https://www.tesmanian.com/blogs/tesmanian-blog/tesla-supercomputer-dojo-v1-0-will-be-ready-in-about-1-year-says-elon-musk#:%7E:text=The%20Dojo%20is%20a%20Neural,during%20Autonomy%20Day%20in%202019.\">Tesla Dojo</a>) specifically made for autonomous driving advancement. No other company can come close to what Tesla is currently doing.</p></li>\n<li><p><strong>Misdirected Competition</strong>: Remember how we talked about ZEV credits? Well most ICE vehicle manufacturers only sell their vehicles in ZEV mandated states and nowhere else. They literally lose money when they sell their vehicles, or have to massively hike up their prices to make a profit even with tax credits, unlike Teslas. For this reason, they only make enough vehicles to make up for their ZEV credits. Naturally, one can assume the limits of effort gone into such vehicles. Now, let&#39;s talk about the EV start ups. I&#39;ve already mentioned the massive growing pains they will have to reach mass production. However, the Chinese EV startups have one thing to their advantage - massive 5G infrastructure within China which will undoubtedly benefit automation, especially in the case of HD maps. However, this doesn&#39;t apply outside of China. To add to this, they do not produce in-house custom AI chipsets which is a <a href=\"https://equalocean.com/analysis/2020072714353\">massive hinderance</a> in processing data. Tesla did this with Nvidia for a while and ultimately decided that they had to design their own chips because of the lackluster performance.</p></li>\n<li><p><strong>OTA Software Updates</strong> - A minor point, but Tesla has been designing their own software for years now. Well known to the public, Teslas update very frequently and with each update gets slightly better UI and performance. Yes - a software update allows Teslas to get better efficiency out of their vehicles. One can argue that any auto manufacturer can implement OTA software updates, but Tesla is leagues ahead at the moment with top notch software developers.</p></li>\n<li><p><strong>Talent Pool</strong>: Guess what the <a href=\"https://electrek.co/2020/11/11/tesla-most-attractive-company-engineering-students-massive-advantage/\">#1 company engineers want to work for</a> is? That&#39;s right. Tesla. #2 is SpaceX. Try all they want, but the best engineers aren&#39;t going to want to work with Ford or GM.</p></li>\n<li><p><strong>&quot;The Competition&quot;</strong>: I already mentioned the half-assedness of traditional ICE vehicle manufacturers but I wanted to bring up another point. One thing that traditional ICE manufacturers have weighing them down are their employees. Their ICE engineers don&#39;t translate well into a totally different EV drivetrain. There are sunk costs (equipment etc) that deal with ICE manufacturing processes. Also, Ford, GM, and VW all have unions, pension funds, and stockholders. What do you think their reaction will be when they decide to ditch the currently-profitable-but-soon-to-be-shrinking ICE vehicle component and transition into resource intensive EVs? That&#39;s right. They won&#39;t like it. The only solution is to half-ass it and slowly transition into EVs while trying to keep afloat their ICE vehicle component. With massive product line diversification and lack of focus, this is not going to be an easy transition. VW CEO Herbert Diess famously stated that &quot;<em>My goal for the future is clear: leading the Group into a sustainable and successful future. The global transformation in the industry will take roughly ten years, with or without Volkswagen</em>.&quot; and tried to convince board members basically stating that <a href=\"https://www.linkedin.com/pulse/how-we-transform-volkswagen-herbert-diess\"><strong>VW will need to transition into EVs within 10 years or go bankrupt</strong></a>. Ultimately, Diess wasn&#39;t successful in achieving full cooperation of the board and had to compromise in his goals to a more gradual transition. The competition is NOT coming. Oh, and as for Waymo and Uber? Well Uber recently sold off their self-driving startup, and Waymo famously sunk in at least $3.5 billion in the first few years of operation. I mean, they are paying drivers to monitor their expensive &quot;autonomous vehicles&quot; while Tesla gets this done while making a profit. As of 2020, Waymo still <a href=\"https://www.ft.com/content/6b1b11ea-b50b-4dd5-802d-475c9731e89a\">only has 600 vehicles</a> and has never left the bounds of Pheonix, AZ. </p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<p>OK. So I&#39;m sure I&#39;ve missed some points but I think this paints a decent picture on why Tesla is considered the one and only market leader at the moment. Now let&#39;s go into...</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h2><strong>Tesla&#39;s Disruptive Potentials</strong>:</h2>\n\n<p>&nbsp;</p>\n\n<ol>\n<li><p><strong>The $25,000 EV</strong>: In Tesla&#39;s battery day announcement, Tesla projected that their battery technology will enable them to build a $25k vehicle in the future. According to <a href=\"https://ark-invest.com/articles/analyst-research/wrights-law-predicts-teslas-gross-margin/\">projections using Wright&#39;s law</a>, this seems to be plausible. Most think this will happen around 2023-4. Think of the disruption this will bring. EVs are famous for having lower maintenance cost vs. ICE vehicles due to not having as many moving parts. The true cost of ownership for a $25k vehicle will be vastly superior to a $20k ICE vehicle. Once this happens, <strong>ICE vehicle demand will fall through the roof</strong>. The only ICE vehicles being sold at high volume will be used vehicles. What happens to the traditional ICE manufacturers then?</p></li>\n<li><p><strong>Tesla Auto Insurance</strong>: Tesla collects massive amounts of data. They easily profile their customers driving patterns, if they have self driving enabled, the route they drive etc. Currently Tesla vehicles are insured at a much higher premium vs. economic ICE vehicles. Once Tesla goes fully into the insurance business, traditional insurance companies will not be able to compete with them on price or margins.</p></li>\n<li><p><strong>Solar City</strong> - Tesla&#39;s other business deals with solar panels, Tesla power walls, and their Autobidder software which sells the electricity that you generated back to the grid. Tesla is currently offers the lowest solar panel price in the U.S. and moreover, takes 20% profit on their autobidder software. Renewable energy is poised to grow. More than 50% annually is the current projection.</p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h2><strong>Risks</strong>:</h2>\n\n<ol>\n<li><p><strong>Failing autonomous driving</strong>: definitely a major risk as the current stock price is largely betting on this single technology to materialize. However, their current progress and the rate of improvement after rewriting their autopilot code seems promising.</p></li>\n<li><p><strong>Failing mass battery production (battery supply issues)</strong>: Although Tesla is the largest producer of batteries in the world, they will need to produce more if they want to keep up with the current pace of expansion. This will be a major bottleneck for Tesla if they cannot solve this issue. As a solution, Tesla has reduced their reliance on copper and are said to be producing batteries with little to no copper. We shall see how this pans out.</p></li>\n<li><p><strong>Tesla has infamously poor Quality Control</strong> on their vehicles and slow/poor customer Service. We shall see if time solves this issue</p></li>\n<li><p><strong>Lack of Tax Incentives</strong>: Tesla&#39;s vehicles no longer provide Federal tax incentives to U.S. customers. However, they seem to be doing fine with over 80% marketshare in the U.S. alone.</p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h2><strong>Alternative Tech</strong>:</h2>\n\n<p>&nbsp;</p>\n\n<ol>\n<li><p><strong>Solid State Battery</strong> - Quantumscape which is currently the leader in this sector has plans to enter mass production by 2024. We shall see if their battery technology turns out to be as efficient as Tesla&#39;s.</p></li>\n<li><p><strong>Hydrogen Fuel Cell (HFC) Battery</strong> - Likely not a good use for vehicles. <a href=\"https://insideevs.com/news/406676/battery-electric-hydrogen-fuel-cell-efficiency-comparison/#:%7E:text=Depending%20on%20the%20model%2C%20the,is%20from%2025%2D35%25.\">Very low efficiency and wasteful</a> vs lithium-ion batteries. Currently no infrastructure for HFC in place. Might be useful for freight shipping. Elon Musk famously stated that HFC&#39;s are &quot;Fool Cells&quot;</p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<h2><strong>Tesla Future Products Lines</strong>:</h2>\n\n<ol>\n<li><p><strong>Cybertruck</strong>: Insane profit margins, amazing performance. estimated production end of 2021 or 2022</p></li>\n<li><p><strong>Semi Truck</strong>: estimated production 2022 or later</p></li>\n<li><p><strong>2020 Roadster</strong>: Insane specs but surprise! The &quot;2020 Roadster&quot; renewal never happened and most are projecting 2022 or later</p></li>\n<li><p><strong>Model S Refresh</strong>: Insane specs. Likely release is 2021</p></li>\n<li><p><strong>$25k EV</strong>: &#39;nuff said</p></li>\n</ol>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p>TSLA Institutional Ownership: 62.85%</p>\n\n<p>TSLA Insider Ownership: 5.21%</p>\n\n<p>TSLA Fanboy Ownership: estimated 5%+</p>\n\n<p>So there is a stable 70%+ of ownership that will not sell this stock, unlike PLTR which has only 12% institutional ownership and 63% insider ownership.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p><strong>Why did TSLA shoot up so quickly in 2020</strong>: This is my personal opinion, but TSLA fans are known for doing deep research into the company. In the early days this was in forums such as the <a href=\"https://teslamotorsclub.com/\">Tesla Motors Club</a> where they shared their own research on revenue, projections, and potentials. Now we have YouTube and information dissemination has gotten easier. Interest in investing has skyrocketed in 2020. Stock market trading GLOBALLY has gotten easier via smartphone with apps such as Robinhood and the prosperity of the American stock market has no doubt attracted global retail investors. For years, Tesla&#39;s stock has been pushed down by FUD analysts. Paid by big oil and traditional ICE manufacturers? Or really that dumb not to do any DD and spread completely false information on a company that you are massively shorting. We might never find out. Retailers have caught onto Tesla&#39;s potential ahead of analysts this time. And as in Morgan Stanley and RBC&#39;s case, analysts have just been catching up on the future potential of Tesla to not make a further fool of themselves.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p><strong>Future scenarios and Personal Opinion</strong>: Currently, Tesla holds over 18% of the global EV marketshare. As more EV players come into space, it might seem like Tesla is in danger of losing marketshare. Not everyone wants a Tesla and that is understandable. But as the overall pie is growing, Tesla, with their 50% YoY production increase plans (which is exponential growth), will likely remain a market leader sustaining their current 18% market share even in 2030 just like how the iPhone did. </p>\n\n<p>&nbsp;</p>\n\n<p>Even if TSLA fails to develop their robo-taxi network technology, their full self driving subscription seems highly likely to materialize at the current pace albeit a lower revenue model. </p>\n\n<p>&nbsp;</p>\n\n<p>Ultimately, do I think the current stock price is a bubble? Fuck yes I do, maybe by up to 20%. I&#39;m not buying any more TSLA shares anywhere near this price. My FOMO was back when the stock price was $415 after doing my DD and this was with the intention to buy more even shares if the stock bottomed out. Well, it never bottomed because the S&amp;P inclusion was announced shortly after I purchased it. </p>\n\n<p>&nbsp;</p>\n\n<p>But if you ask my personal opinion, you gotta be a pulling a &quot;buy high sell low&quot; if you&#39;re looking for short term gains. I&#39;m looking at long term, slow moving, boring, Bitcoin HODLing, Warren Buffet style &quot;time in market beats timing the market&quot; boomer gains here. My next purchase will be whenever the stock price, if ever, bottoms out. However, just because I think TSLA is overpriced doesn&#39;t mean that I&#39;m shorting this stock either. </p>\n\n<p>&nbsp;</p>\n\n<p>Amazon famously was non-profitable or barely profitable until 2015 because they were reinvesting their profits into expansion. That is what Tesla is doing right now. Remember all the analysts who continuously warned investors for over a decade to stay away from AMZN because they are unprofitable? Well, I don&#39;t see any sane analysts parroting that narrative anymore. And then its stock price shot to the moon after they enabled profit mode. It&#39;s stock price nearly doubled due to the pandemic and I&#39;m still not planning on shorting this stock even though the pandemic will likely go away in less than a year. </p>\n\n<p>&nbsp;</p>\n\n<p>I don&#39;t know how TSLA will do in the short term. Nonetheless, I do believe that Tesla has the best chance among any auto maker out there to reach a $2-10+ trillion valuation within 10 years. So I&#39;m just going to lean back and enjoy the show.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p><strong>TL;DR</strong>: Tesla HAS NO COMPETITION. This is as if android wasn&#39;t developed until 4 years after the iPhone was released. Do NOT short or buy puts on TSLA. Although the current run seems absolutely insane, there is some substance to hold it up and possibly keep shooting up higher</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p><strong>Positions</strong>: TSLA shares @ $415 and a bunch more with an average price of $518. No calls because my wife&#39;s boyfriend did not permit.</p>\n\n<p>&nbsp;</p>\n\n<hr/>\n\n<p>&nbsp;</p>\n\n<p><strong>See also</strong>: <a href=\"https://ark-invest.com/articles/analyst-research/tesla-price-target/\">ARK Invest&#39;s TSLA 2024 Price Target of $7,000 ($1500 post split)</a> written back in Jan 2020. Ark Invest has famously stated that their <a href=\"https://ark-invest.com/articles/market-commentary/tesla-private/\">2022 price target was $700-$4,000 ($140-$800 post split) back in 2018</a> when Elon Musk sent out his now infamous &quot;funding secured&quot; tweet. Tesla&#39;s stock was around $60 ($300 pre split) at the time.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?auto=webp&s=3492682f7fc3cb509cb8971fc9ac0858589e2246", "width": 1200, "height": 612}, "resolutions": [{"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=108&crop=smart&auto=webp&s=0eb6e05c37d9a21f10793109abb17b6963454371", "width": 108, "height": 55}, {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=216&crop=smart&auto=webp&s=08bf8d2193a4a2b4554f29c794551f6575cf0d50", "width": 216, "height": 110}, {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=320&crop=smart&auto=webp&s=3fbe3e3e52472ffd8cb9f35d65c8cf0229a257ef", "width": 320, "height": 163}, {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=640&crop=smart&auto=webp&s=e12c2e27bf5ebfc4164714cbd857d6a39835fe55", "width": 640, "height": 326}, {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=960&crop=smart&auto=webp&s=150db82fd5acf37e4f14196fb3c90c8b0839c53c", "width": 960, "height": 489}, {"url": "https://external-preview.redd.it/bhyvLwxlqxkWNh_mSGd_NOfIaXf9wGZ5MRLjxteANhg.jpg?width=1080&crop=smart&auto=webp&s=feafa1bccf6cb12875e41c3aa6ddf40d157251a1", "width": 1080, "height": 550}], "variants": {}, "id": "_RWKXjPnze3524LKNLuF4wfx_7D66MtLbk2_ovd-FKk"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "ksvrgz", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "jpjhun", "fullname": "t2_10ia7y"}, "discussion_type": null, "num_comments": 35, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/", "subreddit_subscribers": 1785841, "created_utc": 1610082635.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 28, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_ksvrgz", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "giiqk8k", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "InterestingAd1738", "fullname": "t2_84ioq72t"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_ksvrgz", "score": 28, "author_fullname": "t2_84ioq72t", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "So.. all in on $TSLA?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>So.. all in on $TSLA?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/giiqk8k/", "num_reports": null, "locked": false, "name": "t1_giiqk8k", "created": 1610119770.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610090970.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_ksvrgz", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "giis9o8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "wouter735", "fullname": "t2_2l5naau0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_giiqk8k", "score": 6, "author_fullname": "t2_2l5naau0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Yes", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Yes</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/giis9o8/", "num_reports": null, "locked": false, "name": "t1_giis9o8", "created": 1610121264.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610092464.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 14, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_ksvrgz", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "giisbwn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "dante21oliva", "fullname": "t2_487ve6wi"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_ksvrgz", "score": 14, "author_fullname": "t2_487ve6wi", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I bought 14 shares in 2019 at $225 pre-split price. I’ve sold most of my shares each time saying it too high. I wish I hadn’t, but great write ups like this always make me realize this is a long hold above anything else. Great post", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I bought 14 shares in 2019 at $225 pre-split price. I’ve sold most of my shares each time saying it too high. I wish I hadn’t, but great write ups like this always make me realize this is a long hold above anything else. Great post</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/giisbwn/", "num_reports": null, "locked": false, "name": "t1_giisbwn", "created": 1610121319.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610092519.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 11, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_ksvrgz", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "giiqr0x", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "PainfulEssence", "fullname": "t2_ulcod"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_ksvrgz", "score": 11, "author_fullname": "t2_ulcod", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "You'd think there's gotta be a dip sometime.. so even a $700 put for 1 year out would probably be profitable if sold at the right time", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>You&#39;d think there&#39;s gotta be a dip sometime.. so even a $700 put for 1 year out would probably be profitable if sold at the right time</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/giiqr0x/", "num_reports": null, "locked": false, "name": "t1_giiqr0x", "created": 1610119931.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610091131.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_ksvrgz", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gij4y0w", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "jermany755", "fullname": "t2_4aje7"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_giiqr0x", "score": 8, "author_fullname": "t2_4aje7", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "That's a $16,000 bet.  Wew lad.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>That&#39;s a $16,000 bet.  Wew lad.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/ksvrgz/dd_on_tesla_tsla_bubble_or_nah/gij4y0w/", "num_reports": null, "locked": false, "name": "t1_gij4y0w", "created": 1610133660.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610104860.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}