{"approved_at_utc": null, "selftext": "**Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot & Industrial stocks? Let’s talk about this and other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the [Dow Jones](https://ibb.co/nsJ4qqL) leading the way up over 400points and closing at a new record high, with the broad stock market [SP500](https://ibb.co/kKxbFdQ) also finishing 0.57% up for the day, while the tech heavy [Nasdaq Composite](https://ibb.co/C7CdfX8) finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the [VIX](https://ibb.co/4PR24Fc) saw a spike of more than 10% as rioters [STORMED](https://ibb.co/KjbQPkD) the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.\n\nYesterday we saw almost 70% of [COMPANIES](https://ibb.co/Br0Y0hB) advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 [SECTORS](https://ibb.co/FmhD70s) finished in the green with Banks , Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the [MARKET](https://ibb.co/XpbdM7p), while small & mid-caps, especially the value plays, outperformed the market.\n\nHere is the [HEAT MAP](https://ibb.co/WKhNSZh) from yesterday which shows how Big tech companies suffered yesterday, as the perceived threat of increased [TAXES](https://ibb.co/D79SMMP) spooked the market, while the Industrials, Banks, Green Energy & [POT](https://ibb.co/XZFHGvj) stocks flourished on the hope of a big stimulus with new & improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the [RETAIL](https://ibb.co/GfwgQ3Z) sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be [COSTCO](https://ibb.co/pQdXm2H), which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.\n\nYesterday we also saw the [FED](https://ibb.co/mFgqXN4) deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.\n\nIn some more good news, we saw the [Factory Orders](https://ibb.co/jRqfPf7) for November coming it at +1%, better than expected as shipments increased by 0.7%.\n\nWhile in some other not so good numbers we saw the December [PMI](https://ibb.co/7XjyFjB) slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP [numbers](https://ibb.co/kJ6jjRx) came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality [SECTOR](https://ibb.co/9sCLVqY). This was the first [month](https://ibb.co/3F8Q9j0) since April when we saw a lose of jobs in the nonfarm private business.\n\n[TODAY](https://ibb.co/vsB6NM2) we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.\n\nIn some other stock market news, we saw a report that [ROBLOX](https://ibb.co/3yqfGFZ) is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.\n\nSo, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the [SOLAR](https://ibb.co/KWH2wHh) stocks having spectacular gains with Sunrun, & SunPower gaining more than 16% with many other companies like [ENPHASE](https://ibb.co/72jTgdq) also soring, while the hydrogen play Plug Power also [soared](https://ibb.co/xDxrq80) more than 20% in after-hours after agreeing to a collaboration with SK Group.\n\nWe also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of [gambling](https://ibb.co/CPFdVpv) in most of the US.\n\nWe also saw other companies posting great numbers, with [T-Mobile](https://ibb.co/qC2rXQC) adding 5.5M customers, its best ever number as they lead the industry, while [ROKU](https://ibb.co/qxWCNg4) continued to be one of the best plays in the streaming business alongside Disney & Netflix as they have surpassed 50M accounts.\n\nAnd on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would greatly benefit them.\n\n[Ford](https://ibb.co/yNz7PjD) also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs & EVs.\n\nOn the other-hand we also saw [Chinese](https://ibb.co/rbRQwyq) tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba & Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continued to face selloff pressure after the blue sweep in Georgia.\n\nMy opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.\n\nSo, let’s hope for a good day in the market as the [WORLD](https://ibb.co/LCv8Dp1) markets are mixed while the US [FUTURES](https://ibb.co/wghkCJ1) seem to be pointing at a good open with the Nasdaq leading the way,  though in the last few days every single time the futures were up the stocks finished lower and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this. \n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F & Other Stock News [01-07]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kscunh", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 35, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 35, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1610029046.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1610053431.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Stocks go bonkers while the Dems take Georgia. The Capitol is breached. Is this the time to buy Solar, Pot &amp; Industrial stocks? Let’s talk about this and other stock market news</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a mixed day with the <a href=\"https://ibb.co/nsJ4qqL\">Dow Jones</a> leading the way up over 400points and closing at a new record high, with the broad stock market <a href=\"https://ibb.co/kKxbFdQ\">SP500</a> also finishing 0.57% up for the day, while the tech heavy <a href=\"https://ibb.co/C7CdfX8\">Nasdaq Composite</a> finished the day down 0.6%. All 3 of the big indexes were trading higher earlier in the day before the <a href=\"https://ibb.co/4PR24Fc\">VIX</a> saw a spike of more than 10% as rioters <a href=\"https://ibb.co/KjbQPkD\">STORMED</a> the US Capitol, before eventually getting back to certifying the electoral votes, which brought back some stability. This was a very bad incident but shouldn’t have long-lasting effects on the stock market.</p>\n\n<p>Yesterday we saw almost 70% of <a href=\"https://ibb.co/Br0Y0hB\">COMPANIES</a> advancing with over 300 new highs as the volume also spiked up, as 8 of the 11 <a href=\"https://ibb.co/FmhD70s\">SECTORS</a> finished in the green with Banks , Energy and Materials gaining more than 3%, while the biggest loser was by far the tech sectors, dropping 1.7%, as we saw Large-Cap Growth companies underperforming the <a href=\"https://ibb.co/XpbdM7p\">MARKET</a>, while small &amp; mid-caps, especially the value plays, outperformed the market.</p>\n\n<p>Here is the <a href=\"https://ibb.co/WKhNSZh\">HEAT MAP</a> from yesterday which shows how Big tech companies suffered yesterday, as the perceived threat of increased <a href=\"https://ibb.co/D79SMMP\">TAXES</a> spooked the market, while the Industrials, Banks, Green Energy &amp; <a href=\"https://ibb.co/XZFHGvj\">POT</a> stocks flourished on the hope of a big stimulus with new &amp; improved regulations, as it is expected that there will be an improved legislation that will help the cannabis stocks soar and the possible big stimulus would be a huge boost to most of the <a href=\"https://ibb.co/GfwgQ3Z\">RETAIL</a> sector which saw names like Nordstrom, GameStop, Target and many others posting big moves to the upside. Joining them should be <a href=\"https://ibb.co/pQdXm2H\">COSTCO</a>, which did lag yesterday, but posted terrific December numbers after hours, with comparable sales increasing more than 10% while e-commerce rose by more than 60% for the month.</p>\n\n<p>Yesterday we also saw the <a href=\"https://ibb.co/mFgqXN4\">FED</a> deciding to continue the current QE pace, as they still see plenty of uncertainty around, especially in the first quarter of 2021. They will continue to buy $120B worth of securities every month, as well as possibly moving on to some lengthier term maturities, while being opened to even more monetary easing if necessary.</p>\n\n<p>In some more good news, we saw the <a href=\"https://ibb.co/jRqfPf7\">Factory Orders</a> for November coming it at +1%, better than expected as shipments increased by 0.7%.</p>\n\n<p>While in some other not so good numbers we saw the December <a href=\"https://ibb.co/7XjyFjB\">PMI</a> slowing to 55.3, less than the 55.7 expected and 58.6 in the previous month, but this is still an indicator of expanding business activity, while ADP <a href=\"https://ibb.co/kJ6jjRx\">numbers</a> came in worse than expected, as the US lost 123K nonfarm jobs, worse than the 130K addition of jobs expected and 304K jobs gained in the previous month, as we saw a big loss of jobs in large business especially in the leisure/hospitality <a href=\"https://ibb.co/9sCLVqY\">SECTOR</a>. This was the first <a href=\"https://ibb.co/3F8Q9j0\">month</a> since April when we saw a lose of jobs in the nonfarm private business.</p>\n\n<p><a href=\"https://ibb.co/vsB6NM2\">TODAY</a> we have a loaded economic data calendar starting with jobless numbers early in the morning and finishing with the Fed Balance Sheet at the market close.</p>\n\n<p>In some other stock market news, we saw a report that <a href=\"https://ibb.co/3yqfGFZ\">ROBLOX</a> is looking to go public via direct listing, rather the traditional IPO. The latest funding round at $45/share saw the company valued at almost $30B, which is very high but we have to see the latest books of the company before making a prediction if it will go higher or not. This may be a better opportunity for retail investors to get in at lower prices, rather than buying at 2-3 times the IPO price.</p>\n\n<p>So, guys, due to the latest political developments we have seen a huge shift in the markets, as we saw yesterday the <a href=\"https://ibb.co/KWH2wHh\">SOLAR</a> stocks having spectacular gains with Sunrun, &amp; SunPower gaining more than 16% with many other companies like <a href=\"https://ibb.co/72jTgdq\">ENPHASE</a> also soring, while the hydrogen play Plug Power also <a href=\"https://ibb.co/xDxrq80\">soared</a> more than 20% in after-hours after agreeing to a collaboration with SK Group.</p>\n\n<p>We also saw gambling names move up after with the Senate changing leadership and states like New York pushing for the legalization of <a href=\"https://ibb.co/CPFdVpv\">gambling</a> in most of the US.</p>\n\n<p>We also saw other companies posting great numbers, with <a href=\"https://ibb.co/qC2rXQC\">T-Mobile</a> adding 5.5M customers, its best ever number as they lead the industry, while <a href=\"https://ibb.co/qxWCNg4\">ROKU</a> continued to be one of the best plays in the streaming business alongside Disney &amp; Netflix as they have surpassed 50M accounts.</p>\n\n<p>And on the industrial side we saw companies like Caterpillar and US Steel posting big gains in anticipation of an infrastructure bill that would greatly benefit them.</p>\n\n<p><a href=\"https://ibb.co/yNz7PjD\">Ford</a> also beat expectations with a decline in sales of just under 10%, better than the 14% expected as the company continues to move towards more trucks, SUVs &amp; EVs.</p>\n\n<p>On the other-hand we also saw <a href=\"https://ibb.co/rbRQwyq\">Chinese</a> tech and EV stocks fall, after more bad headlines like the US looking to ban even more big companies in the US like Alibaba &amp; Tencent. This is a continuing story which has peaked up steam in the recent year after the political tensions between the US and China have increased. This companies were also joined by the big tech which continued to face selloff pressure after the blue sweep in Georgia.</p>\n\n<p>My opinion is that you should start buying some green energy, pot and industrial stocks but you shouldn’t go to heavy on the first day. You should wait for things to cool-off a little and not buy everything at the top. I think a bi-weekly split strategy or monthly strategy would be nice. Which would mean you should divide your investment money and buy especially on red days every couple of weeks or on a monthly basis, but I would avoid Chinese stocks for now at least.</p>\n\n<p>So, let’s hope for a good day in the market as the <a href=\"https://ibb.co/LCv8Dp1\">WORLD</a> markets are mixed while the US <a href=\"https://ibb.co/wghkCJ1\">FUTURES</a> seem to be pointing at a good open with the Nasdaq leading the way,  though in the last few days every single time the futures were up the stocks finished lower and vice-verse, when the futures were red the stocks finished higher, so you shouldn’t base your investment on this. </p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/FxtLAfNUPId33_Ai4RegLmhfmDtXes_UJ-K5HwDiQsk.jpg?auto=webp&s=928f9807d472e2661fe9291bbbbd813fde18cadb", "width": 884, "height": 461}, "resolutions": [{"url": "https://external-preview.redd.it/FxtLAfNUPId33_Ai4RegLmhfmDtXes_UJ-K5HwDiQsk.jpg?width=108&crop=smart&auto=webp&s=8a8f078d3411866e143560f35fd0490eb2eeeae1", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/FxtLAfNUPId33_Ai4RegLmhfmDtXes_UJ-K5HwDiQsk.jpg?width=216&crop=smart&auto=webp&s=e13118d7f6f71e9149e8e63bf6f86f114323bb84", "width": 216, "height": 112}, {"url": "https://external-preview.redd.it/FxtLAfNUPId33_Ai4RegLmhfmDtXes_UJ-K5HwDiQsk.jpg?width=320&crop=smart&auto=webp&s=3456bff4c4b2b8f60725b2145d97a90d1b390d29", "width": 320, "height": 166}, {"url": "https://external-preview.redd.it/FxtLAfNUPId33_Ai4RegLmhfmDtXes_UJ-K5HwDiQsk.jpg?width=640&crop=smart&auto=webp&s=08454f3497ad7111d5fed2b32467204319dd7096", "width": 640, "height": 333}], "variants": {}, "id": "ptnmBaOGvi4Vm3n-gNIXe6FrnScOT9duN3YePkiOp5M"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kscunh", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 13, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/", "subreddit_subscribers": 1781399, "created_utc": 1610024631.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif5zph", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kscunh", "score": 10, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "\\~Tl;dr\\~ Buy select gambling, pot & green energy stocks", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>~Tl;dr~ Buy select gambling, pot &amp; green energy stocks</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif5zph/", "num_reports": null, "locked": false, "name": "t1_gif5zph", "created": 1610053553.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610024753.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "gif61qd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif5zph", "score": 4, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "gotcha", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>gotcha</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif61qd/", "num_reports": null, "locked": false, "name": "t1_gif61qd", "created": 1610053593.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "created_utc": 1610024793.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif63sz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "created_utc": 1610024835.0, "send_replies": true, "parent_id": "t1_gif61qd", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Thanks! Don't  know why this happens", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Thanks! Don&#39;t  know why this happens</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif63sz/", "num_reports": null, "locked": false, "name": "t1_gif63sz", "created": 1610053635.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "gif6c94", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif63sz", "score": 2, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "It should say why unless you hit something like the n-word filter or a \"this guy is advertising a quarantined domain\" type filter.\n\nIt didn't PM you?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>It should say why unless you hit something like the n-word filter or a &quot;this guy is advertising a quarantined domain&quot; type filter.</p>\n\n<p>It didn&#39;t PM you?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif6c94/", "num_reports": null, "locked": false, "name": "t1_gif6c94", "created": 1610053801.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "created_utc": 1610025001.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif6let", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif6c94", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "It did, but the ticker isn't in my post...", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>It did, but the ticker isn&#39;t in my post...</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif6let/", "num_reports": null, "locked": false, "name": "t1_gif6let", "created": 1610053977.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610025177.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 4, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "gif6drv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif63sz", "score": 2, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Examining [kscunh][Discussion] Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F & Other Stock News [01-07]\n\nRemoved Ticker: CPF\n\nThat's the last thing I see out of the bot from it. It should PM you a list of bad tickers if it finds any.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Examining [kscunh][Discussion] Stock Market News for Today | RUN, ENPH, TLRY, ACB, NIO, ROKU, CAT, F &amp; Other Stock News [01-07]</p>\n\n<p>Removed Ticker: CPF</p>\n\n<p>That&#39;s the last thing I see out of the bot from it. It should PM you a list of bad tickers if it finds any.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif6drv/", "num_reports": null, "locked": false, "name": "t1_gif6drv", "created": 1610053831.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "created_utc": 1610025031.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif6m9o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif6drv", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Yeah.. it did... but probably filter it wrong somehow", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Yeah.. it did... but probably filter it wrong somehow</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif6m9o/", "num_reports": null, "locked": false, "name": "t1_gif6m9o", "created": 1610053994.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610025194.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 4, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "gifacpr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "created_utc": 1610027566.0, "send_replies": true, "parent_id": "t1_gif6m9o", "score": 1, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "ah I see what happened\n\n>https://ibb.co/**CPF**dVpv", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>ah I see what happened</p>\n\n<blockquote>\n<p><a href=\"https://ibb.co/**CPF**dVpv\">https://ibb.co/**CPF**dVpv</a></p>\n</blockquote>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gifacpr/", "num_reports": null, "locked": false, "name": "t1_gifacpr", "created": 1610056366.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 5, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif78rs", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "iamtheturtleking", "fullname": "t2_lljoyxb"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gif5zph", "score": 1, "author_fullname": "t2_lljoyxb", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "You mean all in on Chinese EV stocks. Gotcha 👍🏿", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>You mean all in on Chinese EV stocks. Gotcha 👍🏿</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif78rs/", "num_reports": null, "locked": false, "name": "t1_gif78rs", "created": 1610054415.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610025615.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gifaflx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "sebastian9876543", "fullname": "t2_524eaaxw"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kscunh", "score": 2, "author_fullname": "t2_524eaaxw", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "How we feeling about Gold due to increased stimmy?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201214:2:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>How we feeling about Gold due to increased stimmy?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gifaflx/", "num_reports": null, "locked": false, "name": "t1_gifaflx", "created": 1610056413.0, "author_flair_text": "\u001b201214:2:1", "treatment_tags": [], "created_utc": 1610027613.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kscunh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gif7hz9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "u_r_awesome_lol", "fullname": "t2_97g2nfpz"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kscunh", "score": 1, "author_fullname": "t2_97g2nfpz", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Yo bitch you forgot to pump my WBA bag", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Yo bitch you forgot to pump my WBA bag</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kscunh/stock_market_news_for_today_run_enph_tlry_acb_nio/gif7hz9/", "num_reports": null, "locked": false, "name": "t1_gif7hz9", "created": 1610054583.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610025783.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}