{"approved_at_utc": null, "selftext": "Good Saturday afternoon to all of you here on r/wallstreetbets. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.\n\nHere is everything you need to know to get you ready for the trading week beginning December 7th, 2020.\n\n# **Any progress on stimulus could give the market a boost in the week ahead  - [(Source)](https://www.cnbc.com/2020/12/04/stimulus-hope-markets-focus-next-week.html)**\n*****\n> Stimulus to help the economy and vaccines to stop the virus are expected to the be the main focus in markets in the week ahead.\n*****\n> Efforts to move along a fiscal package in Congress picked up momentum in the past week with Congressional leaders sounding conciliatory, and a bi-partisan group of senators pushing their own $900 billion proposal.\n*****\n> “It probably boils down to how much [Senate Majority Leader] Mitch McConnell is willing to deal, and I don’t know what the answer is to that,” said Mike Schumacher, head of rate strategy at Wells Fargo. “If it’s going to happen, next week is the week. The government runs out of money on Friday. Congress has to come up with a funding scheme.”\n*****\n> Strategists have said the two events could be tied, but Congress could also push through a spending resolution without including stimulus. Some programs will expire at the end of the month, if Congress does not provide funding, including unemployment benefits for millions of Americans.\n*****\n> The on again, off again stimulus talks have led to skepticism in the market, and sets it up for a move higher if there is anything officially announced. “I wouldn’t think it’s fully baked in. I would say the stimulus is a positive catalyst, unless it’s less than $900 billion,” said Art Hogan, chief market strategist at National Securities.\n*****\n> While stocks surged in the past week, bond yields also moved higher. Yields move opposite price, and bond yields have been rising on stimulus expectations. More spending means more debt, and that sends rates higher.\n*****\n> The 10-year was at 0.97% Friday, and appeared ready to move back to the 1% level for the first time since March.\n*****\n> “Is it the case here, stimulus is already factored in, and will people take their money and run?” said Schumacher.\n*****\n> The S&P 500 gained 1.7% in the past week, ending Friday at 3,699, a record high. The Dow also ended up 1% at a record 30,218, and Nasdaq gained 2.1% to a record 12,464.\n*****\n> # Getting jabbed\n> Vaccine news has been a catalyst for the market’s surge since early November, when Pfizer first revealed the high efficacy of its vaccine. Since then Moderna and Astra-Zeneca both revealed results of their own vaccines.\n*****\n> A Food and Drug Administration advisory committee meets Thursday on emergency use authorization for the Pfizer and BioNTech vaccine.\n*****\n> “They’re starting to roll it out in the U.K, and that’s something that’s going to be watched here to see how it unfolds,” said Quincy Krosby, chief market strategist Prudential Financial. “That’s the next issue for the market. The deliveries, the distributions. Are people being jabbed? These are all questions the market is concerned about about because they’re looking forward to it unrolling smoothly in the U.S.”\n*****\n> About 3 million people will be vaccinated in the initial rollout. Moderna’s vaccine is expected to be approved the following week, and by year-end both vaccines are expected to reach 20 million people in the U.S.\n*****\n> “The vaccine news has started to see a bit of diminishing return in terms of its wow factor,” said Hogan. “There’s going to be some volatility around the logistics.”\n*****\n> Krosby said the virus remains in the forefront for the market because of the continuing spread and its economic impact as activities are shut down. California Thursday announced new restrictions with stay at home advisories in some regions.\n*****\n> “The big question is how long does the Covid surge last?” Krosby said.\n*****\n> The virus shutdowns appear to be behind a slowdown in the labor market, and economists say it could slow activity into the first quarter. November job growth of 245,000 was about 200,000 less than expected. That makes Thursday’s weekly jobless claims more important for markets.\n*****\n> There is also CPI and PPI inflation data Thursday and Friday.\n*****\n> “There is this push pull in the market regarding inflationary pressures,” said Krosby. “It’s not expected, which is why if it does print higher, it could ignite the conversation regarding inflation.”\n*****\n\n# **This past week saw the following moves in the S&P:**\n###### **([CLICK HERE FOR THE FULL S&P TREE MAP FOR THE PAST WEEK!](https://i.imgur.com/PZEBIS8.png))**\n\n# **Major Indices for this past week:**\n###### **([CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!](https://i.imgur.com/ypJI3Vy.png))**\n\n# **Major Futures Markets as of Friday's close:**\n###### **([CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!](https://i.imgur.com/s01kzjN.png))**\n\n# **Economic Calendar for the Week Ahead:**\n###### **([CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!](https://i.imgur.com/7Y1RKiX.png))**\n\n# **Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/nF9LHWm.png))**\n\n# **S&P Sectors for the Past Week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/F99YkSI.png))**\n\n# **Major Indices Pullback/Correction Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/00G6LqZ.png)**\n\n# **Major Indices Rally Levels as of Friday's close:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/8OK0Nmw.png))**\n\n# **Most Anticipated Earnings Releases for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/tgMnGUY.png))**\n(T.B.A. THIS WEEKEND.)\n\n# **Here are the upcoming IPO's for this week:**\n###### **([CLICK HERE FOR THE CHART!](https://i.imgur.com/PDrxDY8.png))**\n\n# **Friday's Stock Analyst Upgrades & Downgrades:**\n###### **([CLICK HERE FOR THE CHART LINK #1!](https://i.imgur.com/5rCf9oe.png))**\n###### **([CLICK HERE FOR THE CHART LINK #2!](https://i.imgur.com/VsZzlKU.png))**\n###### **([CLICK HERE FOR THE CHART LINK #3!](https://i.imgur.com/moiEQsJ.png))**\n\n*****\n\n> # Stocks and Bonds Both in Rally Mode\n\n> When it comes to equity market performance in a given month, it doesn't get much better than November. While the S&P 500's total return of 10.95% in the month was only the second-best monthly performance of the year, it was still enough to rank as the third-best month for the S&P 500 in the last thirty years and just the ninth month since 1980 that it was up 10%+.\n\n> The chart below shows the S&P 500's annualized total return over the last one, two, five, ten, and twenty years and compares the current returns to the historical average. For the last year, the S&P 500's total return has been 17.5% which is nearly six full percentage points higher than the historical average. For the last two years, the annualized return has been nearly as strong at 16.8%, and it is actually even stronger relative to the historical average of 10.5%. Moving further out the time horizon, the S&P 500's annualized returns drift lower, and while the five and ten-year annualized returns are greater than average, the S&P 500's annualized gain of 7.3% in the last 20 years is more than 3.5 percentage points below the historical average of 10.9%.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-SP-500-Act-vs-Avg.png))**\n\n> The last couple of years haven't just been strong for equities. Over the last year, long-term US Treasuries, as measured by the Merrill Lynch 10+ Year US Treasury Index, have rallied 15.7%, which is more than six full percentage points greater than the historical average of 9.5%. Over the last two years, returns have been even stronger with an annualized gain of nearly 20%, or more than double the historical average of 9.1%! While the last two years have been strong for US Treasuries, the last five, ten, and twenty years have all seen returns of between one and two percentage points below their historical average.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120LT-Treas-Act-vs-Avg.png))**\n\n> Lately, when you see rallies in the equity market, it tends to be accompanied by a decline in treasuries as yields rise. In November, though, that wasn't the case. Even with the S&P 500 up 10.95%, long-term US Treasuries rallied just over 1%. So how uncommon is it for stocks to rally like they did in November while bonds also rally. Actually, it is not very uncommon at all. The table below shows the nine months since 1980 where the S&P 500's total return in a given month was 10% or more, and of those months, long-term treasuies also rallied in every month but one (October 2011).\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-Stocks-Up-10.png))**\n\n*****\n\n> # Manufacturer Recovery Continues\n\n> This morning, the Institute for Supply Management (ISM) released a less positive outlook for the US manufacturing sector. The headline number for ISM's Manufacturing index fell from 59.3 last month down to 57.5. A drop was expected, but the actual results were worse than the drop to 58.0 that had been forecasted. That reading indicates that the manufacturing sector continued to grow in November but at a slower rate than October.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Headline.png))**\n\n> Similar to the various Federal Reserve bank surveys from around the country, breadth in the November report was more negative than in recent months. Of the ten indices excluding the headline number, only three were higher in November: Backlog Orders, Supplier Deliveries, and Export Orders. Additionally, two indices—Customer Inventories and Employment—showed contractionary readings.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Table1.png))**\n\n> One theme of the report was that orders remain very healthy. New Orders fell from 67.9 to 65.1, but that is a sixth consecutive month of expansionary readings. Although the index was lower this month, meaning new order growth decelerated, it remains in the top decile of historical readings. As new orders have continued to grow, so too have backlogs. The index for Backlog Orders has continued to press higher, rising to 56.9 from 55.7. That is in the 88th percentile of all months and is now at the highest level since August of 2018. Demand continues to improve with new orders coming in at a historically strong pace, even though it is slower than last month, and order backlogs have once again risen as a result.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Orders.png))**\n\n> As new order growth decelerated, so too did production. The index fell from 63.0 in October to 60.8 last month. That is still consistent with growth (readings above 50) in production but at the slowest rate since June. One factor that potentially had an impact on the slowdown in production is issues with suppliers. The index for Supplier Deliveries rose for the fourth month in a row in November and reached the highest level since May. Higher readings in the Supplier Deliveries index indicates longer lead times and vice versa. In other words, products from suppliers have been taking longer to reach manufacturers, in turn, impacting productivity.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Prod-Supp.png))**\n\n> Although suppliers appear to have some constraints and production has slowed slightly, business inventories rose for the second month in a row even as more and more firms report that customer inventories are too low. The index for Customer Inventories now sits in the bottom 2% of historical readings after dropping another 0.4 points in November. At 36.3, the index is at the lowest level since June of 2010. That low reading can be considered positive for future production.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Inventorie.png))**\n\n*****\n\n> # Big Gains In November Steal From Santa\n\n> What a month November was! Here are some of the highlights:\n\n> * Best month for Dow since January 1987 (11.9%) and best November since 1928\n> * Best month ever for the STOXX 600 (16.7%)\n> * Best month ever for the Russell 2000 (18.3%)\n> * Best month for the S&P 500 (10.8%) and Nasdaq (11.8%) since April 2020\n> * Best month for Dow Transports since October 2011 (12.1%)\n> * Best month from PHLX Semiconductor Index since March 2003 (18.4%)\n> * Best month for Industrials (16.0%) and Financials (16.8%) since April 2009\n> * Second best month ever for energy (28.0%)\n\n> A way better than expected earnings season, a likely split Congress, and major breakthroughs on the vaccine front all helped stocks soar last month,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Add ongoing support from the Federal Reserve as the cherry on top and we are looking at a truly historic month on many levels.”\n\n> Here’s all the Dow monthly returns since 1900. Last month was the best return since January 1987. Now before you go out and sell because you see 1987, remember the S&P 500 added another 20% the seven months after the huge gains in early 1987.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-1.png?ssl=1))**\n\n> It was the best November for the S&P 500 since November 1928.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-2.png?ssl=1))**\n\n> Small caps soared on the likelihood of taxes staying lower due to a divided Congress and vaccine progress, with the Russell 2000 adding more than 18% for the best month ever, topping the previous record from February 2000.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-3.png?ssl=1))**\n\n> What happens after a big month? Well, history says a 10% monthly gain is quite bullish. In fact, we had a 10% plus rally back in April 2020 and shared this same chart at that time. Sure enough, returns have been strong this time around as well. “The bottom line is the huge gains in November could actually be the start of something much stronger,” according to Ryan Detrick. “Also, this was the second month of 2020 with a 10% gain. The only other year to do that? 1982, which kicked off a historic bull market.”\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-3.png?ssl=1))**\n\n> Turning to December, this month is widely known to be quite bullish, as Santa comes to town, people feel good, and stocks tend to do well. As shown in the LPL Chart of the Day, since 1950, December has been the second best month of the year, with only November better. December had been the best month of the year until the historic 9.2% drop in 2018. As a result, December hasn’t been quite as strong over the past 10 and 20 years.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-4.png?ssl=1))**\n\n> Breaking it down even more, a big rally in November can potentially steal some of December’s thunder. As after a 5% or 10% rally in November, the returns in December are more muted. The flipside to this though is if the S&P 500 is up more than 10% for the year (like 2020), then stocks have benefited from some performance chasing and have tended to do better.\n\n> ###### **([CLICK HERE FOR THE CHART!](https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-5.png?ssl=1))**\n\n> What does it all mean? After the historic move in November we wouldn’t be surprised to see below average returns in December. We do believe this is a new bull market and lasting economic cycle of growth, but overall sentiment is getting quite stretched and this increases the potential for some near-term weakness. Please read COVID-19 May Threaten The Economic Recovey for more of our near-term thoughts.\n\n*****\n\n###### **([CLICK HERE FOR NEXT WEEK'S MOST NOTABLE EARNINGS RELEASES!](https://i.imgur.com/tgMnGUY.png))**\n###### **([CLICK HERE FOR NEXT WEEK'S HIGHEST VOLATILITY EARNINGS RELEASES!](https://i.imgur.com/OcdN1lK.png))**\n\n*****\n\nBelow are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release & consensus estimates courtesy of Earnings Whispers:\n\n*****\n\n> # ***Monday 12.7.20 Before Market Open:***\n> ###### ([CLICK HERE FOR MONDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/zvDIc4n.png))\n\n> # ***Monday 12.7.20 After Market Close:*** \n> ###### ([CLICK HERE FOR MONDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES LINK!](https://i.imgur.com/2sKfzD3.png))\n\n*****\n\n> # ***Tuesday  12.8.20 Before Market Open:***\n> ###### ([CLICK HERE FOR TUESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/YSw4HHd.png))\n\n> # ***Tuesday 12.8.20 After Market Close:*** \n> ###### ([CLICK HERE FOR TUESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/Yxn499V.png))\n\n*****\n\n> # ***Wednesday 12.9.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/XWzV3XV.png))\n\n> # ***Wednesday 12.9.20 After Market Close:*** \n> ###### ([CLICK HERE FOR WEDNESDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/3wEca2s.png))\n\n*****\n\n> # ***Thursday 12.10.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR THURSDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/aAPqY2r.png))\n\n> # ***Thursday 12.10.20 After Market Close:*** \n> ###### ([CLICK HERE FOR THURSDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/b7HgWVd.png))\n\n*****\n\n> # ***Friday 12.11.20 Before Market Open:*** \n> ###### ([CLICK HERE FOR FRIDAY'S PRE-MARKET EARNINGS TIME & ESTIMATES!](https://i.imgur.com/mOWs3cp.png))\n\n*****\n\n> # ***Friday 12.11.20 After Market Close:***\n> ###### ([CLICK HERE FOR FRIDAY'S AFTER-MARKET EARNINGS TIME & ESTIMATES!]())\n(NONE.)\n\n*****\n\n> # JinkoSolar Holding Co., Ltd. $61.40\n**JinkoSolar Holding Co., Ltd. (JKS)** is confirmed to report earnings at approximately 6:05 AM ET on Monday, December 7, 2020. The consensus earnings estimate is $0.85 per share on revenue of $1.29 billion. Investor sentiment going into the company's earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 30.77% with revenue increasing by 23.24%. Short interest has decreased by 25.0% since the company's last earnings release while the stock has drifted higher by 116.0% from its open following the earnings release to be 104.3% above its 200 day moving average of $30.05. Overall earnings estimates have been revised lower since the company's last earnings release. On Friday, November 27, 2020 there was some notable buying of 5,113 contracts of the $80.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 8.9% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=JKS&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Adobe Inc. $486.00\n**Adobe Inc. (ADBE)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 9, 2020. The consensus earnings estimate is $2.65 per share on revenue of $3.36 billion and the Earnings Whisper ® number is $2.75 per share. Investor sentiment going into the company's earnings release has 82% expecting an earnings beat The company's guidance was for earnings of approximately $2.64 per share. Consensus estimates are for year-over-year earnings growth of 14.72% with revenue increasing by 12.30%. Short interest has increased by 20.3% since the company's last earnings release while the stock has drifted lower by 3.9% from its open following the earnings release to be 16.4% above its 200 day moving average of $417.50. Overall earnings estimates have been revised higher since the company's last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,083 contracts of the $460.00 call and 4,014 contracts of the $460.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 6.3% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=ADBE&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Chewy, Inc. $74.94\n**Chewy, Inc. (CHWY)** is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, December 8, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.72 billion and the Earnings Whisper ® number is ($0.08) per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 39.86%. Short interest has decreased by 12.1% since the company's last earnings release while the stock has drifted higher by 27.4% from its open following the earnings release to be 50.0% above its 200 day moving average of $49.96. Overall earnings estimates have been revised lower since the company's last earnings release. On Thursday, November 19, 2020 there was some notable buying of 5,826 contracts of the $55.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 10.9% move on earnings and the stock has averaged a 6.1% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=CHWY&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # GameStop Corp. $16.90\n**GameStop Corp. (GME)** is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 8, 2020. The consensus estimate is for a loss of $0.81 per share on revenue of $1.11 billion and the Earnings Whisper ® number is ($0.45) per share. Investor sentiment going into the company's earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.31% with revenue decreasing by 22.84%. Short interest has increased by 21.1% since the company's last earnings release while the stock has drifted higher by 154.1% from its open following the earnings release to be 151.2% above its 200 day moving average of $6.73. Overall earnings estimates have been revised lower since the company's last earnings release. On Monday, November 30, 2020 there was some notable buying of 26,100 contracts of the $20.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 26.3% move on earnings and the stock has averaged a 13.7% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=GME&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Costco Wholesale Corp. $373.43\n**Costco Wholesale Corp. (COST)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $2.04 per share on revenue of $42.43 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.92% with revenue increasing by 14.55%. Short interest has increased by 7.4% since the company's last earnings release while the stock has drifted higher by 9.6% from its open following the earnings release to be 13.8% above its 200 day moving average of $328.23. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 23, 2020 there was some notable buying of 3,281 contracts of the $410.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 3.4% move on earnings and the stock has averaged a 1.1% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COST&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # lululemon athletica inc. $377.06\n**lululemon athletica inc. (LULU)** is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $0.85 per share on revenue of $1.01 billion and the Earnings Whisper ® number is $0.95 per share. Investor sentiment going into the company's earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.46% with revenue increasing by 10.25%. Short interest has decreased by 38.4% since the company's last earnings release while the stock has drifted higher by 12.6% from its open following the earnings release to be 29.4% above its 200 day moving average of $291.42. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 1,225 contracts of the $350.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 5.1% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=LULU&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Coupa Software $318.15\n**Coupa Software (COUP)** is confirmed to report earnings at approximately 4:10 PM ET on Monday, December 7, 2020. The consensus earnings estimate is $0.03 per share on revenue of $123.79 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company's earnings release has 57% expecting an earnings beat The company's guidance was for earnings of $0.02 to $0.03 per share on revenue of $123.00 million to $124.00 million. Consensus estimates are for earnings to decline year-over-year by 80.00% with revenue increasing by 21.62%. Short interest has increased by 1.6% since the company's last earnings release while the stock has drifted higher by 17.7% from its open following the earnings release to be 30.8% above its 200 day moving average of $243.24. Overall earnings estimates have been revised lower since the company's last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 3,642 contracts of the $350.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 8.6% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=COUP&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # AutoZone, Inc. -\n**AutoZone, Inc. (AZO)** is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, December 8, 2020. The consensus earnings estimate is $17.72 per share on revenue of $3.15 billion and the Earnings Whisper ® number is $18.05 per share. Investor sentiment going into the company's earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.92% with revenue increasing by 12.78%. Short interest has increased by 26.6% since the company's last earnings release while the stock has drifted lower by 5.0% from its open following the earnings release to be 5.9% above its 200 day moving average of $1,098.24. Overall earnings estimates have been revised higher since the company's last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 3.5% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AZO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # Broadcom Limited $411.68\n**Broadcom Limited (AVGO)** is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $6.24 per share on revenue of $6.42 billion and the Earnings Whisper ® number is $6.54 per share. Investor sentiment going into the company's earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.50% with revenue increasing by 11.15%. Short interest has decreased by 3.0% since the company's last earnings release while the stock has drifted higher by 14.0% from its open following the earnings release to be 31.6% above its 200 day moving average of $312.94. Overall earnings estimates have been revised higher since the company's last earnings release. On Monday, November 30, 2020 there was some notable buying of 2,344 contracts of the $440.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 4.3% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=AVGO&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n> # RH $468.00\n**RH (RH)** is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 9, 2020. The consensus earnings estimate is $5.35 per share on revenue of $839.59 million and the Earnings Whisper ® number is $5.68 per share. Investor sentiment going into the company's earnings release has 69% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 91.76% with revenue increasing by 23.92%. Short interest has decreased by 16.2% since the company's last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 75.7% above its 200 day moving average of $266.43. Overall earnings estimates have been revised higher since the company's last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 794 contracts of the $380.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 14.1% move on earnings and the stock has averaged a 11.7% move in recent quarters.\n\n> #([CLICK HERE FOR THE CHART!](http://elite.finviz.com/chart.ashx?t=RH&ty=c&ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&p=d&s=l))\n\n*****\n\n# DISCUSS!\n\nWhat are you all watching for in this upcoming trading week?\n\n*****\n\nI hope you all have a wonderful weekend and a great trading week ahead r/wallstreetbets.", "author_fullname": "t2_eaak0", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Wall Street Week Ahead for the trading week beginning December 7th, 2020", "link_flair_richtext": [{"e": "text", "t": "Stocks"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "stocks", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k7dmy5", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.93, "author_flair_background_color": "", "subreddit_type": "public", "ups": 23, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Stocks", "can_mod_post": false, "score": 23, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [{"e": "text", "t": "ʕ•ᴥ•ʔ🐻"}], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607224412.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "richtext", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Good Saturday afternoon to all of you here on <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>. I hope everyone on this sub made out pretty nicely in the market this past week, and is ready for the new trading week ahead.</p>\n\n<p>Here is everything you need to know to get you ready for the trading week beginning December 7th, 2020.</p>\n\n<h1><strong>Any progress on stimulus could give the market a boost in the week ahead  - <a href=\"https://www.cnbc.com/2020/12/04/stimulus-hope-markets-focus-next-week.html\">(Source)</a></strong></h1>\n\n<hr/>\n\n<blockquote>\n<p>Stimulus to help the economy and vaccines to stop the virus are expected to the be the main focus in markets in the week ahead.</p>\n\n<hr/>\n\n<p>Efforts to move along a fiscal package in Congress picked up momentum in the past week with Congressional leaders sounding conciliatory, and a bi-partisan group of senators pushing their own $900 billion proposal.</p>\n\n<hr/>\n\n<p>“It probably boils down to how much [Senate Majority Leader] Mitch McConnell is willing to deal, and I don’t know what the answer is to that,” said Mike Schumacher, head of rate strategy at Wells Fargo. “If it’s going to happen, next week is the week. The government runs out of money on Friday. Congress has to come up with a funding scheme.”</p>\n\n<hr/>\n\n<p>Strategists have said the two events could be tied, but Congress could also push through a spending resolution without including stimulus. Some programs will expire at the end of the month, if Congress does not provide funding, including unemployment benefits for millions of Americans.</p>\n\n<hr/>\n\n<p>The on again, off again stimulus talks have led to skepticism in the market, and sets it up for a move higher if there is anything officially announced. “I wouldn’t think it’s fully baked in. I would say the stimulus is a positive catalyst, unless it’s less than $900 billion,” said Art Hogan, chief market strategist at National Securities.</p>\n\n<hr/>\n\n<p>While stocks surged in the past week, bond yields also moved higher. Yields move opposite price, and bond yields have been rising on stimulus expectations. More spending means more debt, and that sends rates higher.</p>\n\n<hr/>\n\n<p>The 10-year was at 0.97% Friday, and appeared ready to move back to the 1% level for the first time since March.</p>\n\n<hr/>\n\n<p>“Is it the case here, stimulus is already factored in, and will people take their money and run?” said Schumacher.</p>\n\n<hr/>\n\n<p>The S&amp;P 500 gained 1.7% in the past week, ending Friday at 3,699, a record high. The Dow also ended up 1% at a record 30,218, and Nasdaq gained 2.1% to a record 12,464.</p>\n\n<hr/>\n\n<h1>Getting jabbed</h1>\n\n<p>Vaccine news has been a catalyst for the market’s surge since early November, when Pfizer first revealed the high efficacy of its vaccine. Since then Moderna and Astra-Zeneca both revealed results of their own vaccines.</p>\n\n<hr/>\n\n<p>A Food and Drug Administration advisory committee meets Thursday on emergency use authorization for the Pfizer and BioNTech vaccine.</p>\n\n<hr/>\n\n<p>“They’re starting to roll it out in the U.K, and that’s something that’s going to be watched here to see how it unfolds,” said Quincy Krosby, chief market strategist Prudential Financial. “That’s the next issue for the market. The deliveries, the distributions. Are people being jabbed? These are all questions the market is concerned about about because they’re looking forward to it unrolling smoothly in the U.S.”</p>\n\n<hr/>\n\n<p>About 3 million people will be vaccinated in the initial rollout. Moderna’s vaccine is expected to be approved the following week, and by year-end both vaccines are expected to reach 20 million people in the U.S.</p>\n\n<hr/>\n\n<p>“The vaccine news has started to see a bit of diminishing return in terms of its wow factor,” said Hogan. “There’s going to be some volatility around the logistics.”</p>\n\n<hr/>\n\n<p>Krosby said the virus remains in the forefront for the market because of the continuing spread and its economic impact as activities are shut down. California Thursday announced new restrictions with stay at home advisories in some regions.</p>\n\n<hr/>\n\n<p>“The big question is how long does the Covid surge last?” Krosby said.</p>\n\n<hr/>\n\n<p>The virus shutdowns appear to be behind a slowdown in the labor market, and economists say it could slow activity into the first quarter. November job growth of 245,000 was about 200,000 less than expected. That makes Thursday’s weekly jobless claims more important for markets.</p>\n\n<hr/>\n\n<p>There is also CPI and PPI inflation data Thursday and Friday.</p>\n\n<hr/>\n\n<p>“There is this push pull in the market regarding inflationary pressures,” said Krosby. “It’s not expected, which is why if it does print higher, it could ignite the conversation regarding inflation.”</p>\n\n<hr/>\n</blockquote>\n\n<h1><strong>This past week saw the following moves in the S&amp;P:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/PZEBIS8.png\">CLICK HERE FOR THE FULL S&amp;P TREE MAP FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Indices for this past week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/ypJI3Vy.png\">CLICK HERE FOR THE MAJOR INDICES FOR THE PAST WEEK!</a>)</strong></h6>\n\n<h1><strong>Major Futures Markets as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/s01kzjN.png\">CLICK HERE FOR THE MAJOR FUTURES INDICES AS OF FRIDAY!</a>)</strong></h6>\n\n<h1><strong>Economic Calendar for the Week Ahead:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/7Y1RKiX.png\">CLICK HERE FOR THE FULL ECONOMIC CALENDAR FOR THE WEEK AHEAD!</a>)</strong></h6>\n\n<h1><strong>Percentage Changes for the Major Indices, WTD, MTD, QTD, YTD as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/nF9LHWm.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>S&amp;P Sectors for the Past Week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/F99YkSI.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Major Indices Pullback/Correction Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/00G6LqZ.png\">CLICK HERE FOR THE CHART!</a></strong></h6>\n\n<h1><strong>Major Indices Rally Levels as of Friday&#39;s close:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/8OK0Nmw.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Most Anticipated Earnings Releases for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tgMnGUY.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>(T.B.A. THIS WEEKEND.)</p>\n\n<h1><strong>Here are the upcoming IPO&#39;s for this week:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/PDrxDY8.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<h1><strong>Friday&#39;s Stock Analyst Upgrades &amp; Downgrades:</strong></h1>\n\n<h6><strong>(<a href=\"https://i.imgur.com/5rCf9oe.png\">CLICK HERE FOR THE CHART LINK #1!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/VsZzlKU.png\">CLICK HERE FOR THE CHART LINK #2!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/moiEQsJ.png\">CLICK HERE FOR THE CHART LINK #3!</a>)</strong></h6>\n\n<hr/>\n\n<blockquote>\n<h1>Stocks and Bonds Both in Rally Mode</h1>\n\n<p>When it comes to equity market performance in a given month, it doesn&#39;t get much better than November. While the S&amp;P 500&#39;s total return of 10.95% in the month was only the second-best monthly performance of the year, it was still enough to rank as the third-best month for the S&amp;P 500 in the last thirty years and just the ninth month since 1980 that it was up 10%+.</p>\n\n<p>The chart below shows the S&amp;P 500&#39;s annualized total return over the last one, two, five, ten, and twenty years and compares the current returns to the historical average. For the last year, the S&amp;P 500&#39;s total return has been 17.5% which is nearly six full percentage points higher than the historical average. For the last two years, the annualized return has been nearly as strong at 16.8%, and it is actually even stronger relative to the historical average of 10.5%. Moving further out the time horizon, the S&amp;P 500&#39;s annualized returns drift lower, and while the five and ten-year annualized returns are greater than average, the S&amp;P 500&#39;s annualized gain of 7.3% in the last 20 years is more than 3.5 percentage points below the historical average of 10.9%.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-SP-500-Act-vs-Avg.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>The last couple of years haven&#39;t just been strong for equities. Over the last year, long-term US Treasuries, as measured by the Merrill Lynch 10+ Year US Treasury Index, have rallied 15.7%, which is more than six full percentage points greater than the historical average of 9.5%. Over the last two years, returns have been even stronger with an annualized gain of nearly 20%, or more than double the historical average of 9.1%! While the last two years have been strong for US Treasuries, the last five, ten, and twenty years have all seen returns of between one and two percentage points below their historical average.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120LT-Treas-Act-vs-Avg.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Lately, when you see rallies in the equity market, it tends to be accompanied by a decline in treasuries as yields rise. In November, though, that wasn&#39;t the case. Even with the S&amp;P 500 up 10.95%, long-term US Treasuries rallied just over 1%. So how uncommon is it for stocks to rally like they did in November while bonds also rally. Actually, it is not very uncommon at all. The table below shows the nine months since 1980 where the S&amp;P 500&#39;s total return in a given month was 10% or more, and of those months, long-term treasuies also rallied in every month but one (October 2011).</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-Stocks-Up-10.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Manufacturer Recovery Continues</h1>\n\n<p>This morning, the Institute for Supply Management (ISM) released a less positive outlook for the US manufacturing sector. The headline number for ISM&#39;s Manufacturing index fell from 59.3 last month down to 57.5. A drop was expected, but the actual results were worse than the drop to 58.0 that had been forecasted. That reading indicates that the manufacturing sector continued to grow in November but at a slower rate than October.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Headline.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Similar to the various Federal Reserve bank surveys from around the country, breadth in the November report was more negative than in recent months. Of the ten indices excluding the headline number, only three were higher in November: Backlog Orders, Supplier Deliveries, and Export Orders. Additionally, two indices—Customer Inventories and Employment—showed contractionary readings.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Table1.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>One theme of the report was that orders remain very healthy. New Orders fell from 67.9 to 65.1, but that is a sixth consecutive month of expansionary readings. Although the index was lower this month, meaning new order growth decelerated, it remains in the top decile of historical readings. As new orders have continued to grow, so too have backlogs. The index for Backlog Orders has continued to press higher, rising to 56.9 from 55.7. That is in the 88th percentile of all months and is now at the highest level since August of 2018. Demand continues to improve with new orders coming in at a historically strong pace, even though it is slower than last month, and order backlogs have once again risen as a result.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Orders.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>As new order growth decelerated, so too did production. The index fell from 63.0 in October to 60.8 last month. That is still consistent with growth (readings above 50) in production but at the slowest rate since June. One factor that potentially had an impact on the slowdown in production is issues with suppliers. The index for Supplier Deliveries rose for the fourth month in a row in November and reached the highest level since May. Higher readings in the Supplier Deliveries index indicates longer lead times and vice versa. In other words, products from suppliers have been taking longer to reach manufacturers, in turn, impacting productivity.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Prod-Supp.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Although suppliers appear to have some constraints and production has slowed slightly, business inventories rose for the second month in a row even as more and more firms report that customer inventories are too low. The index for Customer Inventories now sits in the bottom 2% of historical readings after dropping another 0.4 points in November. At 36.3, the index is at the lowest level since June of 2010. That low reading can be considered positive for future production.</p>\n\n<h6><strong>(<a href=\"https://media.bespokepremium.com/uploads/2020/12/120120-ISM-Inventorie.png\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Big Gains In November Steal From Santa</h1>\n\n<p>What a month November was! Here are some of the highlights:</p>\n\n<ul>\n<li>Best month for Dow since January 1987 (11.9%) and best November since 1928</li>\n<li>Best month ever for the STOXX 600 (16.7%)</li>\n<li>Best month ever for the Russell 2000 (18.3%)</li>\n<li>Best month for the S&amp;P 500 (10.8%) and Nasdaq (11.8%) since April 2020</li>\n<li>Best month for Dow Transports since October 2011 (12.1%)</li>\n<li>Best month from PHLX Semiconductor Index since March 2003 (18.4%)</li>\n<li>Best month for Industrials (16.0%) and Financials (16.8%) since April 2009</li>\n<li>Second best month ever for energy (28.0%)</li>\n</ul>\n\n<p>A way better than expected earnings season, a likely split Congress, and major breakthroughs on the vaccine front all helped stocks soar last month,” explained LPL Financial Chief Market Strategist Ryan Detrick. “Add ongoing support from the Federal Reserve as the cherry on top and we are looking at a truly historic month on many levels.”</p>\n\n<p>Here’s all the Dow monthly returns since 1900. Last month was the best return since January 1987. Now before you go out and sell because you see 1987, remember the S&amp;P 500 added another 20% the seven months after the huge gains in early 1987.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-1.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>It was the best November for the S&amp;P 500 since November 1928.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-2.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Small caps soared on the likelihood of taxes staying lower due to a divided Congress and vaccine progress, with the Russell 2000 adding more than 18% for the best month ever, topping the previous record from February 2000.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>What happens after a big month? Well, history says a 10% monthly gain is quite bullish. In fact, we had a 10% plus rally back in April 2020 and shared this same chart at that time. Sure enough, returns have been strong this time around as well. “The bottom line is the huge gains in November could actually be the start of something much stronger,” according to Ryan Detrick. “Also, this was the second month of 2020 with a 10% gain. The only other year to do that? 1982, which kicked off a historic bull market.”</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-3.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Turning to December, this month is widely known to be quite bullish, as Santa comes to town, people feel good, and stocks tend to do well. As shown in the LPL Chart of the Day, since 1950, December has been the second best month of the year, with only November better. December had been the best month of the year until the historic 9.2% drop in 2018. As a result, December hasn’t been quite as strong over the past 10 and 20 years.</p>\n\n<h6><strong>(<a href=\"https://i0.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-4.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>Breaking it down even more, a big rally in November can potentially steal some of December’s thunder. As after a 5% or 10% rally in November, the returns in December are more muted. The flipside to this though is if the S&amp;P 500 is up more than 10% for the year (like 2020), then stocks have benefited from some performance chasing and have tended to do better.</p>\n\n<h6><strong>(<a href=\"https://i1.wp.com/lplresearch.com/wp-content/uploads/2020/12/12.2.20-Blog-Chart-5.png?ssl=1\">CLICK HERE FOR THE CHART!</a>)</strong></h6>\n\n<p>What does it all mean? After the historic move in November we wouldn’t be surprised to see below average returns in December. We do believe this is a new bull market and lasting economic cycle of growth, but overall sentiment is getting quite stretched and this increases the potential for some near-term weakness. Please read COVID-19 May Threaten The Economic Recovey for more of our near-term thoughts.</p>\n</blockquote>\n\n<hr/>\n\n<h6><strong>(<a href=\"https://i.imgur.com/tgMnGUY.png\">CLICK HERE FOR NEXT WEEK&#39;S MOST NOTABLE EARNINGS RELEASES!</a>)</strong></h6>\n\n<h6><strong>(<a href=\"https://i.imgur.com/OcdN1lK.png\">CLICK HERE FOR NEXT WEEK&#39;S HIGHEST VOLATILITY EARNINGS RELEASES!</a>)</strong></h6>\n\n<hr/>\n\n<p>Below are some of the notable companies coming out with earnings releases this upcoming trading week ahead which includes the date/time of release &amp; consensus estimates courtesy of Earnings Whispers:</p>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Monday 12.7.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/zvDIc4n.png\">CLICK HERE FOR MONDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Monday 12.7.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/2sKfzD3.png\">CLICK HERE FOR MONDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES LINK!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Tuesday  12.8.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/YSw4HHd.png\">CLICK HERE FOR TUESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Tuesday 12.8.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/Yxn499V.png\">CLICK HERE FOR TUESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Wednesday 12.9.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/XWzV3XV.png\">CLICK HERE FOR WEDNESDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Wednesday 12.9.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/3wEca2s.png\">CLICK HERE FOR WEDNESDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Thursday 12.10.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/aAPqY2r.png\">CLICK HERE FOR THURSDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n\n<h1><strong><em>Thursday 12.10.20 After Market Close:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/b7HgWVd.png\">CLICK HERE FOR THURSDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 12.11.20 Before Market Open:</em></strong></h1>\n\n<h6>(<a href=\"https://i.imgur.com/mOWs3cp.png\">CLICK HERE FOR FRIDAY&#39;S PRE-MARKET EARNINGS TIME &amp; ESTIMATES!</a>)</h6>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1><strong><em>Friday 12.11.20 After Market Close:</em></strong></h1>\n\n<h6>([CLICK HERE FOR FRIDAY&#39;S AFTER-MARKET EARNINGS TIME &amp; ESTIMATES!]())</h6>\n\n<p>(NONE.)</p>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>JinkoSolar Holding Co., Ltd. $61.40</h1>\n\n<p><strong>JinkoSolar Holding Co., Ltd. (JKS)</strong> is confirmed to report earnings at approximately 6:05 AM ET on Monday, December 7, 2020. The consensus earnings estimate is $0.85 per share on revenue of $1.29 billion. Investor sentiment going into the company&#39;s earnings release has 64% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 30.77% with revenue increasing by 23.24%. Short interest has decreased by 25.0% since the company&#39;s last earnings release while the stock has drifted higher by 116.0% from its open following the earnings release to be 104.3% above its 200 day moving average of $30.05. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Friday, November 27, 2020 there was some notable buying of 5,113 contracts of the $80.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 12.8% move on earnings and the stock has averaged a 8.9% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=JKS&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Adobe Inc. $486.00</h1>\n\n<p><strong>Adobe Inc. (ADBE)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 9, 2020. The consensus earnings estimate is $2.65 per share on revenue of $3.36 billion and the Earnings Whisper ® number is $2.75 per share. Investor sentiment going into the company&#39;s earnings release has 82% expecting an earnings beat The company&#39;s guidance was for earnings of approximately $2.64 per share. Consensus estimates are for year-over-year earnings growth of 14.72% with revenue increasing by 12.30%. Short interest has increased by 20.3% since the company&#39;s last earnings release while the stock has drifted lower by 3.9% from its open following the earnings release to be 16.4% above its 200 day moving average of $417.50. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Wednesday, November 18, 2020 there was some notable buying of 4,083 contracts of the $460.00 call and 4,014 contracts of the $460.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 5.7% move on earnings and the stock has averaged a 6.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=ADBE&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Chewy, Inc. $74.94</h1>\n\n<p><strong>Chewy, Inc. (CHWY)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Tuesday, December 8, 2020. The consensus estimate is for a loss of $0.15 per share on revenue of $1.72 billion and the Earnings Whisper ® number is ($0.08) per share. Investor sentiment going into the company&#39;s earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 25.00% with revenue increasing by 39.86%. Short interest has decreased by 12.1% since the company&#39;s last earnings release while the stock has drifted higher by 27.4% from its open following the earnings release to be 50.0% above its 200 day moving average of $49.96. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Thursday, November 19, 2020 there was some notable buying of 5,826 contracts of the $55.00 put expiring on Friday, December 18, 2020. Option traders are pricing in a 10.9% move on earnings and the stock has averaged a 6.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=CHWY&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>GameStop Corp. $16.90</h1>\n\n<p><strong>GameStop Corp. (GME)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Tuesday, December 8, 2020. The consensus estimate is for a loss of $0.81 per share on revenue of $1.11 billion and the Earnings Whisper ® number is ($0.45) per share. Investor sentiment going into the company&#39;s earnings release has 51% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 65.31% with revenue decreasing by 22.84%. Short interest has increased by 21.1% since the company&#39;s last earnings release while the stock has drifted higher by 154.1% from its open following the earnings release to be 151.2% above its 200 day moving average of $6.73. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Monday, November 30, 2020 there was some notable buying of 26,100 contracts of the $20.00 put expiring on Friday, January 15, 2021. Option traders are pricing in a 26.3% move on earnings and the stock has averaged a 13.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=GME&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Costco Wholesale Corp. $373.43</h1>\n\n<p><strong>Costco Wholesale Corp. (COST)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $2.04 per share on revenue of $42.43 billion and the Earnings Whisper ® number is $2.25 per share. Investor sentiment going into the company&#39;s earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 17.92% with revenue increasing by 14.55%. Short interest has increased by 7.4% since the company&#39;s last earnings release while the stock has drifted higher by 9.6% from its open following the earnings release to be 13.8% above its 200 day moving average of $328.23. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, November 23, 2020 there was some notable buying of 3,281 contracts of the $410.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 3.4% move on earnings and the stock has averaged a 1.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=COST&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>lululemon athletica inc. $377.06</h1>\n\n<p><strong>lululemon athletica inc. (LULU)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $0.85 per share on revenue of $1.01 billion and the Earnings Whisper ® number is $0.95 per share. Investor sentiment going into the company&#39;s earnings release has 74% expecting an earnings beat. Consensus estimates are for earnings to decline year-over-year by 11.46% with revenue increasing by 10.25%. Short interest has decreased by 38.4% since the company&#39;s last earnings release while the stock has drifted higher by 12.6% from its open following the earnings release to be 29.4% above its 200 day moving average of $291.42. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 1,225 contracts of the $350.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 8.4% move on earnings and the stock has averaged a 5.1% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=LULU&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Coupa Software $318.15</h1>\n\n<p><strong>Coupa Software (COUP)</strong> is confirmed to report earnings at approximately 4:10 PM ET on Monday, December 7, 2020. The consensus earnings estimate is $0.03 per share on revenue of $123.79 million and the Earnings Whisper ® number is $0.09 per share. Investor sentiment going into the company&#39;s earnings release has 57% expecting an earnings beat The company&#39;s guidance was for earnings of $0.02 to $0.03 per share on revenue of $123.00 million to $124.00 million. Consensus estimates are for earnings to decline year-over-year by 80.00% with revenue increasing by 21.62%. Short interest has increased by 1.6% since the company&#39;s last earnings release while the stock has drifted higher by 17.7% from its open following the earnings release to be 30.8% above its 200 day moving average of $243.24. Overall earnings estimates have been revised lower since the company&#39;s last earnings release. On Wednesday, November 25, 2020 there was some notable buying of 3,642 contracts of the $350.00 call expiring on Friday, March 19, 2021. Option traders are pricing in a 10.4% move on earnings and the stock has averaged a 8.6% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=COUP&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>AutoZone, Inc. -</h1>\n\n<p><strong>AutoZone, Inc. (AZO)</strong> is confirmed to report earnings at approximately 6:55 AM ET on Tuesday, December 8, 2020. The consensus earnings estimate is $17.72 per share on revenue of $3.15 billion and the Earnings Whisper ® number is $18.05 per share. Investor sentiment going into the company&#39;s earnings release has 53% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 23.92% with revenue increasing by 12.78%. Short interest has increased by 26.6% since the company&#39;s last earnings release while the stock has drifted lower by 5.0% from its open following the earnings release to be 5.9% above its 200 day moving average of $1,098.24. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. Option traders are pricing in a 5.5% move on earnings and the stock has averaged a 3.5% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AZO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>Broadcom Limited $411.68</h1>\n\n<p><strong>Broadcom Limited (AVGO)</strong> is confirmed to report earnings at approximately 4:15 PM ET on Thursday, December 10, 2020. The consensus earnings estimate is $6.24 per share on revenue of $6.42 billion and the Earnings Whisper ® number is $6.54 per share. Investor sentiment going into the company&#39;s earnings release has 76% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 14.50% with revenue increasing by 11.15%. Short interest has decreased by 3.0% since the company&#39;s last earnings release while the stock has drifted higher by 14.0% from its open following the earnings release to be 31.6% above its 200 day moving average of $312.94. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Monday, November 30, 2020 there was some notable buying of 2,344 contracts of the $440.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 5.8% move on earnings and the stock has averaged a 4.3% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=AVGO&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<blockquote>\n<h1>RH $468.00</h1>\n\n<p><strong>RH (RH)</strong> is confirmed to report earnings at approximately 4:05 PM ET on Wednesday, December 9, 2020. The consensus earnings estimate is $5.35 per share on revenue of $839.59 million and the Earnings Whisper ® number is $5.68 per share. Investor sentiment going into the company&#39;s earnings release has 69% expecting an earnings beat. Consensus estimates are for year-over-year earnings growth of 91.76% with revenue increasing by 23.92%. Short interest has decreased by 16.2% since the company&#39;s last earnings release while the stock has drifted higher by 17.6% from its open following the earnings release to be 75.7% above its 200 day moving average of $266.43. Overall earnings estimates have been revised higher since the company&#39;s last earnings release. On Tuesday, November 24, 2020 there was some notable buying of 794 contracts of the $380.00 call expiring on Friday, December 18, 2020. Option traders are pricing in a 14.1% move on earnings and the stock has averaged a 11.7% move in recent quarters.</p>\n\n<h1>(<a href=\"http://elite.finviz.com/chart.ashx?t=RH&amp;ty=c&amp;ta=st_c,sch_200p,sma_50,sma_200,sma_20,sma_100,bb_20_2,rsi_b_14,macd_b_12_26_9,stofu_b_14_3_3&amp;p=d&amp;s=l\">CLICK HERE FOR THE CHART!</a>)</h1>\n</blockquote>\n\n<hr/>\n\n<h1>DISCUSS!</h1>\n\n<p>What are you all watching for in this upcoming trading week?</p>\n\n<hr/>\n\n<p>I hope you all have a wonderful weekend and a great trading week ahead <a href=\"/r/wallstreetbets\">r/wallstreetbets</a>.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?auto=webp&s=a444ef40437b3dd156da2de4d8e089173ac77c85", "width": 1236, "height": 760}, "resolutions": [{"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=108&crop=smart&auto=webp&s=818510bd8f2983f0874c5104210357155e0452e2", "width": 108, "height": 66}, {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=216&crop=smart&auto=webp&s=cd792e57ceab795cf2cbe21e1d51c94d07f4e53f", "width": 216, "height": 132}, {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=320&crop=smart&auto=webp&s=fd737487631e77536f99b7347bb51bcb21679202", "width": 320, "height": 196}, {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=640&crop=smart&auto=webp&s=22c67dc85be2a1bafdf1d3cc06fc326dfadd4d64", "width": 640, "height": 393}, {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=960&crop=smart&auto=webp&s=10d99cb6e712c3a91d321da61d7ee0c4e8a4dc3f", "width": 960, "height": 590}, {"url": "https://external-preview.redd.it/0KoU8Bti8SBSY0viHmzyOMl5E3kdSId3R226G3KKuZM.png?width=1080&crop=smart&auto=webp&s=71edad5e7e1d2fb91a9f2c307ab4f63be20ec519", "width": 1080, "height": 664}], "variants": {}, "id": "zo34jjfeXageBG-be2RH18tJB4b4-XWqyqTlyXUfkk8"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "234fbd78-ad54-11e5-b4c5-0e73c33c5a0b", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": "ʕ•ᴥ•ʔ🐻", "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#6189c0", "id": "k7dmy5", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "bigbear0083", "fullname": "t2_eaak0"}, "discussion_type": null, "num_comments": 16, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": "dark", "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/", "subreddit_subscribers": 1657831, "created_utc": 1607195612.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geq4hnu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "undergraduateproject", "fullname": "t2_l86uut2"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k7dmy5", "score": 10, "author_fullname": "t2_l86uut2", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Always great to see these posts", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Always great to see these posts</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geq4hnu/", "num_reports": null, "locked": false, "name": "t1_geq4hnu", "created": 1607224631.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607195831.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geq4rmu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "bigbear0083", "fullname": "t2_eaak0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_geq4hnu", "score": 8, "author_fullname": "t2_eaak0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "hah, thanks for that! appreciate you chiming in here to post that. :)", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "ʕ•ᴥ•ʔ🐻"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>hah, thanks for that! appreciate you chiming in here to post that. :)</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geq4rmu/", "num_reports": null, "locked": false, "name": "t1_geq4rmu", "created": 1607224775.0, "author_flair_text": "ʕ•ᴥ•ʔ🐻", "treatment_tags": [], "created_utc": 1607195975.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geqercf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ADoIDo", "fullname": "t2_4ul03gp0"}, "can_mod_post": false, "created_utc": 1607200796.0, "send_replies": true, "parent_id": "t1_geq4rmu", "score": 1, "author_fullname": "t2_4ul03gp0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Does anyone actually read that shit?", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Does anyone actually read that shit?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geqercf/", "num_reports": null, "locked": false, "name": "t1_geqercf", "created": 1607229596.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geqftcf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "UneSoggyCroissant", "fullname": "t2_4bty4vwa"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_geqercf", "score": 1, "author_fullname": "t2_4bty4vwa", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I read a bit", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I read a bit</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geqftcf/", "num_reports": null, "locked": false, "name": "t1_geqftcf", "created": 1607230064.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607201264.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geqgb02", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ADoIDo", "fullname": "t2_4ul03gp0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_geqftcf", "score": 1, "author_fullname": "t2_4ul03gp0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Afterwards, did you experience brain pain...", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Afterwards, did you experience brain pain...</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geqgb02/", "num_reports": null, "locked": false, "name": "t1_geqgb02", "created": 1607230295.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607201495.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 4, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "geq45mv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k7dmy5", "score": 3, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k7dmy5&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k7dmy5&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=k7dmy5)\n___\n ^comment ^will ^disappear ^--- ^44 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1607197314.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k7dmy5&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k7dmy5&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=k7dmy5\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>44</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geq45mv/", "num_reports": null, "locked": false, "name": "t1_geq45mv", "created": 1607224455.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1607195655.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geq6cui", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Irecio90", "fullname": "t2_kfqo6"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k7dmy5", "score": 3, "author_fullname": "t2_kfqo6", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Dang so CHWY and GME are doing their ER on the same day? Shieeetttt. I was really hoping Cohen would bust in on GME.\n\nShould I take out my GME calls/shares before earnings?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Dang so CHWY and GME are doing their ER on the same day? Shieeetttt. I was really hoping Cohen would bust in on GME.</p>\n\n<p>Should I take out my GME calls/shares before earnings?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geq6cui/", "num_reports": null, "locked": false, "name": "t1_geq6cui", "created": 1607225596.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607196796.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k7dmy5", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geq8yva", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "thehelper900", "fullname": "t2_1152fe"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_geq6cui", "score": 2, "author_fullname": "t2_1152fe", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "No", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k7dmy5/wall_street_week_ahead_for_the_trading_week/geq8yva/", "num_reports": null, "locked": false, "name": "t1_geq8yva", "created": 1607226970.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607198170.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}