{"approved_at_utc": null, "selftext": "**Are investors too bullish right now? What are the latest market movements in the auto industry? Pot get legalized in Mexico while FuboTv Plunges yet again. Let’s talk about this and other stock market news**\n\n**\\~Very Long Post\\~**\n\nHello everyone and Good Morning!\n\nFirst of all, I wanted to wish everyone a happy new year and hopefully things get better in 2021, and this also brings us at least the great returns that we had in 2020 in the stock market!\n\nSo, let’s start with the recap of yesterday, as we saw all 3 big indexes finish the last full trading day of the year in the green, with the [Dow Jones](https://ibb.co/0cvjjHN) leading the way, up .24% and closing at a new record high, while both the tech heavy [Nasdaq Composite](https://ibb.co/QFyd2f6) and the broad market [SP500](https://ibb.co/B67fT1g) were up just over .1% for the day.\n\nWe also saw the [VIX](https://ibb.co/b6Nqf9Z) barely drop yesterday closing just below 23, and with the Georgia runoff election just days away, we can see this going higher if the Democrats win both seats.\n\nWe saw almost 70% of the companies advancing [yesterday](https://ibb.co/g9CHK9Q) with most of them trading way below average volume as 7 of the 11 [SECTORS](https://ibb.co/LzXDF2P) finished in the green, with Energy & Materials closing the day up more than 1.3% while the biggest loser was the Communications sector, falling almost 0.7%, as we saw the small-cap stocks regain some momentum, [leading](https://ibb.co/yQCFtTZ) the way after they had 2 very bad days to start the week, while the only group that was losing ground yesterday was the large-cap growth sector.\n\nHere is the [HEAT MAP](https://ibb.co/x5bN7Lk) from yesterday that pretty much sums up the other charts as we can see most big tech companies like Amazon, Google, Microsoft and even Apple losing ground for the day, while the biggest gainers were companies like Tesla & TSM alongside the industrial sector and companies like Disney and Mastercard.\n\nYesterday we also got the investor sentiment [SURVEY](https://ibb.co/7QPXjPV), which for me personally came in pretty mixed, as I use this as a contrarian indicator. This last week we saw 2.5% more investors moving to the bull’s camp, while we also saw almost a 5% increase in bears, as investors become more divided. I think the market is still a little to over bullish and I would avoid to add more money right now, but I wouldn’t get of the stock market either. I think this is a good moment to stay put and wait for more developments overall, but there might still be some good opportunities around in the market and I wouldn’t avoid getting into those.\n\nWe also got a lot of economic data yesterday, with a survey for business uncertainty for [December](https://ibb.co/87FMyQ6) showing increasing uncertainty for sales growth but a with a small decline in employment growth expectations.\n\nMeanwhile another number that confirms the investor sentiment survey is the Investor Confidence [Index](https://ibb.co/5952C9Z) which rose by more than 13 points in November, as investors increased the risk appetite for their portfolios.\n\nAlongside this we also saw the November pending home [SALES](https://ibb.co/F8WBXnh) decrease by more than 2.5% month over month, but are still up more than 16% since a year ago, with this monthly decrease mostly coming due to the shortage of inventory.\n\nThe Chicago [PMI](https://ibb.co/QF40My3) also came in way better than expected and 59.5 vs 57 expected and up from the 58.2 in the previous month with the biggest movement coming from the employment indicator as it rose to a one year high but is still in contraction territory since 2019.\n\nWe also saw the wholesale [inventories](https://ibb.co/fkWmNmc) decrease in November’s advance read while the [retail](https://ibb.co/BBKNrb5) inventories saw an increase of .7%, pretty much in-line with expectations while the trade [balance](https://ibb.co/CKSR070) also saw a surprise decline in the deficit to more than of $84B, $4B worse than the last revision.\n\n[Today](https://ibb.co/D14JGZc) we get initial and continuing jobless claims numbers, alongside the money supply and the FED Balance sheet to end us off for the year.\n\nIn some other stock market [news](https://ibb.co/GkZgGM1), we saw Fubo sink more than 14% again yesterday after another investing firm announced they have shorted the stock, pointing to the insane valuations of more than $13.000/subscriber.\n\nWe also saw a [research](https://ibb.co/QMF5fnG) that indicated some changes in the market share of car companies with Hyundai/Kia having the biggest gains alongside GM, while Nissan saw the biggest decline in market share, mostly due to selling larger & pricier SUVs with cars continuing to see a decline in sales, while the larger vehicles have started to rebound slightly, as all car makers are [bringing](https://ibb.co/kJGkXtz) more & more SUVs and Trucks to the market.\n\nLockheed Martin also was [awarded](https://ibb.co/bWS5G6j) a new Navy contract worth more than $900M as this might help the company start to get back on track while Mexico will become the world largest legal cannabis market as the Mexican Senate passed a bill in November which is [expected](https://ibb.co/VW3Lqtn) to receive approval in the lower house by February. This is great news for companies in the sector like ACB, Canopy Growth and the future merged company Tilray & Aphria.\n\nAlso, one of the biggest active ETFs with over $15B in assets, the [ARK](https://ibb.co/80WJFdW) Innovation ETF saw it’s first daily withdrawal since November, as this hasn’t experienced weekly outflows since early in 2020, this might have been driven by profit taking as this ETF has surged more than 140% this year and also just the ex-dividend date on the 29th, as people expect for the ETF to have a hard time in duplicating the results of this year, which saw it rise on the back of Tesla and Roku with both of them seeing massive increases, with Tesla having more than 7x-ing this year, as that is the biggest holding in the ETF, but who knows we have to wait and see as [TESLA](https://ibb.co/ZzGQgqX) may hit 500K deliveries this year.\n\nAnd one last piece of [news](https://ibb.co/9bQhB4B) is that Apple did a big purge in their App Store, removing almost 40K game apps as this was the deadline for the developers to submit a government issued license number that enabled users to make in-app purchases. I don’t really think this will have a major impact for the revenues but we will soon find out.\n\nLet’s hope for a good day in the market as US [FUTURES](https://ibb.co/mvv7tjX) seem to be pointing at a mixed open, with the Nasdaq and the SP500 pointing at a good open while the Dow is slightly down, and with no connection to this, in the UK, the [BREXIT](https://ibb.co/Rh1DYyG) chapter is finally about to close.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Stock Market News for Today | LMT, AAPL, ACB, TLRY, FUBO, ARKK & other stock market news", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_knqfeb", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 29, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 29, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1609423393.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609451854.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Are investors too bullish right now? What are the latest market movements in the auto industry? Pot get legalized in Mexico while FuboTv Plunges yet again. Let’s talk about this and other stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning!</p>\n\n<p>First of all, I wanted to wish everyone a happy new year and hopefully things get better in 2021, and this also brings us at least the great returns that we had in 2020 in the stock market!</p>\n\n<p>So, let’s start with the recap of yesterday, as we saw all 3 big indexes finish the last full trading day of the year in the green, with the <a href=\"https://ibb.co/0cvjjHN\">Dow Jones</a> leading the way, up .24% and closing at a new record high, while both the tech heavy <a href=\"https://ibb.co/QFyd2f6\">Nasdaq Composite</a> and the broad market <a href=\"https://ibb.co/B67fT1g\">SP500</a> were up just over .1% for the day.</p>\n\n<p>We also saw the <a href=\"https://ibb.co/b6Nqf9Z\">VIX</a> barely drop yesterday closing just below 23, and with the Georgia runoff election just days away, we can see this going higher if the Democrats win both seats.</p>\n\n<p>We saw almost 70% of the companies advancing <a href=\"https://ibb.co/g9CHK9Q\">yesterday</a> with most of them trading way below average volume as 7 of the 11 <a href=\"https://ibb.co/LzXDF2P\">SECTORS</a> finished in the green, with Energy &amp; Materials closing the day up more than 1.3% while the biggest loser was the Communications sector, falling almost 0.7%, as we saw the small-cap stocks regain some momentum, <a href=\"https://ibb.co/yQCFtTZ\">leading</a> the way after they had 2 very bad days to start the week, while the only group that was losing ground yesterday was the large-cap growth sector.</p>\n\n<p>Here is the <a href=\"https://ibb.co/x5bN7Lk\">HEAT MAP</a> from yesterday that pretty much sums up the other charts as we can see most big tech companies like Amazon, Google, Microsoft and even Apple losing ground for the day, while the biggest gainers were companies like Tesla &amp; TSM alongside the industrial sector and companies like Disney and Mastercard.</p>\n\n<p>Yesterday we also got the investor sentiment <a href=\"https://ibb.co/7QPXjPV\">SURVEY</a>, which for me personally came in pretty mixed, as I use this as a contrarian indicator. This last week we saw 2.5% more investors moving to the bull’s camp, while we also saw almost a 5% increase in bears, as investors become more divided. I think the market is still a little to over bullish and I would avoid to add more money right now, but I wouldn’t get of the stock market either. I think this is a good moment to stay put and wait for more developments overall, but there might still be some good opportunities around in the market and I wouldn’t avoid getting into those.</p>\n\n<p>We also got a lot of economic data yesterday, with a survey for business uncertainty for <a href=\"https://ibb.co/87FMyQ6\">December</a> showing increasing uncertainty for sales growth but a with a small decline in employment growth expectations.</p>\n\n<p>Meanwhile another number that confirms the investor sentiment survey is the Investor Confidence <a href=\"https://ibb.co/5952C9Z\">Index</a> which rose by more than 13 points in November, as investors increased the risk appetite for their portfolios.</p>\n\n<p>Alongside this we also saw the November pending home <a href=\"https://ibb.co/F8WBXnh\">SALES</a> decrease by more than 2.5% month over month, but are still up more than 16% since a year ago, with this monthly decrease mostly coming due to the shortage of inventory.</p>\n\n<p>The Chicago <a href=\"https://ibb.co/QF40My3\">PMI</a> also came in way better than expected and 59.5 vs 57 expected and up from the 58.2 in the previous month with the biggest movement coming from the employment indicator as it rose to a one year high but is still in contraction territory since 2019.</p>\n\n<p>We also saw the wholesale <a href=\"https://ibb.co/fkWmNmc\">inventories</a> decrease in November’s advance read while the <a href=\"https://ibb.co/BBKNrb5\">retail</a> inventories saw an increase of .7%, pretty much in-line with expectations while the trade <a href=\"https://ibb.co/CKSR070\">balance</a> also saw a surprise decline in the deficit to more than of $84B, $4B worse than the last revision.</p>\n\n<p><a href=\"https://ibb.co/D14JGZc\">Today</a> we get initial and continuing jobless claims numbers, alongside the money supply and the FED Balance sheet to end us off for the year.</p>\n\n<p>In some other stock market <a href=\"https://ibb.co/GkZgGM1\">news</a>, we saw Fubo sink more than 14% again yesterday after another investing firm announced they have shorted the stock, pointing to the insane valuations of more than $13.000/subscriber.</p>\n\n<p>We also saw a <a href=\"https://ibb.co/QMF5fnG\">research</a> that indicated some changes in the market share of car companies with Hyundai/Kia having the biggest gains alongside GM, while Nissan saw the biggest decline in market share, mostly due to selling larger &amp; pricier SUVs with cars continuing to see a decline in sales, while the larger vehicles have started to rebound slightly, as all car makers are <a href=\"https://ibb.co/kJGkXtz\">bringing</a> more &amp; more SUVs and Trucks to the market.</p>\n\n<p>Lockheed Martin also was <a href=\"https://ibb.co/bWS5G6j\">awarded</a> a new Navy contract worth more than $900M as this might help the company start to get back on track while Mexico will become the world largest legal cannabis market as the Mexican Senate passed a bill in November which is <a href=\"https://ibb.co/VW3Lqtn\">expected</a> to receive approval in the lower house by February. This is great news for companies in the sector like ACB, Canopy Growth and the future merged company Tilray &amp; Aphria.</p>\n\n<p>Also, one of the biggest active ETFs with over $15B in assets, the <a href=\"https://ibb.co/80WJFdW\">ARK</a> Innovation ETF saw it’s first daily withdrawal since November, as this hasn’t experienced weekly outflows since early in 2020, this might have been driven by profit taking as this ETF has surged more than 140% this year and also just the ex-dividend date on the 29th, as people expect for the ETF to have a hard time in duplicating the results of this year, which saw it rise on the back of Tesla and Roku with both of them seeing massive increases, with Tesla having more than 7x-ing this year, as that is the biggest holding in the ETF, but who knows we have to wait and see as <a href=\"https://ibb.co/ZzGQgqX\">TESLA</a> may hit 500K deliveries this year.</p>\n\n<p>And one last piece of <a href=\"https://ibb.co/9bQhB4B\">news</a> is that Apple did a big purge in their App Store, removing almost 40K game apps as this was the deadline for the developers to submit a government issued license number that enabled users to make in-app purchases. I don’t really think this will have a major impact for the revenues but we will soon find out.</p>\n\n<p>Let’s hope for a good day in the market as US <a href=\"https://ibb.co/mvv7tjX\">FUTURES</a> seem to be pointing at a mixed open, with the Nasdaq and the SP500 pointing at a good open while the Dow is slightly down, and with no connection to this, in the UK, the <a href=\"https://ibb.co/Rh1DYyG\">BREXIT</a> chapter is finally about to close.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/AcYH306ob2S-aGmKR3ExQ-SFqTDRo_ik1fZL0E-3ZTo.jpg?auto=webp&s=be26acf15dfd32362073640650807ec359dbe796", "width": 886, "height": 466}, "resolutions": [{"url": "https://external-preview.redd.it/AcYH306ob2S-aGmKR3ExQ-SFqTDRo_ik1fZL0E-3ZTo.jpg?width=108&crop=smart&auto=webp&s=e439fda9e7242dff1e94a081275fbf813276a7d5", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/AcYH306ob2S-aGmKR3ExQ-SFqTDRo_ik1fZL0E-3ZTo.jpg?width=216&crop=smart&auto=webp&s=92b4559a12d436074e60c11d5d03069b726ed319", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/AcYH306ob2S-aGmKR3ExQ-SFqTDRo_ik1fZL0E-3ZTo.jpg?width=320&crop=smart&auto=webp&s=412490a639b2068cd5008c2710a19d43c2300031", "width": 320, "height": 168}, {"url": "https://external-preview.redd.it/AcYH306ob2S-aGmKR3ExQ-SFqTDRo_ik1fZL0E-3ZTo.jpg?width=640&crop=smart&auto=webp&s=5fa8327aadda1067d9a9c615b61a458094e5f18a", "width": 640, "height": 336}], "variants": {}, "id": "lebO4A70rAuMglKJYbrM0PX2GEiGDU8XyWInqbGOjvU"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "knqfeb", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 5, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/knqfeb/stock_market_news_for_today_lmt_aapl_acb_tlry/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/knqfeb/stock_market_news_for_today_lmt_aapl_acb_tlry/", "subreddit_subscribers": 1755925, "created_utc": 1609423054.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 9, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_knqfeb", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "ghltdmd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_knqfeb", "score": 9, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knqfeb/stock_market_news_for_today_lmt_aapl_acb_tlry/ghltdmd/", "num_reports": null, "locked": false, "name": "t1_ghltdmd", "created": 1609451855.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1609423055.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_knqfeb", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "ghltm53", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_knqfeb", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=knqfeb&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=knqfeb&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=knqfeb)\n___\n ^comment ^will ^disappear ^--- ^27 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1609426917.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=knqfeb&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=knqfeb&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=knqfeb\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>27</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knqfeb/stock_market_news_for_today_lmt_aapl_acb_tlry/ghltm53/", "num_reports": null, "locked": false, "name": "t1_ghltm53", "created": 1609452023.0, "author_flair_text": ":zjz_flair: Robot Janitor", "treatment_tags": [], "created_utc": 1609423223.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_knqfeb", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghlyq1m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_knqfeb", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "\\~Tl;dr\\~ Buy AAPL, LMT & GRWG/TLRY/ACB (pick one)", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>~Tl;dr~ Buy AAPL, LMT &amp; GRWG/TLRY/ACB (pick one)</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knqfeb/stock_market_news_for_today_lmt_aapl_acb_tlry/ghlyq1m/", "num_reports": null, "locked": false, "name": "t1_ghlyq1m", "created": 1609455364.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609426564.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}