{"approved_at_utc": null, "selftext": "**TLDR: Buy VIAC. Potential 10X returns. Large proprietary content library. Great subscription growth numbers. Paramount+ launching globally.**\n\nLong time lurker, first-time poster. Was introduced to WSB by a friend and bought GME a few weeks back. Best decision of my life. I've just gotten out of GME and am putting all of that cash into ViacomCBS (VIAC). Here's why I'm extremely bullish about VIAC:\n\n**Introduction**\n\nThe global video streaming industry continues to grow at a staggering pace and **revenues are expected to double over the next 5 years to \\~1 Tn**. Few pure-play media assets remain, with surviving firms beginning to explore alternative strategies in the face of disruption. There are **three main trends** currently in the industry:\n\n1. Merge / acquire downstream (typically with telecoms) (e.g. AT&T / Comcast) and launch DTC offerings\n2. Launch DTC offerings (e.g. Disney, ViacomCBS) without downstream merger\n3. Stay the course, seek opportunities for sale (e.g. Lionsgate / Discovery)\n\nThe **primary issue with type (1) companies**, in my opinion, is that the **high cost of an LBO / M&A have increased debt levels of companies such as AT&T**. Shareholder inertia coupled with high debt-servicing costs in the long term will translate into **lower content spend** and **higher bankruptcy risks moving forward**.\n\nYes, interest rates are at an all-time low currently, with the fed pledging to keep them at 0% for the foreseeable future. However, I believe that it would be a mistake if we were to disregard financial frictions increasing debt servicing costs. Banks have already started to tighten loan originations, and consumers are beginning to cut back on retail expenditure. **Falling consumer confidence and consumption, increased asset price dislocations, and likely regulatory failure may precipitate a credit crunch, one not dissimilar to 2008's subprime crisis.**\n\nIf I had to bet on which firm would survive the following few years (AT&T / Comcast / ViacomCBS), I'd put my bet on ViacomCBS. **It is important to not simply examine gearing ratios to determine a firm's liquidity moving forward, but also their inherent cost structures.** All three firms are highly levered. However, unlike AT&T and Comcast, **ViacomCBS is also actively reducing their debt**. Rather than acquiring traditional satellite tv providers (looking at you AT&T), it decided to sell off legacy businesses (e.g. Simon & Schuster). In addition, it is worth noting that the majority of ViacomCBS' debt comes from the acquisition of media IP.\n\nIn summary, **ViacomCBS is navigating industry headwinds with relative ease compared to telecom-media companies**. It has an asset-light structure compared to AT&T and Comcast, and is hence **better positioned to move into the digital streaming age**.\n\n**Comps**\n\n**At the moment, VIAC trades more like a traditional media play** (low PE ratio of 8.55). Comparables include Lionsgate (PE: 12.7) and Fox (PE: 10.7). Even when benchmarked against traditional media play comparables, VIAC is undervalued. There is substantial market demand right now for traditional media assets as the streaming wars continue to heat up. **At the very least we would be looking at a 20-30% jump in VIAC if we simply rely on comps analysis.**\n\nMore importantly, ViacomCBS has been digitalizing and reorganizing themselves to become a streaming giant - more comparable to Netflix (PE: 82.9) and Disney (PE: 86.4). Even Comcast has a PE ratio of 17.7. **Paramount Plus has already launched in certain parts of Europe to great success**and will be **launching in the US and Australasia in 2021 (More on this later)**. Valuing VIAC as a **Content as a Service** play would mean a **potential 10X upside**.\n\n**Execution**\n\nExtremely robust growth in streaming of **72% YOY**, with **total US subscribers** to Pluto and CBS AA **totaling** **\\~46M**. This is greater than 50% of ***Disney+'s global subscription base***, and a strong showing given that ViacomCBS has only started focusing on streaming a little over 2 years ago.\n\nViacomCBS has named **Tom Ryan as their new head of streaming**. Ryan comes from ViacomCBS' acquisition of Pluto, is a **notable figure in the startup and venture capital community,** and has sat at the **convergence of retail and entertainment** over the past few decades. He was formerly affiliated with Trunk Club (retail disruptor acquired by Nordstrom) and Bessemer (one of the valley's leading VCs). It is **increasingly difficult for large corporates to acquire innovative talent**.\n\nUnlike AT&T, **ViacomCBS understands branding**. Their decision to streamline their streaming services and rebrand them as Paramount+ (which is a relatively visible brand globally) is nothing short of a stroke of marketing genius. Compared to its competitors, it is **building on a brand that has been associated with quality films and TV programming globally**.\n\nWhat are its competitors doing? **I sure as hell have never heard of Peacock before 2020**. And while HBO is associated with quality programming globally, **AT&T has had substantial brand confusion across its streaming products**. I mean, there is HBO Go, HBO Now, and HBO Max (in addition to a variety of AT&T streaming brands). AT&T's branding strategy is a complete clusterfuck.\n\n**Content**\n\nContent is king. More specifically, proprietary content is king. At **30,000+ hours of content**, ViacomCBS will have **one of the largest content libraries** when Paramount+ launches.\n\nIn addition, it owns a **large library of top-tier proprietary content** including Star Trek, Gossip Girl, Survivor, and Billions. As licensing agreements with distributors and other streaming platforms expire, ViacomCBS will be home to one of the largest proprietary content libraries in the world. At the end of the day, differentiation is king; and **differentiated content attracts and retains customers**.\n\nMore importantly, **proprietary content allows streaming providers to scale their offerings globally**, eliminate distribution fees, and reach consumers directly. Paramount+'s access to a large library of proprietary content (which can be scaled globally without licensing concerns once existing licensing agreements expire) means that Paramount+ has a shot at becoming one of the leading streaming services globally. It is also worth noting that **the number of media assets available for purchase has dwindled over the years** (Lionsgate is one of them). Most have been snapped up by Disney. Whatever scraps are available out there **will not make a big difference to the quality and quantity of proprietary content that existing streaming providers can offer**.\n\n&#x200B;\n\n|Service|US Hours of Content (Proprietary & Licensed)|Notable Content (Proprietary)|Proprietary Content Ranking|\n|:-|:-|:-|:-|\n|Netflix|40,000+ (Est)|House of Cards, The Crown, Stranger Things, Lost in Space, The Umbrella Academy, Grace and Frankie, Orange Is the New Black, Ozark, Bodyguard, My Next Guest Needs No Introduction with David Letterman|2|\n|ViacomCBS: Paramount+ (As of Q1 2021)|30,000 ([Source](https://techcrunch.com/2020/09/15/cbs-all-access-to-rebrand-to-paramount-expand-internationally-in-2021/))|Star Trek, CSI, Gossip Girl, Criminal Mind, Madame Secretary, Amazing Race, Survivor, Twilight Zone, Billions, Colbert Report, 60 Minutes, Dora the Explorer, iCarly, Two and a Half Men|2|\n|Disney: Disney+|20,000+ (Est)|All things Marvel, All things Disney, Star Wars, Scandal, Ugly Betty, The Good Doctor, Quantico, The Muppets, How to Get Away with Murder, Criminal Minds, Empire, Jimmy Kimmel Live, Nightline|1|\n|Amazon Prime Video|20,000+ (Est)|Jack Ryan, Man in the High Castle, Tales from the Loop, Homecoming, The Marvelous Mrs. Maisel, The New Yorker Presents, The Expanse, Bosch|4|\n|Comcast NBCUniversal: Peacock|20,000 ([Source](https://www.cnet.com/news/peacock-tv-free-premium-streaming-app/))|Friends, The Blacklist, This Is Us, Law & Order, Late Night with Jimmy Fallon, Parks and Recreation|4|\n|AT&T Time Warner: HBO Max / HBO Now / HBO Go / AT&T TV / AT&T Now / AT&T WTF I can't differentiate between them all|10,000 ([Source](https://techcrunch.com/2020/04/21/hbo-max-debuts-on-may-27th-with-10000-hours-of-content-including-a-handful-of-originals/))|Game of Thrones, The Sopranos, The Wire, Sex and the City, Succession, Veep, Silicon Valley, Westworld, Industry, His Dark Materials, True Blood|3|\n|Apple TV+|\\~300 (Est) (Sidenote, this is not a streaming service, it's grandma's small AF DVD catalog)|For All Mankind, The Morning Show, Central Park, Snoopy, Oprah's Book Club|No.|\n\n**Concluding Remarks**\n\n**This is not a winner takes all market.** These streaming providers are the cable providers of the 21st century - except they are able to scale and reach an audience that is 20X larger than the cable providers of the 20th century.\n\nIn short, **ViacomCBS checks all the boxes - execution, branding, talent, content, and value.** **It is on track to become one of the top 3 players in the streaming wars and is an extremely good buy today**.", "author_fullname": "t2_9jutqtju", "saved": false, "mod_reason_title": null, "gilded": 1, "clicked": false, "title": "VIAC Bull Case", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kmb3ry", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.76, "author_flair_background_color": null, "subreddit_type": "public", "ups": 20, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": true, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 20, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1609236481.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {"gid_2": 1}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609262537.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>TLDR: Buy VIAC. Potential 10X returns. Large proprietary content library. Great subscription growth numbers. Paramount+ launching globally.</strong></p>\n\n<p>Long time lurker, first-time poster. Was introduced to WSB by a friend and bought GME a few weeks back. Best decision of my life. I&#39;ve just gotten out of GME and am putting all of that cash into ViacomCBS (VIAC). Here&#39;s why I&#39;m extremely bullish about VIAC:</p>\n\n<p><strong>Introduction</strong></p>\n\n<p>The global video streaming industry continues to grow at a staggering pace and <strong>revenues are expected to double over the next 5 years to ~1 Tn</strong>. Few pure-play media assets remain, with surviving firms beginning to explore alternative strategies in the face of disruption. There are <strong>three main trends</strong> currently in the industry:</p>\n\n<ol>\n<li>Merge / acquire downstream (typically with telecoms) (e.g. AT&amp;T / Comcast) and launch DTC offerings</li>\n<li>Launch DTC offerings (e.g. Disney, ViacomCBS) without downstream merger</li>\n<li>Stay the course, seek opportunities for sale (e.g. Lionsgate / Discovery)</li>\n</ol>\n\n<p>The <strong>primary issue with type (1) companies</strong>, in my opinion, is that the <strong>high cost of an LBO / M&amp;A have increased debt levels of companies such as AT&amp;T</strong>. Shareholder inertia coupled with high debt-servicing costs in the long term will translate into <strong>lower content spend</strong> and <strong>higher bankruptcy risks moving forward</strong>.</p>\n\n<p>Yes, interest rates are at an all-time low currently, with the fed pledging to keep them at 0% for the foreseeable future. However, I believe that it would be a mistake if we were to disregard financial frictions increasing debt servicing costs. Banks have already started to tighten loan originations, and consumers are beginning to cut back on retail expenditure. <strong>Falling consumer confidence and consumption, increased asset price dislocations, and likely regulatory failure may precipitate a credit crunch, one not dissimilar to 2008&#39;s subprime crisis.</strong></p>\n\n<p>If I had to bet on which firm would survive the following few years (AT&amp;T / Comcast / ViacomCBS), I&#39;d put my bet on ViacomCBS. <strong>It is important to not simply examine gearing ratios to determine a firm&#39;s liquidity moving forward, but also their inherent cost structures.</strong> All three firms are highly levered. However, unlike AT&amp;T and Comcast, <strong>ViacomCBS is also actively reducing their debt</strong>. Rather than acquiring traditional satellite tv providers (looking at you AT&amp;T), it decided to sell off legacy businesses (e.g. Simon &amp; Schuster). In addition, it is worth noting that the majority of ViacomCBS&#39; debt comes from the acquisition of media IP.</p>\n\n<p>In summary, <strong>ViacomCBS is navigating industry headwinds with relative ease compared to telecom-media companies</strong>. It has an asset-light structure compared to AT&amp;T and Comcast, and is hence <strong>better positioned to move into the digital streaming age</strong>.</p>\n\n<p><strong>Comps</strong></p>\n\n<p><strong>At the moment, VIAC trades more like a traditional media play</strong> (low PE ratio of 8.55). Comparables include Lionsgate (PE: 12.7) and Fox (PE: 10.7). Even when benchmarked against traditional media play comparables, VIAC is undervalued. There is substantial market demand right now for traditional media assets as the streaming wars continue to heat up. <strong>At the very least we would be looking at a 20-30% jump in VIAC if we simply rely on comps analysis.</strong></p>\n\n<p>More importantly, ViacomCBS has been digitalizing and reorganizing themselves to become a streaming giant - more comparable to Netflix (PE: 82.9) and Disney (PE: 86.4). Even Comcast has a PE ratio of 17.7. <strong>Paramount Plus has already launched in certain parts of Europe to great success</strong>and will be <strong>launching in the US and Australasia in 2021 (More on this later)</strong>. Valuing VIAC as a <strong>Content as a Service</strong> play would mean a <strong>potential 10X upside</strong>.</p>\n\n<p><strong>Execution</strong></p>\n\n<p>Extremely robust growth in streaming of <strong>72% YOY</strong>, with <strong>total US subscribers</strong> to Pluto and CBS AA <strong>totaling</strong> <strong>~46M</strong>. This is greater than 50% of <strong><em>Disney+&#39;s global subscription base</em></strong>, and a strong showing given that ViacomCBS has only started focusing on streaming a little over 2 years ago.</p>\n\n<p>ViacomCBS has named <strong>Tom Ryan as their new head of streaming</strong>. Ryan comes from ViacomCBS&#39; acquisition of Pluto, is a <strong>notable figure in the startup and venture capital community,</strong> and has sat at the <strong>convergence of retail and entertainment</strong> over the past few decades. He was formerly affiliated with Trunk Club (retail disruptor acquired by Nordstrom) and Bessemer (one of the valley&#39;s leading VCs). It is <strong>increasingly difficult for large corporates to acquire innovative talent</strong>.</p>\n\n<p>Unlike AT&amp;T, <strong>ViacomCBS understands branding</strong>. Their decision to streamline their streaming services and rebrand them as Paramount+ (which is a relatively visible brand globally) is nothing short of a stroke of marketing genius. Compared to its competitors, it is <strong>building on a brand that has been associated with quality films and TV programming globally</strong>.</p>\n\n<p>What are its competitors doing? <strong>I sure as hell have never heard of Peacock before 2020</strong>. And while HBO is associated with quality programming globally, <strong>AT&amp;T has had substantial brand confusion across its streaming products</strong>. I mean, there is HBO Go, HBO Now, and HBO Max (in addition to a variety of AT&amp;T streaming brands). AT&amp;T&#39;s branding strategy is a complete clusterfuck.</p>\n\n<p><strong>Content</strong></p>\n\n<p>Content is king. More specifically, proprietary content is king. At <strong>30,000+ hours of content</strong>, ViacomCBS will have <strong>one of the largest content libraries</strong> when Paramount+ launches.</p>\n\n<p>In addition, it owns a <strong>large library of top-tier proprietary content</strong> including Star Trek, Gossip Girl, Survivor, and Billions. As licensing agreements with distributors and other streaming platforms expire, ViacomCBS will be home to one of the largest proprietary content libraries in the world. At the end of the day, differentiation is king; and <strong>differentiated content attracts and retains customers</strong>.</p>\n\n<p>More importantly, <strong>proprietary content allows streaming providers to scale their offerings globally</strong>, eliminate distribution fees, and reach consumers directly. Paramount+&#39;s access to a large library of proprietary content (which can be scaled globally without licensing concerns once existing licensing agreements expire) means that Paramount+ has a shot at becoming one of the leading streaming services globally. It is also worth noting that <strong>the number of media assets available for purchase has dwindled over the years</strong> (Lionsgate is one of them). Most have been snapped up by Disney. Whatever scraps are available out there <strong>will not make a big difference to the quality and quantity of proprietary content that existing streaming providers can offer</strong>.</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Service</th>\n<th align=\"left\">US Hours of Content (Proprietary &amp; Licensed)</th>\n<th align=\"left\">Notable Content (Proprietary)</th>\n<th align=\"left\">Proprietary Content Ranking</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">Netflix</td>\n<td align=\"left\">40,000+ (Est)</td>\n<td align=\"left\">House of Cards, The Crown, Stranger Things, Lost in Space, The Umbrella Academy, Grace and Frankie, Orange Is the New Black, Ozark, Bodyguard, My Next Guest Needs No Introduction with David Letterman</td>\n<td align=\"left\">2</td>\n</tr>\n<tr>\n<td align=\"left\">ViacomCBS: Paramount+ (As of Q1 2021)</td>\n<td align=\"left\">30,000 (<a href=\"https://techcrunch.com/2020/09/15/cbs-all-access-to-rebrand-to-paramount-expand-internationally-in-2021/\">Source</a>)</td>\n<td align=\"left\">Star Trek, CSI, Gossip Girl, Criminal Mind, Madame Secretary, Amazing Race, Survivor, Twilight Zone, Billions, Colbert Report, 60 Minutes, Dora the Explorer, iCarly, Two and a Half Men</td>\n<td align=\"left\">2</td>\n</tr>\n<tr>\n<td align=\"left\">Disney: Disney+</td>\n<td align=\"left\">20,000+ (Est)</td>\n<td align=\"left\">All things Marvel, All things Disney, Star Wars, Scandal, Ugly Betty, The Good Doctor, Quantico, The Muppets, How to Get Away with Murder, Criminal Minds, Empire, Jimmy Kimmel Live, Nightline</td>\n<td align=\"left\">1</td>\n</tr>\n<tr>\n<td align=\"left\">Amazon Prime Video</td>\n<td align=\"left\">20,000+ (Est)</td>\n<td align=\"left\">Jack Ryan, Man in the High Castle, Tales from the Loop, Homecoming, The Marvelous Mrs. Maisel, The New Yorker Presents, The Expanse, Bosch</td>\n<td align=\"left\">4</td>\n</tr>\n<tr>\n<td align=\"left\">Comcast NBCUniversal: Peacock</td>\n<td align=\"left\">20,000 (<a href=\"https://www.cnet.com/news/peacock-tv-free-premium-streaming-app/\">Source</a>)</td>\n<td align=\"left\">Friends, The Blacklist, This Is Us, Law &amp; Order, Late Night with Jimmy Fallon, Parks and Recreation</td>\n<td align=\"left\">4</td>\n</tr>\n<tr>\n<td align=\"left\">AT&amp;T Time Warner: HBO Max / HBO Now / HBO Go / AT&amp;T TV / AT&amp;T Now / AT&amp;T WTF I can&#39;t differentiate between them all</td>\n<td align=\"left\">10,000 (<a href=\"https://techcrunch.com/2020/04/21/hbo-max-debuts-on-may-27th-with-10000-hours-of-content-including-a-handful-of-originals/\">Source</a>)</td>\n<td align=\"left\">Game of Thrones, The Sopranos, The Wire, Sex and the City, Succession, Veep, Silicon Valley, Westworld, Industry, His Dark Materials, True Blood</td>\n<td align=\"left\">3</td>\n</tr>\n<tr>\n<td align=\"left\">Apple TV+</td>\n<td align=\"left\">~300 (Est) (Sidenote, this is not a streaming service, it&#39;s grandma&#39;s small AF DVD catalog)</td>\n<td align=\"left\">For All Mankind, The Morning Show, Central Park, Snoopy, Oprah&#39;s Book Club</td>\n<td align=\"left\">No.</td>\n</tr>\n</tbody></table>\n\n<p><strong>Concluding Remarks</strong></p>\n\n<p><strong>This is not a winner takes all market.</strong> These streaming providers are the cable providers of the 21st century - except they are able to scale and reach an audience that is 20X larger than the cable providers of the 20th century.</p>\n\n<p>In short, <strong>ViacomCBS checks all the boxes - execution, branding, talent, content, and value.</strong> <strong>It is on track to become one of the top 3 players in the streaming wars and is an extremely good buy today</strong>.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/4EzRQzMGi-I1V2P7wu8mbz0wmvn5JLUD7fmLl3yRusY.jpg?auto=webp&s=97dafcbffed2f41c2097fd8ac1767fcaf482fb1d", "width": 711, "height": 400}, "resolutions": [{"url": "https://external-preview.redd.it/4EzRQzMGi-I1V2P7wu8mbz0wmvn5JLUD7fmLl3yRusY.jpg?width=108&crop=smart&auto=webp&s=5fe8816125355843a50e731bc84c89f23559d923", "width": 108, "height": 60}, {"url": "https://external-preview.redd.it/4EzRQzMGi-I1V2P7wu8mbz0wmvn5JLUD7fmLl3yRusY.jpg?width=216&crop=smart&auto=webp&s=dfe48f08e913d22bd64eef4f1e736949ae788e03", "width": 216, "height": 121}, {"url": "https://external-preview.redd.it/4EzRQzMGi-I1V2P7wu8mbz0wmvn5JLUD7fmLl3yRusY.jpg?width=320&crop=smart&auto=webp&s=902298a7bfb4ab264ac0ce34b5082897f3d4a4a9", "width": 320, "height": 180}, {"url": "https://external-preview.redd.it/4EzRQzMGi-I1V2P7wu8mbz0wmvn5JLUD7fmLl3yRusY.jpg?width=640&crop=smart&auto=webp&s=b5df7b3f21483d46956968e6c5344036d0b2ec7e", "width": 640, "height": 360}], "variants": {}, "id": "RYQshReNtMp1X4xz8wncewHiKW-iTldVUobIJtcHtqU"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 500, "id": "gid_2", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 100, "icon_url": "https://www.redditstatic.com/gold/awards/icon/gold_512.png", "days_of_premium": 7, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/gold_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Gives 100 Reddit Coins and a week of r/lounge access and ad-free browsing.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Gold", "resized_static_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/gold_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/gold_128.png", "width": 128, "height": 128}], "icon_format": null, "icon_height": 512, "penny_price": null, "award_type": "global", "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/gold_512.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kmb3ry", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "Bulky-Mountain8854", "fullname": "t2_9jutqtju"}, "discussion_type": null, "num_comments": 19, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kmb3ry/viac_bull_case/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kmb3ry/viac_bull_case/", "subreddit_subscribers": 1751031, "created_utc": 1609233737.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 13, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kmb3ry", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghdxnzq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "waffleboy92", "fullname": "t2_injsd"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kmb3ry", "score": 13, "author_fullname": "t2_injsd", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Brand new account, I'd take with a grain of salt no matter how good the DD is.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Brand new account, I&#39;d take with a grain of salt no matter how good the DD is.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kmb3ry/viac_bull_case/ghdxnzq/", "num_reports": null, "locked": false, "name": "t1_ghdxnzq", "created": 1609273543.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609244743.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 13, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kmb3ry", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghdojhb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "jackofspades123", "fullname": "t2_i5pb6"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kmb3ry", "score": 13, "author_fullname": "t2_i5pb6", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "While they may be undervalued,  I don't think you can say they are marketing geniuses. The branding is a consequence of needing to attract a younger audience. \n\n\nI've added this to my watch list", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>While they may be undervalued,  I don&#39;t think you can say they are marketing geniuses. The branding is a consequence of needing to attract a younger audience. </p>\n\n<p>I&#39;ve added this to my watch list</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kmb3ry/viac_bull_case/ghdojhb/", "num_reports": null, "locked": false, "name": "t1_ghdojhb", "created": 1609264024.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609235224.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 12, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kmb3ry", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "ghdnp6x", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kmb3ry", "score": 12, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Gotcha OP, not sure why automod didn't like your post.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Gotcha OP, not sure why automod didn&#39;t like your post.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kmb3ry/viac_bull_case/ghdnp6x/", "num_reports": null, "locked": false, "name": "t1_ghdnp6x", "created": 1609263113.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "created_utc": 1609234313.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}