{"approved_at_utc": null, "selftext": "**Today will be the last day you can trade Tesla before it enters the SP500. FedEx crushed earnings but still dropped as investors looked for guidance. What to expect from Nike after the close? Let’s talk about this and other stock market news**\n\n**\\~Very Long Post\\~**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday, as we saw another great day for the stock market with the [Nasdaq Composite](https://ibb.co/vQZKh9Y) leading the way up 0.84%, the broad market [SP500](https://ibb.co/r2K5TXj) also up 0.58% and the [Dow Industrial](https://ibb.co/j5MYhLG) up almost half a percent, as all 3 big indexes closed at new a record high. We also saw de [VIX](https://ibb.co/P6dnhX7) dropping below 22, as it dropped 2.5%.\n\nAlmost 2/3 of the [companies](https://ibb.co/SsV2KG6) were advancing yesterday with over 200 new highs on average volume, as 9 of the 11 [sectors](https://ibb.co/yhc1562) in the SP500 were in the green with only energy and communications losing ground for the day, as small and mid-caps outperformed [yesterday](https://ibb.co/g7zCvs9) while large-caps were flat for the day.\n\nYou can see in this [HEAT MAP](https://ibb.co/bdFGb96) that yesterday was a good day for most of the stock market, while only a couple of companies lost significant ground like Boeing, AT&T and Google, while Tesla rose again ahead of the SP500 inclusion.\n\nImportant economic data also came in, as initial jobless [claims](https://ibb.co/dJQv6d0) rose even more from the previous week by more than 20k, while the continuing jobless claims fell to 5.5M, lower than expected and the last week number. I think it is possible we can see the initial claims jump to over 900K in the next weeks as the economy feels more pressure from the rising cases numbers and more restrictions.\n\nMeanwhile, we also got the December Kansas City FED [INDEX](https://ibb.co/L6zW9Zp) reading, that came in at +14, above the estimates and the numbers from November. But this is still more than 10 points down from last year’s reading, while the Philly Fed [outlook](https://ibb.co/LJwCCpT) came in worse than expected and last month’s reading.\n\nWe also got numbers from November housing [starts](https://ibb.co/jvcyWyV), as this came in with a more than 1% increase month over month, bigger than expected, as building permits also jumped more than 6% to over 1.6M.\n\nWhile [TODAY](https://ibb.co/2hMmxy3) there is not a lot of important economic data that will come in, as the outlook for the economy remains very uncertain at the moment, as the economy needs to survive until enough people get the shot so we can reach herd immunity, which will allow business to come back again, as restrictions will go away.\n\nWe also saw Moderna receive the [FDA](https://ibb.co/fqC4Qys) Ad Com endorse the vaccine with a 20 to 0 vote and 1 abstention.\n\nSo, today is a big day, today is quadruple witching day and also the last day that Tesla is not included in the SP500. It’s [expected](https://ibb.co/ZVQ9MRR) that there will be over $80B worth of shares trading hands today, as they will become the most valuable company ever to enter the main index on Wall Street. This will also force index-tracking funds and money managers to buy Tesla shares to correctly reflect the index, while also selling positions in other companies that are part of the SP, as Tesla will account for over 1% of the index starting Monday.\n\nMeanwhile, the company also just received an [upgrade](https://ibb.co/mHnpZHb) on its crediting rating from S&P Global ratings as they noted that Tesla’s net debt is essentially zero based on key metric, DEBT to EBITDA.\n\nSo, expect some massive volume to be traded in Tesla in the final minutes before the close today, Tesla is already the most traded [stock](https://ibb.co/1XZ58xj) on Wall Street and has surged more than 50% since the SP news came out. I think either outcome is possible as we can see either the stock heading to new highs or see a decent correction if bears prevail. Just watch out for the closing of the session today.\n\nThis is will be key moment for the stock market, with the FED also coming out today with the latest round of stress [tests](https://ibb.co/26CZDCh) for the banks. I don’t expect any surprises coming from here, as they were found to be able to weather big capital losses last time around in the summer.\n\nIn some other stock market news, [FedEx](https://ibb.co/ZVmggDG) delivered great earnings results, delivering a beat of more than 80 cents on EPS, while it also saw a bigger increase in revenue than expected, with a more than $1B beat and the operating margin coming in pretty much as expected.\n\nThe net income and earnings per share more than [doubled](https://ibb.co/vV7FTbv) since last year after rate hikes and spiking volume from e-commerce shipments, as the company has seen a boom alongside the e-commerce growth. But this was not enough to help the stock, as it dropped 3% in after-hours, as the lack of a formal guidance kind of disappointed investors, as they did not offer an improved [outlook](https://ibb.co/C1LFVDf) for FY2021 and the capital spending is still expected to surpass $5B.\n\nWhile today we also get [Nike](https://ibb.co/s15BfJH) earnings after the close, as the company is expected to have a lower EPS than last year, but to increase the revenues by more than 1%. Nike is a great company and the world largest sportswear company, and I expect them to deliver on these expectations as its digital strategy is offsetting much of the lost retail sales after massive investments in technology that are transforming its business.\n\nSome expected [news](https://ibb.co/qMs6xv5) also came in from Coca-Cola as they will cut more than 1K jobs in the US and more than 2K worldwide. This is another move that is looking to improve the efficiency of the company, as they have been hit alongside the restaurant business.\n\nWhile Doordash fell [yesterday](https://ibb.co/LCdsSN1), after the short sellers from citron research called it the most ridiculous IPO of the year, giving the company a Price Target of $40. I usually don’t agree with such drops after short sellers make some statements or publish something, this is a common-used tactic by them, they get into a stock and publish a report that sees the stock plunge as the make money. But I kind of have to agree with them on this one, the valuation for Doordash is just ridiculous, but I don’t see it going down that much…\n\nIn comparison, investors seem to like [ABNB](https://ibb.co/F47f56X) somewhat more than DASH, as AirBNB traded higher, but still has a ridiculous valuation, bigger the BP, FedEx or even Deere, despite negative margins with more competition and new lawsuits from different cities in the world.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Tesla’s SP 500 Moment | FedEx & Nike Earnings | Stock Market News Today [12-18]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_kfk8dm", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.94, "author_flair_background_color": null, "subreddit_type": "public", "ups": 24, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 24, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1608323294.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Today will be the last day you can trade Tesla before it enters the SP500. FedEx crushed earnings but still dropped as investors looked for guidance. What to expect from Nike after the close? Let’s talk about this and other stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday, as we saw another great day for the stock market with the <a href=\"https://ibb.co/vQZKh9Y\">Nasdaq Composite</a> leading the way up 0.84%, the broad market <a href=\"https://ibb.co/r2K5TXj\">SP500</a> also up 0.58% and the <a href=\"https://ibb.co/j5MYhLG\">Dow Industrial</a> up almost half a percent, as all 3 big indexes closed at new a record high. We also saw de <a href=\"https://ibb.co/P6dnhX7\">VIX</a> dropping below 22, as it dropped 2.5%.</p>\n\n<p>Almost 2/3 of the <a href=\"https://ibb.co/SsV2KG6\">companies</a> were advancing yesterday with over 200 new highs on average volume, as 9 of the 11 <a href=\"https://ibb.co/yhc1562\">sectors</a> in the SP500 were in the green with only energy and communications losing ground for the day, as small and mid-caps outperformed <a href=\"https://ibb.co/g7zCvs9\">yesterday</a> while large-caps were flat for the day.</p>\n\n<p>You can see in this <a href=\"https://ibb.co/bdFGb96\">HEAT MAP</a> that yesterday was a good day for most of the stock market, while only a couple of companies lost significant ground like Boeing, AT&amp;T and Google, while Tesla rose again ahead of the SP500 inclusion.</p>\n\n<p>Important economic data also came in, as initial jobless <a href=\"https://ibb.co/dJQv6d0\">claims</a> rose even more from the previous week by more than 20k, while the continuing jobless claims fell to 5.5M, lower than expected and the last week number. I think it is possible we can see the initial claims jump to over 900K in the next weeks as the economy feels more pressure from the rising cases numbers and more restrictions.</p>\n\n<p>Meanwhile, we also got the December Kansas City FED <a href=\"https://ibb.co/L6zW9Zp\">INDEX</a> reading, that came in at +14, above the estimates and the numbers from November. But this is still more than 10 points down from last year’s reading, while the Philly Fed <a href=\"https://ibb.co/LJwCCpT\">outlook</a> came in worse than expected and last month’s reading.</p>\n\n<p>We also got numbers from November housing <a href=\"https://ibb.co/jvcyWyV\">starts</a>, as this came in with a more than 1% increase month over month, bigger than expected, as building permits also jumped more than 6% to over 1.6M.</p>\n\n<p>While <a href=\"https://ibb.co/2hMmxy3\">TODAY</a> there is not a lot of important economic data that will come in, as the outlook for the economy remains very uncertain at the moment, as the economy needs to survive until enough people get the shot so we can reach herd immunity, which will allow business to come back again, as restrictions will go away.</p>\n\n<p>We also saw Moderna receive the <a href=\"https://ibb.co/fqC4Qys\">FDA</a> Ad Com endorse the vaccine with a 20 to 0 vote and 1 abstention.</p>\n\n<p>So, today is a big day, today is quadruple witching day and also the last day that Tesla is not included in the SP500. It’s <a href=\"https://ibb.co/ZVQ9MRR\">expected</a> that there will be over $80B worth of shares trading hands today, as they will become the most valuable company ever to enter the main index on Wall Street. This will also force index-tracking funds and money managers to buy Tesla shares to correctly reflect the index, while also selling positions in other companies that are part of the SP, as Tesla will account for over 1% of the index starting Monday.</p>\n\n<p>Meanwhile, the company also just received an <a href=\"https://ibb.co/mHnpZHb\">upgrade</a> on its crediting rating from S&amp;P Global ratings as they noted that Tesla’s net debt is essentially zero based on key metric, DEBT to EBITDA.</p>\n\n<p>So, expect some massive volume to be traded in Tesla in the final minutes before the close today, Tesla is already the most traded <a href=\"https://ibb.co/1XZ58xj\">stock</a> on Wall Street and has surged more than 50% since the SP news came out. I think either outcome is possible as we can see either the stock heading to new highs or see a decent correction if bears prevail. Just watch out for the closing of the session today.</p>\n\n<p>This is will be key moment for the stock market, with the FED also coming out today with the latest round of stress <a href=\"https://ibb.co/26CZDCh\">tests</a> for the banks. I don’t expect any surprises coming from here, as they were found to be able to weather big capital losses last time around in the summer.</p>\n\n<p>In some other stock market news, <a href=\"https://ibb.co/ZVmggDG\">FedEx</a> delivered great earnings results, delivering a beat of more than 80 cents on EPS, while it also saw a bigger increase in revenue than expected, with a more than $1B beat and the operating margin coming in pretty much as expected.</p>\n\n<p>The net income and earnings per share more than <a href=\"https://ibb.co/vV7FTbv\">doubled</a> since last year after rate hikes and spiking volume from e-commerce shipments, as the company has seen a boom alongside the e-commerce growth. But this was not enough to help the stock, as it dropped 3% in after-hours, as the lack of a formal guidance kind of disappointed investors, as they did not offer an improved <a href=\"https://ibb.co/C1LFVDf\">outlook</a> for FY2021 and the capital spending is still expected to surpass $5B.</p>\n\n<p>While today we also get <a href=\"https://ibb.co/s15BfJH\">Nike</a> earnings after the close, as the company is expected to have a lower EPS than last year, but to increase the revenues by more than 1%. Nike is a great company and the world largest sportswear company, and I expect them to deliver on these expectations as its digital strategy is offsetting much of the lost retail sales after massive investments in technology that are transforming its business.</p>\n\n<p>Some expected <a href=\"https://ibb.co/qMs6xv5\">news</a> also came in from Coca-Cola as they will cut more than 1K jobs in the US and more than 2K worldwide. This is another move that is looking to improve the efficiency of the company, as they have been hit alongside the restaurant business.</p>\n\n<p>While Doordash fell <a href=\"https://ibb.co/LCdsSN1\">yesterday</a>, after the short sellers from citron research called it the most ridiculous IPO of the year, giving the company a Price Target of $40. I usually don’t agree with such drops after short sellers make some statements or publish something, this is a common-used tactic by them, they get into a stock and publish a report that sees the stock plunge as the make money. But I kind of have to agree with them on this one, the valuation for Doordash is just ridiculous, but I don’t see it going down that much…</p>\n\n<p>In comparison, investors seem to like <a href=\"https://ibb.co/F47f56X\">ABNB</a> somewhat more than DASH, as AirBNB traded higher, but still has a ridiculous valuation, bigger the BP, FedEx or even Deere, despite negative margins with more competition and new lawsuits from different cities in the world.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/IeN1wVWE7S_2qy6w_pnSYO0IUlE-j7oWm65WmLEvfXk.jpg?auto=webp&s=4fb67c833bb334cba1f8922c7dc27d9a28e6ce64", "width": 887, "height": 470}, "resolutions": [{"url": "https://external-preview.redd.it/IeN1wVWE7S_2qy6w_pnSYO0IUlE-j7oWm65WmLEvfXk.jpg?width=108&crop=smart&auto=webp&s=49b489e32db5111abf5c13cdcf257dbab7682897", "width": 108, "height": 57}, {"url": "https://external-preview.redd.it/IeN1wVWE7S_2qy6w_pnSYO0IUlE-j7oWm65WmLEvfXk.jpg?width=216&crop=smart&auto=webp&s=4ee74cd57b149998ace53d029346fbeb90aab28c", "width": 216, "height": 114}, {"url": "https://external-preview.redd.it/IeN1wVWE7S_2qy6w_pnSYO0IUlE-j7oWm65WmLEvfXk.jpg?width=320&crop=smart&auto=webp&s=870607784857ff427366f8926c3e6904e8ecdb41", "width": 320, "height": 169}, {"url": "https://external-preview.redd.it/IeN1wVWE7S_2qy6w_pnSYO0IUlE-j7oWm65WmLEvfXk.jpg?width=640&crop=smart&auto=webp&s=c323fc4e8b605146db4d964c4ad6402e0703be69", "width": 640, "height": 339}], "variants": {}, "id": "oYfuBRizDnJFiKNqg5Ak7LaYbVJ6v6cXrtIwO2SgZuU"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kfk8dm", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 14, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/", "subreddit_subscribers": 1715131, "created_utc": 1608294494.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8tutu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kfk8dm", "score": 4, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": " \\~Tl;dr\\~ Long NKE & FDX, Short DASH", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>~Tl;dr~ Long NKE &amp; FDX, Short DASH</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8tutu/", "num_reports": null, "locked": false, "name": "t1_gg8tutu", "created": 1608323300.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608294500.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8xi8j", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "LETS--GET--SCHWIFTY", "fullname": "t2_8dikhoa"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gg8tutu", "score": 4, "author_fullname": "t2_8dikhoa", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "This is what I was looking for. I’m in🚀", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This is what I was looking for. I’m in🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8xi8j/", "num_reports": null, "locked": false, "name": "t1_gg8xi8j", "created": 1608326113.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608297313.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8vv5y", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "jacobpetrie1", "fullname": "t2_54dsmfeg"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kfk8dm", "score": 4, "author_fullname": "t2_54dsmfeg", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I wil buy TSLA 12/18c at approx 3:51 toda", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I wil buy TSLA 12/18c at approx 3:51 toda</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8vv5y/", "num_reports": null, "locked": false, "name": "t1_gg8vv5y", "created": 1608324893.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608296093.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8x4u5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gg8vv5y", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "GLGLGL", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>GLGLGL</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8x4u5/", "num_reports": null, "locked": false, "name": "t1_gg8x4u5", "created": 1608325843.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608297043.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8x2g4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "accountingsavage10", "fullname": "t2_wrly511"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kfk8dm", "score": 3, "author_fullname": "t2_wrly511", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Chimpu is that you??", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Chimpu is that you??</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8x2g4/", "num_reports": null, "locked": false, "name": "t1_gg8x2g4", "created": 1608325794.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608296994.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kfk8dm", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg8x826", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gg8x2g4", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "No... not chimpu", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No... not chimpu</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kfk8dm/teslas_sp_500_moment_fedex_nike_earnings_stock/gg8x826/", "num_reports": null, "locked": false, "name": "t1_gg8x826", "created": 1608325908.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608297108.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}