{"approved_at_utc": null, "selftext": "* **WTF is SGMO?** Still the most drastically undervalued gene therapy company on the market. Launch sequence already started, and it’s still wicked undervalued.\n\n&#x200B;\n\n* **How undervalued is SGMO?** I’m copying an *updated* valuation table from my first article, published last Sunday 12/20/20. Here’s that article in case you want more fundamental explanation of SGMO: [First SGMO DD Article](https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&utm_medium=ios_app&utm_name=iossmf__;!!Cjnu1T6GFXg!8oz9onn85pCSDC3gf9hR6p84b7kPdrharEB6YcEeW8boxiiLh2kl6c0qrTf0VV_U52QYiQ2x0A$)\n\nThen, the stock price was 14.32. This week, it touched $18.48 and closed at $17.81 on Friday. A month ago it was $9.44…\n\n&#x200B;\n\n|Ticker|Market Cap|\n|:-|:-|\n|BMRN|16 B|\n|CRSP|12 B|\n|EDIT|5.21 B|\n|ONCE|Acquired for 4B for 1 approved therapy|\n|NTLA|3.67 B|\n|SGMO|2.52 B|\n\n&#x200B;\n\nAt these prices it should go up another 31% to be fairly valued with the next company on the list that would basically be a hairy guy in an inner tube compared to the SGMO yacht. \n\n&#x200B;\n\n* **Want a real SGMO vs EDIT valuation by an actual professional?** Here ya go: [SGMO vs EDIT valuation thread](https://twitter.com/mchilberg/status/1343189009095217152?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet)\n\nAlso, SGMO's lead candidate for hemophilia (currently Phase 3 trial partnered with Pfizer) has better data than BMRN’s, so imho it should be worth AT LEAST 6x where it is at right now, and that’s excluding the fact that SGMO has partnerships with Pfizer, Takeda, Biogen, Kite, Sanofi and Novartis, in addition to 7 wholly-owned programs. That gives us a grand total of 18 lottery tickets at the moment: [https://www.sangamo.com/pipeline](https://www.sangamo.com/pipeline)\n\n&#x200B;\n\n* **Why the hell are you comparing SGMO with CRSP?** You’ve probably heard of CRSPR but never heard of SGMO. Doesn’t fucking matter, because… PATENTS. CRSPR tech got a lot of attention and press in its early days, mostly from a Radiolab episode and then lots of follow-up news stories. It’s used a lot of places for research because it's cheap and widely available... and that’s the whole problem. So many institutions use CRSPR and publish improvements and modifications to the technique/process that the legal landscape is a goddamn patent quagmire (giggity).\n\n&#x200B;\n\n* **Don’t believe me that CRSP’s patent game is weaksauce?** Check out this link: [Crispr patents by institution.](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153484&pt=msg&mid=21490140) It has a 2019 table put out by IPlytics showing the # of crispr patents owned by different companies/institutions.\n\nThe first two companies are big agra.\n\nThe next 4 are UCSF, Harvard, MIT, and UPenn.\n\nRight after that is SGMO.\n\nCRSP isn’t even on the goddamn map.\n\n&#x200B;\n\n* **So SGMO owns the patents covering some of the IP CRSP is trying to use?** YES FUCKING YES \\*bangs table\\*. At least they sure AF do for this one covering BCL11A promotor genes: [https://www.investorvillage.com/smbd.asp?mb=1933&mn=153565&pt=msg&mid=21490140](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153565&pt=msg&mid=21490140)\n\n&#x200B;\n\n* **What’s a BCL11A promotor gene?** I highly doubt at anyone really gives a shit, but it is a nucleotide strand that causes increased expression of genetic material following its locus in a DNA strand. If you can target insertion of it “in front of” the gene you want to express (maybe genetic material encoding clotting factor in hemophilia) it ramps up expression of the subsequent gene. It doesn’t really matter. What does matter is that SGMO has a shiny new patent on it and CRSP is going to get taken to town (and not to have a lovely date at Olive Garden) by all the other IP departments of universities and SGMO if they ever manage to get a therapy approved.\n\n&#x200B;\n\n* **Rake, no big pharma company would be so stupid that they marketed a therapy covered by another company’s patent, right????** Well, Merck had to pay Bristol-Myers Squibb a one-time settlement of 625 million and subsequent sales royalties of 6.5 percent the first 5 years to market, and 2.5 percent the next 2 years on market for Keytruda (pembrolizumab) because BMS had IP protection on the use of anti-PD-1 antibodies.\n\n&#x200B;\n\n* **That must’ve been a one-off screw up, right?** Unfortunately not. Kite had to pay Memorial Sloan Kettering Cancer Center 752 million for IP infringement surrounding Yescarta. That was after Gilead paid 11.9 billion to acquire Kite.\n\nBoth patent disasters are detailed in this IV article: [https://www.investorvillage.com/smbd.asp?mb=1933&mn=153598&pt=msg&mid=21490140](https://www.investorvillage.com/smbd.asp?mb=1933&mn=153598&pt=msg&mid=21490140)\n\n&#x200B;\n\n* **Of note, SGMO’s proprietary gene-editing technology, Zinc-finger-nucleases, are wholly owned proprietary tech.** And it has [better precision and specificity than CRSPR](https://t.co/uKtI6vrAeb__;!!Cjnu1T6GFXg!6oZ04-OqlWutwVsIdNAOAKQ-IlWoIkV_CL4WnJbLO1Q-WZ02b883DiQUGphgBOdnxRvphNk3Wg$).\n\n&#x200B;\n\n* **Why are they letting CRSP develop the tech and bring it to market?** You make more money that way? Patent trolling is pretty reprehensible, but if you can just let someone else put in all the money for development and clinical trials and marketing and FDA approval, then just sue them for royalties, you’re going to make a shit ton more than if you did the upfront work yourself.\n\n&#x200B;\n\n* **You mentioned ARKG?** Yeah, because SGMO isn’t included in it yet. But Takeda and Novartis (both partnered with SGMO) are. There is suspicion SGMO might make an appearance on the list soon because it’s massively undervalued, and it would only make sense to shift profits from all the other gene-therapy hockey-stick runups this year to diversify and invest in something with room to run. Don’t take it from me, [this analyst](https://www.linkedin.com/in/jo-mama-7774ba1bb) believes SGMO is a prime choice for inclusion in ARKG. If you reviewed his linked in profile you might be interested to know he also is overweight on DEEZ with an upside target of $69.\n\nGot eem aside, if SGMO is included in ARKG it will experience a wicked bump in price just the like ARKG holding that has a low market cap and banned ticker that farms genetically modified salmon. They were at about $3-$4 a share for a loooooong time before ARKG inclusion and have since rocketed to a new normal of $9-$10 a share. The ticker starts with an “A” and ends with a “B” and theres a “Q” in the middle if you want to peep some hot price action.\n\nHonestly, from what I can tell, it's mostly rumors at this point, but I highly doubt Our Lady of Gains Cathie Wood would not dip her toes in the SGMO pool.\n\n&#x200B;\n\n* **Shouldn’t funds like ARKG already know about SGMO?** I suspect they do, but way more importantly all the big pharma partners I mentioned earlier do. I said it before and I’ll say it again- those guys know a hell of a lot more than I do about what works, and it’s probably the main crux of my thesis.\n\nUnless SGMO’s CEO Sandy Macrae is Elizabeth Holmes 2.0 and this is a hilarious Sangameranos situation where I lose most of my retirement, things are looking pretty goddamn rosy.\n\nAnd trust me, Sandy Macrae is nowhere near the level of charismatic as Elizabeth Holmes is. Excellent CEO, strong clinician focused on safety first, able to turn this company into a powerhouse through acquisitions (TxCell) and partnerships- yes. Charismatic, kinda hot with crazy eyes and deep Venture Brothers [Dr. Girlfriend](https://youtu.be/2rs7VVjz5A8__;!!Cjnu1T6GFXg!__RIcIDFTSmG7OdGlGLgvdEQh3gV5d43LeHXCqDyyIjUP28_p4pbc2G9jmchEUBAjRHnzHT4LA$) dominatrix voice like Mrs. Holmes- nope, not even close. Listening to this guy talk is like watching paint dry while you’re stuck in an elevator someone farted in, so I’m assuming he must actually be peddling something good. Macrae is selling the STEAK, not the SIZZLE.\n\n&#x200B;\n\n* **You seem to link a lot of IV articles, what’s up with that?** I’m just trying to distill down the important points for my fellow autists riding the short bus with me. PS, if my boy bct1192 from IV is reading this- much love, and know that “undiagnosed autist” is a strong compliment in the parlance of this forum.\n\n&#x200B;\n\n* **Legit stacks? For real-real? Lunar Tendies?** Trust, WSB fam. I posted a YOLO screenshot in my first article before the pop this week, it was more than 51% of my IRA, and that’s just one of my 5 investment accounts.\n\n**TL;DR summary**\\- SGMO undervalued, owns the patents to CRSP. SGMO stock price should go up 4x to be equivalent market cap.\n\n**TL;DR Investment moves**\\- **Buy SGMO shares** since they are still relatively cheap, otherwise LEAP calls like **Jan ’22 $25 strike**. I say leaps because it's going to take off, but I'm not miss Cleo, you can't call me now, and I don't know when share price will go up. I don't want my bros losing out on a short-dated disaster. My conservative target price is $25 by EOY ’21. Long term target price $45 by EOY ’23 (following hemophilia A approval with Pfizer).", "author_fullname": "t2_25mas57u", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "SGMO DD- Crispr Patents, valuation, and ARKG", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_klfpgo", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 35, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 35, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1609170261.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609145974.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><ul>\n<li><strong>WTF is SGMO?</strong> Still the most drastically undervalued gene therapy company on the market. Launch sequence already started, and it’s still wicked undervalued.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>How undervalued is SGMO?</strong> I’m copying an <em>updated</em> valuation table from my first article, published last Sunday 12/20/20. Here’s that article in case you want more fundamental explanation of SGMO: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kh7x4x/sgmo_investment_thesis_full_dd/?utm_source=share&amp;utm_medium=ios_app&amp;utm_name=iossmf__;!!Cjnu1T6GFXg!8oz9onn85pCSDC3gf9hR6p84b7kPdrharEB6YcEeW8boxiiLh2kl6c0qrTf0VV_U52QYiQ2x0A$\">First SGMO DD Article</a></li>\n</ul>\n\n<p>Then, the stock price was 14.32. This week, it touched $18.48 and closed at $17.81 on Friday. A month ago it was $9.44…</p>\n\n<p>&#x200B;</p>\n\n<table><thead>\n<tr>\n<th align=\"left\">Ticker</th>\n<th align=\"left\">Market Cap</th>\n</tr>\n</thead><tbody>\n<tr>\n<td align=\"left\">BMRN</td>\n<td align=\"left\">16 B</td>\n</tr>\n<tr>\n<td align=\"left\">CRSP</td>\n<td align=\"left\">12 B</td>\n</tr>\n<tr>\n<td align=\"left\">EDIT</td>\n<td align=\"left\">5.21 B</td>\n</tr>\n<tr>\n<td align=\"left\">ONCE</td>\n<td align=\"left\">Acquired for 4B for 1 approved therapy</td>\n</tr>\n<tr>\n<td align=\"left\">NTLA</td>\n<td align=\"left\">3.67 B</td>\n</tr>\n<tr>\n<td align=\"left\">SGMO</td>\n<td align=\"left\">2.52 B</td>\n</tr>\n</tbody></table>\n\n<p>&#x200B;</p>\n\n<p>At these prices it should go up another 31% to be fairly valued with the next company on the list that would basically be a hairy guy in an inner tube compared to the SGMO yacht. </p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Want a real SGMO vs EDIT valuation by an actual professional?</strong> Here ya go: <a href=\"https://twitter.com/mchilberg/status/1343189009095217152?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet\">SGMO vs EDIT valuation thread</a></li>\n</ul>\n\n<p>Also, SGMO&#39;s lead candidate for hemophilia (currently Phase 3 trial partnered with Pfizer) has better data than BMRN’s, so imho it should be worth AT LEAST 6x where it is at right now, and that’s excluding the fact that SGMO has partnerships with Pfizer, Takeda, Biogen, Kite, Sanofi and Novartis, in addition to 7 wholly-owned programs. That gives us a grand total of 18 lottery tickets at the moment: <a href=\"https://www.sangamo.com/pipeline\">https://www.sangamo.com/pipeline</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Why the hell are you comparing SGMO with CRSP?</strong> You’ve probably heard of CRSPR but never heard of SGMO. Doesn’t fucking matter, because… PATENTS. CRSPR tech got a lot of attention and press in its early days, mostly from a Radiolab episode and then lots of follow-up news stories. It’s used a lot of places for research because it&#39;s cheap and widely available... and that’s the whole problem. So many institutions use CRSPR and publish improvements and modifications to the technique/process that the legal landscape is a goddamn patent quagmire (giggity).</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Don’t believe me that CRSP’s patent game is weaksauce?</strong> Check out this link: <a href=\"https://www.investorvillage.com/smbd.asp?mb=1933&amp;mn=153484&amp;pt=msg&amp;mid=21490140\">Crispr patents by institution.</a> It has a 2019 table put out by IPlytics showing the # of crispr patents owned by different companies/institutions.</li>\n</ul>\n\n<p>The first two companies are big agra.</p>\n\n<p>The next 4 are UCSF, Harvard, MIT, and UPenn.</p>\n\n<p>Right after that is SGMO.</p>\n\n<p>CRSP isn’t even on the goddamn map.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>So SGMO owns the patents covering some of the IP CRSP is trying to use?</strong> YES FUCKING YES *bangs table*. At least they sure AF do for this one covering BCL11A promotor genes: <a href=\"https://www.investorvillage.com/smbd.asp?mb=1933&amp;mn=153565&amp;pt=msg&amp;mid=21490140\">https://www.investorvillage.com/smbd.asp?mb=1933&amp;mn=153565&amp;pt=msg&amp;mid=21490140</a></li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>What’s a BCL11A promotor gene?</strong> I highly doubt at anyone really gives a shit, but it is a nucleotide strand that causes increased expression of genetic material following its locus in a DNA strand. If you can target insertion of it “in front of” the gene you want to express (maybe genetic material encoding clotting factor in hemophilia) it ramps up expression of the subsequent gene. It doesn’t really matter. What does matter is that SGMO has a shiny new patent on it and CRSP is going to get taken to town (and not to have a lovely date at Olive Garden) by all the other IP departments of universities and SGMO if they ever manage to get a therapy approved.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Rake, no big pharma company would be so stupid that they marketed a therapy covered by another company’s patent, right????</strong> Well, Merck had to pay Bristol-Myers Squibb a one-time settlement of 625 million and subsequent sales royalties of 6.5 percent the first 5 years to market, and 2.5 percent the next 2 years on market for Keytruda (pembrolizumab) because BMS had IP protection on the use of anti-PD-1 antibodies.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>That must’ve been a one-off screw up, right?</strong> Unfortunately not. Kite had to pay Memorial Sloan Kettering Cancer Center 752 million for IP infringement surrounding Yescarta. That was after Gilead paid 11.9 billion to acquire Kite.</li>\n</ul>\n\n<p>Both patent disasters are detailed in this IV article: <a href=\"https://www.investorvillage.com/smbd.asp?mb=1933&amp;mn=153598&amp;pt=msg&amp;mid=21490140\">https://www.investorvillage.com/smbd.asp?mb=1933&amp;mn=153598&amp;pt=msg&amp;mid=21490140</a></p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Of note, SGMO’s proprietary gene-editing technology, Zinc-finger-nucleases, are wholly owned proprietary tech.</strong> And it has <a href=\"https://t.co/uKtI6vrAeb__;!!Cjnu1T6GFXg!6oZ04-OqlWutwVsIdNAOAKQ-IlWoIkV_CL4WnJbLO1Q-WZ02b883DiQUGphgBOdnxRvphNk3Wg$\">better precision and specificity than CRSPR</a>.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Why are they letting CRSP develop the tech and bring it to market?</strong> You make more money that way? Patent trolling is pretty reprehensible, but if you can just let someone else put in all the money for development and clinical trials and marketing and FDA approval, then just sue them for royalties, you’re going to make a shit ton more than if you did the upfront work yourself.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>You mentioned ARKG?</strong> Yeah, because SGMO isn’t included in it yet. But Takeda and Novartis (both partnered with SGMO) are. There is suspicion SGMO might make an appearance on the list soon because it’s massively undervalued, and it would only make sense to shift profits from all the other gene-therapy hockey-stick runups this year to diversify and invest in something with room to run. Don’t take it from me, <a href=\"https://www.linkedin.com/in/jo-mama-7774ba1bb\">this analyst</a> believes SGMO is a prime choice for inclusion in ARKG. If you reviewed his linked in profile you might be interested to know he also is overweight on DEEZ with an upside target of $69.</li>\n</ul>\n\n<p>Got eem aside, if SGMO is included in ARKG it will experience a wicked bump in price just the like ARKG holding that has a low market cap and banned ticker that farms genetically modified salmon. They were at about $3-$4 a share for a loooooong time before ARKG inclusion and have since rocketed to a new normal of $9-$10 a share. The ticker starts with an “A” and ends with a “B” and theres a “Q” in the middle if you want to peep some hot price action.</p>\n\n<p>Honestly, from what I can tell, it&#39;s mostly rumors at this point, but I highly doubt Our Lady of Gains Cathie Wood would not dip her toes in the SGMO pool.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Shouldn’t funds like ARKG already know about SGMO?</strong> I suspect they do, but way more importantly all the big pharma partners I mentioned earlier do. I said it before and I’ll say it again- those guys know a hell of a lot more than I do about what works, and it’s probably the main crux of my thesis.</li>\n</ul>\n\n<p>Unless SGMO’s CEO Sandy Macrae is Elizabeth Holmes 2.0 and this is a hilarious Sangameranos situation where I lose most of my retirement, things are looking pretty goddamn rosy.</p>\n\n<p>And trust me, Sandy Macrae is nowhere near the level of charismatic as Elizabeth Holmes is. Excellent CEO, strong clinician focused on safety first, able to turn this company into a powerhouse through acquisitions (TxCell) and partnerships- yes. Charismatic, kinda hot with crazy eyes and deep Venture Brothers <a href=\"https://youtu.be/2rs7VVjz5A8__;!!Cjnu1T6GFXg!__RIcIDFTSmG7OdGlGLgvdEQh3gV5d43LeHXCqDyyIjUP28_p4pbc2G9jmchEUBAjRHnzHT4LA$\">Dr. Girlfriend</a> dominatrix voice like Mrs. Holmes- nope, not even close. Listening to this guy talk is like watching paint dry while you’re stuck in an elevator someone farted in, so I’m assuming he must actually be peddling something good. Macrae is selling the STEAK, not the SIZZLE.</p>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>You seem to link a lot of IV articles, what’s up with that?</strong> I’m just trying to distill down the important points for my fellow autists riding the short bus with me. PS, if my boy bct1192 from IV is reading this- much love, and know that “undiagnosed autist” is a strong compliment in the parlance of this forum.</li>\n</ul>\n\n<p>&#x200B;</p>\n\n<ul>\n<li><strong>Legit stacks? For real-real? Lunar Tendies?</strong> Trust, WSB fam. I posted a YOLO screenshot in my first article before the pop this week, it was more than 51% of my IRA, and that’s just one of my 5 investment accounts.</li>\n</ul>\n\n<p><strong>TL;DR summary</strong>- SGMO undervalued, owns the patents to CRSP. SGMO stock price should go up 4x to be equivalent market cap.</p>\n\n<p><strong>TL;DR Investment moves</strong>- <strong>Buy SGMO shares</strong> since they are still relatively cheap, otherwise LEAP calls like <strong>Jan ’22 $25 strike</strong>. I say leaps because it&#39;s going to take off, but I&#39;m not miss Cleo, you can&#39;t call me now, and I don&#39;t know when share price will go up. I don&#39;t want my bros losing out on a short-dated disaster. My conservative target price is $25 by EOY ’21. Long term target price $45 by EOY ’23 (following hemophilia A approval with Pfizer).</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/Idtln1RHGBz9goQRXDgUR2zAPOb6FXUO8zYXy3Q8D30.jpg?auto=webp&s=9b4ae3af40726706761fa6104c120dba57c9e6da", "width": 140, "height": 140}, "resolutions": [{"url": "https://external-preview.redd.it/Idtln1RHGBz9goQRXDgUR2zAPOb6FXUO8zYXy3Q8D30.jpg?width=108&crop=smart&auto=webp&s=a9f00ff3d3749d6f821eda5771ffe56fce5c7e41", "width": 108, "height": 108}], "variants": {}, "id": "x_b4WgT5Bjeo9jI4YrR2oR8W_U1qhC8p29fdsMGkPds"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 100, "id": "award_19860e30-3331-4bac-b3d1-bd28de0c7974", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=16&height=16&auto=webp&s=4e50438bd2d72ae5398e839ac2bdcccf323fca79", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=32&height=32&auto=webp&s=e730f68de038499700c6301470812c29ef6a8555", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=48&height=48&auto=webp&s=8d7c7fa22e6ff3b1b0a347839e42f493eb5f6cbc", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=64&height=64&auto=webp&s=11ec2a72e2724017bb8479639edce8a7f2ba64f4", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=128&height=128&auto=webp&s=1e936ae571e89abb5a5aaa2efd2d7cfb0ed1b537", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "I needed this today", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Heartwarming", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=16&height=16&auto=webp&s=4e50438bd2d72ae5398e839ac2bdcccf323fca79", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=32&height=32&auto=webp&s=e730f68de038499700c6301470812c29ef6a8555", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=48&height=48&auto=webp&s=8d7c7fa22e6ff3b1b0a347839e42f493eb5f6cbc", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=64&height=64&auto=webp&s=11ec2a72e2724017bb8479639edce8a7f2ba64f4", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png?width=128&height=128&auto=webp&s=1e936ae571e89abb5a5aaa2efd2d7cfb0ed1b537", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/v1mxw8i6wnf51_Heartwarming.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "klfpgo", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "Rake-7613", "fullname": "t2_25mas57u"}, "discussion_type": null, "num_comments": 29, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/", "subreddit_subscribers": 1748680, "created_utc": 1609117174.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_klfpgo", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghaubd4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "sauce-ome-sauce", "fullname": "t2_21sq3up7"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_klfpgo", "score": 8, "author_fullname": "t2_21sq3up7", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Don’t worry BCL11A promoter gene, I give a shit 🧬", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Don’t worry BCL11A promoter gene, I give a shit 🧬</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/ghaubd4/", "num_reports": null, "locked": false, "name": "t1_ghaubd4", "created": 1609202681.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609173881.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_klfpgo", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghb15w4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Rake-7613", "fullname": "t2_25mas57u"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ghaubd4", "score": 1, "author_fullname": "t2_25mas57u", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Glad to hear shits are given! 🤌💩", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Glad to hear shits are given! 🤌💩</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/ghb15w4/", "num_reports": null, "locked": false, "name": "t1_ghb15w4", "created": 1609206196.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609177396.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_klfpgo", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghav0w8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "trader9899", "fullname": "t2_65kccmei"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_klfpgo", "score": 7, "author_fullname": "t2_65kccmei", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Don’t understand shit. Chart looks good. In it for the eventual ✈️🚀", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Don’t understand shit. Chart looks good. In it for the eventual ✈️🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/ghav0w8/", "num_reports": null, "locked": false, "name": "t1_ghav0w8", "created": 1609203052.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609174252.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_klfpgo", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghb0e7o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Rake-7613", "fullname": "t2_25mas57u"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ghav0w8", "score": 1, "author_fullname": "t2_25mas57u", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Buckle up, buttercup.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Buckle up, buttercup.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/ghb0e7o/", "num_reports": null, "locked": false, "name": "t1_ghb0e7o", "created": 1609205803.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609177003.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_klfpgo", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghaznj2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "TheJungle589", "fullname": "t2_23dxlczg"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_klfpgo", "score": 5, "author_fullname": "t2_23dxlczg", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "$100 in", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>$100 in</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/klfpgo/sgmo_dd_crispr_patents_valuation_and_arkg/ghaznj2/", "num_reports": null, "locked": false, "name": "t1_ghaznj2", "created": 1609205424.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609176624.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}