{"approved_at_utc": null, "selftext": "I'm sharing excerpts from two books on options - Options Volatility Trading: Strategies for Profiting from Market Swings & Options Volatility & Pricing.  I actually read these books and pulled out the information relating to volatility.  I see DD's advertising call buying on 99% IV percentile tickers daily in this sub.  Stop providing liquidity for those who actually got in early and start understanding why these are bad deals.  Buy low sell high in options means implied volatility.  What is 99 on a scale of 1-100?\n\n**Volatility**\n\nWhat is volatility and why is it so important to an option trader?  In a sense, volatility is a measure of the speed of the market.  \n\n\nTypes of volatility:\nfuture volatility, historical volatility, forecast volatility, implied volatility, seasonal volatility (commodities).\n\n\nTo help the new trader understand the various types of volatility, consider the following analogy to weather forecasting.  Suppose a trader living in Chicago gets up on a July morning and must decide what clothes to wear that day.  Do you think he will consider putting on a parka?  This is not a logical choice because he knows that historically it is not sufficiently cold in Chicago in July to warrant wearing a winter coat.  Next, he might turn on the radio or television to listen to the weather forecast.  The forecaster is predicting clear skies with temperatures around 90F.  Based on this information, our trader has reached a decision: he will wear a short sleeve shirt with no sweater or jacket, and he certainly won't need an umbrella.  However, just to be sure, he decides to take a look out the window to see what the people outside are wearing.  To his surprise, everyone is wearing a coat and carrying an umbrella.  The people outside, through their clothing, are implying completely different weather.  What clothes should the trader wear?  He must make some decisions, but whom should he believe, the weather forecaster or the people in the street?  There can be no certain answer because the trader will not know the future weather until the end of the day.  - Options Volatility & Pricing\n\n\nVolatility comes in two basic stripes: historical and implied.  Historical volatility is also called realized volatility.  It refers to an objectively calculated formula that measure the standard deviation of an underlying instrument.  Implied volatility refers to the volatility implied by the price of the option.  The value of an option is calculated by a somewhat complex formula that includes several fixed variables such as price of the underlying instrument, strike price of the option, time until expiration, dividends, and cost of carry, as well as moving variable - the volatility of the option.  But if we know the price of the option, as we do for everything that trades, we can then work backwards and calculate an implied volatility of that option.  An implied volatility represents the best guess of the \"market\" of the volatility of the underlying between now and when the option expires. - Options Volatility Trading: Strategies for Profiting from Market Swings\n\n\n**Volatility Characteristics**\n\nIf we were to generalize about volatility characteristics from the Deutschemark volatility in [Figure 14-2](https://imgur.com/a/SZjt2oa), we might surmise that an underlying contract is likely to have a typical long-term average, or mean volatility.  Moreover, the volatility of the underlying contract appears to be mean reverting.  When volatility rises above the mean, one can be fairly certain that it will eventually fall back to its mean.\n[Notice](https://imgur.com/a/jjasHg2) that the fluctuations in implied volatility are usually less than the fluctuations in historical volatility.  When the historical volatility declined, the implied volatility rarely declined by an equal amount.  Because volatility tends to be mean reverting, when historical volatility is above its mean there is a greater likelihood that it will decline, and when historical volatility is below its mean there is a greater likelihood it will increase.\n[We can see](https://imgur.com/a/KyYUgVs) that with a great deal of time remaining to expiration, the future volatility of the underlying contract (the solid line) is relatively stable.  but as we get closer to expiration the future volatility can become much less stable.  This is logical if we again recall that the mean reverting characteristics of volatility are much less certain over short periods of time than over long periods.  One large move in the underlying contract with only several days remaining to expiration will result in a sharp increase in the volatility to expiration (14-9C).  On the other hand, if the underlying contract is relatively quiet over the last several days in an option's life, the volatility to expiration will collapse. - Options Volatility Trading: Strategies for Profiting from Market Swings\n\n\n**How do Traders Trade Volatility?**\n\nIf you are being chased by a bear, what is the key to getting away?  An old adage says that you don't have to actually outrun the bear, you simply have to outrun at least one person who's with you.  Volatility in the S&P 500 averages about 20 over the course of history.  But let's say you buy a one-month option at a 40 volatility.  If realized volatility over the course of the month exceeds 40, you likely made money on the trade.  Or at the very least you made a wise decision owning options instead of stock.\nVolatility serves as a proxy for the amount of money available in the options pool.  The deeper the pool, the greater the premiums.  For sellers, the better the price they receive and the wider the range of stock with which they can profit.  For buyers, all they care about or should care about, is whether realized volatility of the stock itself will prove higher than the volatility they paid.  An 80 volatility implies that the average day will see a 5 percent move (80/SQRT of 252) (252 trading days in a year).  Well, actually, it implies that two-thirds of the days will see moves under 5 percent and that one-third will see moves above and beyond that.  \nAs a general rule, net selling options at a higher volatility than they ultimately realize will prove profitable.  Likewise for net buying options at a lower volatility than realized.  One thing to do is ignore anyone who throws numbers out trying to \"prove\" how much better you have it selling options compared to buying them.  This tells an incomplete story. - Options Volatility Trading: Strategies for Profiting from Market Swings\n\n\n**The VIX**\n\nThe time is 1993.  Bill Clinton is anaugurated.  The Buffalo Bills lose their third straight Super Bowl and run headstrong into a 4th.  The World Wide Web begins.  Nirvana releases \"In Utero.\"  And the VIX was born.  The goal?  To provide a handy estimate of the implied volatility of a 30-day at-the-money option on the S&P 100 Index, also known as the OEX.   By 2003, the S&P 500 supplanted the OEX as the most popular index.  So on September 23, a new VIX was born that had a new underlying index, SPX, and a completely new methodology. - Options Volatility Trading: Strategies for Profiting from Market Swings\n\n\n**They Don't Hedge What You Think They Hedge**\n\nThe Vix estimates the implied volatility of an ATM option in SPX with 30 days of duration.  A regular option on the SPX estimates the volatility of SPX itself between today and the day the option expires.  Say it's May.  You're looking at November options in SPX, and they trade at a 25 volatility.  That is the volatility the market anticipates between now and November expiration.  \nA November FIX future?  Quite different.  That's an estimate of where the VIX will close on November expiration day.  So if in May, you buy or sell a VIX November future or option, you are simply betting on where the VIX will settle on the morning of November expiration.  A common misconception is that your bet is on volatility between May and November.  Wrong.  It's a bet on a single snapshot number that one day.  And since the VIX itself is an estimate of volatility 30 days forward, a May transaction in a November FIX contracts bets on where the market six month's hence will estimate volatility 30 days forward from there.  \nOh, and did I mention that VIX futures and options close on a different day from regular futures and options?  Yes, they expire 30 days ahead of the next month's regular expiration, which makes sense in a way since the VIX itself estimate the price of a 30-day option.  The problem is that we have some four-week cycles and some five-week cycles, so that puts VIX expiration on either the Wednesday before or the Wednesday after regular expiration, depending on where regular expiration one cyce out sits.  Confused?  You are not alone. - Options Volatility Trading: Strategies for Profiting from Market Swings\n\n\n**What Can the VIX do for You?**\n\nIt can tell you an expected range in the underlying index, the SPX.  Remember though that is a probability, not a guarantee.  Market volatility expectations reside at the intersection of two factors: volatility of the component stocks and the degree to which they correlate.  The volatility surge in mid-2008 has as much to do with increased correlation as anything else - specifically, energy imploding alongside everything else. - Options Volatility Trading: Strategies for Profiting from Market Swings", "author_fullname": "t2_6wbuqxxn", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Implied Volatility for Autists", "link_flair_richtext": [{"e": "text", "t": "Options"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "options", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_k8stou", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.96, "author_flair_background_color": null, "subreddit_type": "public", "ups": 24, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Options", "can_mod_post": false, "score": 24, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1607392489.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607414196.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>I&#39;m sharing excerpts from two books on options - Options Volatility Trading: Strategies for Profiting from Market Swings &amp; Options Volatility &amp; Pricing.  I actually read these books and pulled out the information relating to volatility.  I see DD&#39;s advertising call buying on 99% IV percentile tickers daily in this sub.  Stop providing liquidity for those who actually got in early and start understanding why these are bad deals.  Buy low sell high in options means implied volatility.  What is 99 on a scale of 1-100?</p>\n\n<p><strong>Volatility</strong></p>\n\n<p>What is volatility and why is it so important to an option trader?  In a sense, volatility is a measure of the speed of the market.  </p>\n\n<p>Types of volatility:\nfuture volatility, historical volatility, forecast volatility, implied volatility, seasonal volatility (commodities).</p>\n\n<p>To help the new trader understand the various types of volatility, consider the following analogy to weather forecasting.  Suppose a trader living in Chicago gets up on a July morning and must decide what clothes to wear that day.  Do you think he will consider putting on a parka?  This is not a logical choice because he knows that historically it is not sufficiently cold in Chicago in July to warrant wearing a winter coat.  Next, he might turn on the radio or television to listen to the weather forecast.  The forecaster is predicting clear skies with temperatures around 90F.  Based on this information, our trader has reached a decision: he will wear a short sleeve shirt with no sweater or jacket, and he certainly won&#39;t need an umbrella.  However, just to be sure, he decides to take a look out the window to see what the people outside are wearing.  To his surprise, everyone is wearing a coat and carrying an umbrella.  The people outside, through their clothing, are implying completely different weather.  What clothes should the trader wear?  He must make some decisions, but whom should he believe, the weather forecaster or the people in the street?  There can be no certain answer because the trader will not know the future weather until the end of the day.  - Options Volatility &amp; Pricing</p>\n\n<p>Volatility comes in two basic stripes: historical and implied.  Historical volatility is also called realized volatility.  It refers to an objectively calculated formula that measure the standard deviation of an underlying instrument.  Implied volatility refers to the volatility implied by the price of the option.  The value of an option is calculated by a somewhat complex formula that includes several fixed variables such as price of the underlying instrument, strike price of the option, time until expiration, dividends, and cost of carry, as well as moving variable - the volatility of the option.  But if we know the price of the option, as we do for everything that trades, we can then work backwards and calculate an implied volatility of that option.  An implied volatility represents the best guess of the &quot;market&quot; of the volatility of the underlying between now and when the option expires. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n\n<p><strong>Volatility Characteristics</strong></p>\n\n<p>If we were to generalize about volatility characteristics from the Deutschemark volatility in <a href=\"https://imgur.com/a/SZjt2oa\">Figure 14-2</a>, we might surmise that an underlying contract is likely to have a typical long-term average, or mean volatility.  Moreover, the volatility of the underlying contract appears to be mean reverting.  When volatility rises above the mean, one can be fairly certain that it will eventually fall back to its mean.\n<a href=\"https://imgur.com/a/jjasHg2\">Notice</a> that the fluctuations in implied volatility are usually less than the fluctuations in historical volatility.  When the historical volatility declined, the implied volatility rarely declined by an equal amount.  Because volatility tends to be mean reverting, when historical volatility is above its mean there is a greater likelihood that it will decline, and when historical volatility is below its mean there is a greater likelihood it will increase.\n<a href=\"https://imgur.com/a/KyYUgVs\">We can see</a> that with a great deal of time remaining to expiration, the future volatility of the underlying contract (the solid line) is relatively stable.  but as we get closer to expiration the future volatility can become much less stable.  This is logical if we again recall that the mean reverting characteristics of volatility are much less certain over short periods of time than over long periods.  One large move in the underlying contract with only several days remaining to expiration will result in a sharp increase in the volatility to expiration (14-9C).  On the other hand, if the underlying contract is relatively quiet over the last several days in an option&#39;s life, the volatility to expiration will collapse. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n\n<p><strong>How do Traders Trade Volatility?</strong></p>\n\n<p>If you are being chased by a bear, what is the key to getting away?  An old adage says that you don&#39;t have to actually outrun the bear, you simply have to outrun at least one person who&#39;s with you.  Volatility in the S&amp;P 500 averages about 20 over the course of history.  But let&#39;s say you buy a one-month option at a 40 volatility.  If realized volatility over the course of the month exceeds 40, you likely made money on the trade.  Or at the very least you made a wise decision owning options instead of stock.\nVolatility serves as a proxy for the amount of money available in the options pool.  The deeper the pool, the greater the premiums.  For sellers, the better the price they receive and the wider the range of stock with which they can profit.  For buyers, all they care about or should care about, is whether realized volatility of the stock itself will prove higher than the volatility they paid.  An 80 volatility implies that the average day will see a 5 percent move (80/SQRT of 252) (252 trading days in a year).  Well, actually, it implies that two-thirds of the days will see moves under 5 percent and that one-third will see moves above and beyond that.<br/>\nAs a general rule, net selling options at a higher volatility than they ultimately realize will prove profitable.  Likewise for net buying options at a lower volatility than realized.  One thing to do is ignore anyone who throws numbers out trying to &quot;prove&quot; how much better you have it selling options compared to buying them.  This tells an incomplete story. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n\n<p><strong>The VIX</strong></p>\n\n<p>The time is 1993.  Bill Clinton is anaugurated.  The Buffalo Bills lose their third straight Super Bowl and run headstrong into a 4th.  The World Wide Web begins.  Nirvana releases &quot;In Utero.&quot;  And the VIX was born.  The goal?  To provide a handy estimate of the implied volatility of a 30-day at-the-money option on the S&amp;P 100 Index, also known as the OEX.   By 2003, the S&amp;P 500 supplanted the OEX as the most popular index.  So on September 23, a new VIX was born that had a new underlying index, SPX, and a completely new methodology. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n\n<p><strong>They Don&#39;t Hedge What You Think They Hedge</strong></p>\n\n<p>The Vix estimates the implied volatility of an ATM option in SPX with 30 days of duration.  A regular option on the SPX estimates the volatility of SPX itself between today and the day the option expires.  Say it&#39;s May.  You&#39;re looking at November options in SPX, and they trade at a 25 volatility.  That is the volatility the market anticipates between now and November expiration.<br/>\nA November FIX future?  Quite different.  That&#39;s an estimate of where the VIX will close on November expiration day.  So if in May, you buy or sell a VIX November future or option, you are simply betting on where the VIX will settle on the morning of November expiration.  A common misconception is that your bet is on volatility between May and November.  Wrong.  It&#39;s a bet on a single snapshot number that one day.  And since the VIX itself is an estimate of volatility 30 days forward, a May transaction in a November FIX contracts bets on where the market six month&#39;s hence will estimate volatility 30 days forward from there.<br/>\nOh, and did I mention that VIX futures and options close on a different day from regular futures and options?  Yes, they expire 30 days ahead of the next month&#39;s regular expiration, which makes sense in a way since the VIX itself estimate the price of a 30-day option.  The problem is that we have some four-week cycles and some five-week cycles, so that puts VIX expiration on either the Wednesday before or the Wednesday after regular expiration, depending on where regular expiration one cyce out sits.  Confused?  You are not alone. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n\n<p><strong>What Can the VIX do for You?</strong></p>\n\n<p>It can tell you an expected range in the underlying index, the SPX.  Remember though that is a probability, not a guarantee.  Market volatility expectations reside at the intersection of two factors: volatility of the component stocks and the degree to which they correlate.  The volatility surge in mid-2008 has as much to do with increased correlation as anything else - specifically, energy imploding alongside everything else. - Options Volatility Trading: Strategies for Profiting from Market Swings</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?auto=webp&s=26a8a461429393a95016524c6744b7f39f5334f4", "width": 1071, "height": 677}, "resolutions": [{"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?width=108&crop=smart&auto=webp&s=ea0edd174aa4b59c69bd872d1d8db9babf4f5718", "width": 108, "height": 68}, {"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?width=216&crop=smart&auto=webp&s=94028782a88f4fd097969e8ec51f90585c632cc7", "width": 216, "height": 136}, {"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?width=320&crop=smart&auto=webp&s=fe5ec6de8bd5eb1915180d1f69ba1398504b1d8f", "width": 320, "height": 202}, {"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?width=640&crop=smart&auto=webp&s=45b7486f62d7f4a8cdeca78135605c311f7d6bda", "width": 640, "height": 404}, {"url": "https://external-preview.redd.it/VutAhgGJXaFqrmo5HUe8nzgunT8_hugy8F9GdefjVKc.jpg?width=960&crop=smart&auto=webp&s=6016134b4efabd7a891fcd9b87d1af8948af2cf6", "width": 960, "height": 606}], "variants": {}, "id": "srcLSV_QIo1zpWQu56ekswEMkcYfu2Efw_SYiXcsaaU"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "2c3f0286-ad54-11e5-9b95-0e504bc02097", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#ff4500", "id": "k8stou", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "ralphynader", "fullname": "t2_6wbuqxxn"}, "discussion_type": null, "num_comments": 29, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/", "subreddit_subscribers": 1669548, "created_utc": 1607385396.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k8stou", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf013at", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AdministrativeSail51", "fullname": "t2_7nkiyv8l"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k8stou", "score": 8, "author_fullname": "t2_7nkiyv8l", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "thats crazy bro, ill grab some more pltr and hedge with pltr calls", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>thats crazy bro, ill grab some more pltr and hedge with pltr calls</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/gf013at/", "num_reports": null, "locked": false, "name": "t1_gf013at", "created": 1607414767.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607385967.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k8stou", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf01m52", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ralphynader", "fullname": "t2_6wbuqxxn"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gf013at", "score": 2, "author_fullname": "t2_6wbuqxxn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "PLTR doesn't have much historical volatility to reference since its new.  We don't really know what the upper bound is yet.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>PLTR doesn&#39;t have much historical volatility to reference since its new.  We don&#39;t really know what the upper bound is yet.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/gf01m52/", "num_reports": null, "locked": false, "name": "t1_gf01m52", "created": 1607415054.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607386254.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k8stou", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf00n5i", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "debugg_and_bait", "fullname": "t2_wbyy9"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k8stou", "score": 7, "author_fullname": "t2_wbyy9", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "brah gotta dumb it down a tad man", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>brah gotta dumb it down a tad man</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/gf00n5i/", "num_reports": null, "locked": false, "name": "t1_gf00n5i", "created": 1607414517.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607385717.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k8stou", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf00yc4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ralphynader", "fullname": "t2_6wbuqxxn"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gf00n5i", "score": 5, "author_fullname": "t2_6wbuqxxn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Use it or don't", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Use it or don&#39;t</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/gf00yc4/", "num_reports": null, "locked": false, "name": "t1_gf00yc4", "created": 1607414688.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607385888.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k8stou", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf03he6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "powahTEN", "fullname": "t2_2dbh0nd1"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k8stou", "score": 3, "author_fullname": "t2_2dbh0nd1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "awesome post and great explanation for ppl retarded like me that don’t know anything about IV.  thank you.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>awesome post and great explanation for ppl retarded like me that don’t know anything about IV.  thank you.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k8stou/implied_volatility_for_autists/gf03he6/", "num_reports": null, "locked": false, "name": "t1_gf03he6", "created": 1607416069.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607387269.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}