{"approved_at_utc": null, "selftext": "&#x200B;\n\n* AirBnb has more than [4 million hosts](https://news.airbnb.com/thankyou/)  offering private rooms in their own homes to luxury experiences, from    one night to several weeks or months. AirBnb has a presence in more  than 220 countries and regions and has served over 825 million guest  arrivals and has cumulatively earned $110bn in revenue.\n* AirBnb intends to [disrupt](https://www.theatlantic.com/business/archive/2018/02/airbnb-hotels-disruption/553556/) the one-size-fits-all approach that was the standard for travel and    leisure. The company believes that hosting is at the center of the AirBnb experience and this focus enables guests to access unique places and experiences that were previously inaccessible.\n* In   2019, the  company generated Gross Booking Value of $38bn, 29%  growth  y/y,  and has generated $507mm in free cash flow since inception, signifying its clear potential to cash generation in the near future.  Gross Bookings Value were down 39% y/y in the first 9 months of 2020 due  to the Covid pandemic per the  [company S-1.](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm)\n* The company business model has shown resilience in the face of the   pandemic  with business beginning to pick up within two months of travel   shutting  down around the world per the company S-1. Domestic travel   has been especially strong and has rebounded at a rapid pace with   people choosing  to travel closer to home.\n* The   stock is priced incredibly high,  and while we love the company and  what it’s doing, the valuation is  simply not enticing as an investor. The stock is trading near our absolute Bull Case scenario which we   outline in our valuation.\n\n**Business Model:**\n\nThe  concept of AirBnb was born in  2007 when the two founders, Brian  and  Joe, noticed an international  conference was coming to town and  every  hotel was sold out. The  founders quickly created a website,   AirBedandBreakfast.com, and were  able to rent their apartment to the   conference attendees.\n\nAirbnb is the latest company to make use of the [sharing economy,](https://www.investopedia.com/terms/s/sharing-economy.asp) or the peer-to-peer economy. The business model is built on buyers  and   sellers sharing resources through collaborative consumption of  goods,   services, and of ownership. The Airbnb platform [provides tools](https://www.airbnb.com/host/homes) that make it easy to connect hosts who own houses and apartments with    guests who seek to rent them for short-term stays. Airbnb’s revenues comes from fees collected on guest rental stays with fees being  charged   on both the host and the guest side per the [company S-1](https://www.airbnb.com/host/homes). In 2016, Airbnb added another business line with [experiences](https://www.airbnb.com/s/experiences), but the business has been slow to gain any meaningful traction with only [$10 million in sales in 2017](http://aswathdamodaran.blogspot.com/).\n\nThis is a handy graphic summarizing the business model courtesy of [Aswath Damodaran](http://aswathdamodaran.blogspot.com/).\n\nhttps://preview.redd.it/8alte914ak461.png?width=1024&format=png&auto=webp&s=d2688c48b7a8048876de069175f72191c2c0a0e2\n\nAnd Airbnb provides an illustrative example of the business model at work with the fees they would collect in their [S-1](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm). \n\nhttps://preview.redd.it/lg0rycx5ak461.png?width=1008&format=png&auto=webp&s=2e5632ff708ff63323fec8659eace83449205923\n\n**Hosts:**\n\nAs of September 30, 2020, AirBnb had [4 million hosts](https://news.airbnb.com/thankyou/)  around the world, with 86% of hosts outside the United States, and 7.4    million available listings of homes and experiences, 5.6 million of   which were active listings per the [company S-1](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm).   Per the company, “We consider a listing of a home or an experience  tobe an active listing if it is viewable on Airbnb and has been   previously booked at least once on Airbnb.”\n\nHosts generally fall into two categories – individual and [professional.](https://www.airbnb.com/d/host_pro) Individual hosts activate their listings directly on the Airbnb    platform through the website or app. Professional hosts in contrast run    their own property management or hospitality business and use programs    to list their properties on the Airbnb platform. As of December 31,  2019, 90% of hosts were individual hosts and 72% of nights booked were    with individual hosts per the [company S-1](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm). Individual hosts are the core component and key supply for Airbnb.\n\nAirbnb provides a number of services to enable their 4 million hosts. Anyone [can become a successful host](https://www.airbnb.com/host/homes?af=43720035&c=.pi0.pk37076538223_185707635826_c_141022032497&gclid=CjwKCAiAq8f-BRBtEiwAGr3DgW9my6otYP6hT1Yr5gQAFtISRM1zMA7k0KbUXYnB7wIFE1cdiLkoHhoCoK8QAvD_BwE) on the Airbnb platform and Airbnb is able to provide a number of services per the [S-1](https://www.airbnb.com/host/homes?af=43720035&c=.pi0.pk37076538223_185707635826_c_141022032497&gclid=CjwKCAiAq8f-BRBtEiwAGr3DgW9my6otYP6hT1Yr5gQAFtISRM1zMA7k0KbUXYnB7wIFE1cdiLkoHhoCoK8QAvD_BwE) including:\n\nhttps://preview.redd.it/jfh4q0k8ak461.png?width=624&format=png&auto=webp&s=e5636ed51c0c4867231b7c5d015cb98a455bf21c\n\n* Global demand: Anyone with an internet connection can book an Airbnb experience from anywhere in the world\n* Merchandising: Airbnb helps hosts create and activate their listings on the  platform. By taking hosts step-by-step through the process, Airbnb is  able to  make  posting effective and easy.\n* Pricing:  Hosts can set their own  prices, but Airbnb does provide smart pricing  tools that suggest prices  based on changes in demand for other similar listings based on factors like the season and expected demand.\n* Scheduling:   Hosts can  easily manage their calendars and accept and manage their  listings and  reservations on the platform through the website or app.\n* Payments:  Airbnb facilitates all payments by collecting payments from guests and    processing the payments to hosts. In 2019, Airbnb processed  approximately $70bn of guest and host transactions.\n\nAirbnb also provides services like community support, host protections, posted reviews and feedback, and a superhost program.\n\n**Key metrics and Covid resilience:**\n\nAccording to the company [S-1 filing](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm), the majority of guests who have ever made a booking on Airbnb were  between the ages of 18-34. In 2019, 54 million active bookers worldwide  booked 327 million nights and experiences on the platform.\n\nhttps://preview.redd.it/qd5s6uwbak461.png?width=624&format=png&auto=webp&s=8f31f59757384127b60bcee981d39fe6f51b4ce2\n\nNights and experiences booked are a key measure of the true scale of  the Airbnb platform. Per the company S-1, “Nights and Experiences Booked  on our platform in a period represents the sum of the total number of  nights booked for stays and  the total number of seats booked for  experiences, net of cancellations and alterations that occurred in that  period.”\n\nIn   2019, Airbnb had 326.9 mm Nights and Experiences booked, a 31% increase from the 250.3 mm in 2018, which grew 35% from 2017. Typically,    the first, second, and third quarters of the year each have higher Nights and Experiences Booked compared to the fourth quarter, as guests  travel during the peak travel season, which is in the third quarter  for   North America and EMEA according to the company S-1.\n\nCovid has obviously [had an effect](https://www.ahla.com/covid-19s-impact-hotel-industry) on the hotel industry, and Airbnb is not immune with 2020 being a down    year and Q2 being particularly severe across several key metrics. However, the business model has shown resilience and management attributes this to the renewed ability and willingness of guests to travel. I know personally I’m looking at Airbnb’s in warmer climates as I’m itching to get out of the cold and soon to be lock downed  northeast US.\n\nhttps://preview.redd.it/cjgmuu5gak461.png?width=624&format=png&auto=webp&s=7dc335ba9eb14e5cf2a93d394d12362943848213\n\nFor the nine months ended Sept 30,   2020, the company had 146.9 mm  Nights and Experiences Booked, a   decrease of 41% compared to the prior year period according to the [company S-1](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm).    However, the decline was most severe in the second quarter and   business  has rebounded with Q3 being down only 28% y/y. The company   credits this  improvements primarily to stronger results in North   America and Europe  and in particular to resilience in domestic and   short-distance travel.\n\nGross   Bookings value is defined in the S-1 as “the dollar  value of  bookings  on our platform in a period and is inclusive of host  earnings,  service  fees, cleaning fees, and taxes, net of cancellations  and  alterations  that occurred during that period.” Growth in Gross Bookings Value  reflects the company’s ability to attract and retain hosts and guests   and  reflects growth in Nights and Experiences booked. In 2019, Gross  Bookings Value grew 29%  y/y and 2018 grew 40% y/y.\n\nhttps://preview.redd.it/zgld3exgak461.png?width=624&format=png&auto=webp&s=a8898a508d1ffdec0acc59d243e23ea945538c74\n\nIn 2020, there is a similar drop in  Gross Bookings due to the Covid pandemic.  For the first nine months  ended Sept 30 2020 Gross Bookings was $18bn, a 39%  decrease from the  prior year period  according to the S-1. The decline  was once again  most severe in Q2 and  Q3 rebounded, being down only 17%  y/y.\n\nIn   2019, Gross Bookings and revenue by region were about equal between  Europe, Middle East, and Africa and  for  North America. However, as a  result of the pandemic, Gross Bookings and revenue have reflected a  shift toward North America where the recovery has been strongest.   “For  the first nine months of 2020, Gross Bookings Value was $9.7 billion,  or 54% of the total, in North America compared to $5.6 billion, or 31%,  in Europe, Middle East, and Africa, $1.6 billion, or 9%, in Asia  Pacific, and $1.1 billion, or 6%, in Latin   America” – company S-1\n\nhttps://preview.redd.it/l8vwl6klak461.png?width=624&format=png&auto=webp&s=c47266ada3851c20e505b022c3054c850715bea5\n\nHistorically, Airbnb has had a strong weight toward cross-border travel,  with 49% of nights in 2019 compared to management’s estimate of 20% of total overnight paid trips for the travel industry as a whole according  the company S-1. However, the pandemic has marked a shift to  domestic travel in Airbnb’s traditional travel corridor mix. In   September 2020, 77% of experiences booked were domestic compared to 52%  in January. In  fact, domestic bookings have grown at a rapid clip with   54% growth in  June 2020 and 35% growth in September 2020. \n\nhttps://preview.redd.it/zap4dhgnak461.png?width=624&format=png&auto=webp&s=147ce7e7e1b224cbcbaf8e2eeb54a78c1dd7e1b9\n\nClearly, Airbnb is well-positioned because of its wide offering to cater   shifting consumer travel habits and this has enabled the company to be  more resilient in a downturn than travel competitors, in some metrics even being able to achieve grow. If we look at hotel and travel booking competitors, we see that Airbnb has weathered the pandemic much  better   than most peers when looking at 9 months ended Sept 30 2020 revenue. Airbnb revenue is down -31.9% so far in 2020 compared to the  median hotel revenue being down -48.2% and travel bookings being down  -53.3%.  Airbnb has also bounced back faster than every competitor minus  [CHH](https://www.sec.gov/ix?doc=/Archives/edgar/data/1046311/000104631120000041/chh-10q09302020.htm) in Q3 with revenues down -18.4% compared to the 50.9% median for hotels and -52.7% for travel bookings companies. \n\nhttps://preview.redd.it/q0lc324qak461.png?width=624&format=png&auto=webp&s=7ba72173c69f93b6a926d36b67d15fdc46e8beb2\n\n**TAM and growth strategy:**\n\nManagement highlights massive market opportunities in its [S-1 filing,](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm)  “We have a substantial market opportunity in the growing travel market    and experience economy. We estimate our serviceable addressable market    (“SAM”) today to be $1.5 trillion, including $1.2 trillion for   short-term stays and $239 billion for experiences. We estimate our total addressable market (“TAM”) to be $3.4 trillion, including $1.8   trillion  for short-term stays, $210 billion for long-term stays, and   $1.4 trillion for experiences.*”*\n\nIn   general, these assumptions are based on the belief that new travel   behaviors will expand the market opportunity over time as well as the need to justify a large market cap. Management uses their own internal    estimates to come up with the $1.2trn for short-term stays and [Euromonitor](https://www.euromonitor.com/usa)estimates of tourist spend on attractions and experiences to estimate  the $239mm for Experiences. To get the TAM short-term stays estimate, management assumes an increase in trips per capita based on The World    Travel and Tourism Council [estimated 3.5% CAGR](https://wttc.org/Research/Economic-Impact).   For long-term stays, the company uses 10% of the $1.6trn global residential rental market. And for experiences, they add $1.1trn of   non-tourist recreational spend, again as estimated by [Euromonitor](https://www.euromonitor.com/usa).\n\nhttps://preview.redd.it/jrckxy31bk461.png?width=548&format=png&auto=webp&s=9c9e4ea99993a2e8f07644dbfed790ac2b7d722b\n\n In its early stages when it was a [startup pitching to VCs back in 2009.](https://millennialmkts.com/Users/danie/AppData/Local/Temp/startup%20pitching%20to%20VCs%20back%20in%202009)  Airbnb estimated the TAM to be 2 billion+ trips a year and its SAM to be 560mn trips a year. \n\nhttps://preview.redd.it/o3cwgw32bk461.png?width=521&format=png&auto=webp&s=6814c943d70ac8e5951c247875995e27c3e39d2f\n\n Another way to look at Airbnb’s TAM is to look at the hotel business globally. According to NYU professor [Aswath Damodaran’s Airbnb analysis](http://aswathdamodaran.blogspot.com/).    The industry generated over $600bn in revenues in 2019, but its  growth   has stalled and the industry remains concentrated among the top  5  hotel  chains. The US is the leading geographical market, but Asia  has  been gaining ground. \n\nhttps://preview.redd.it/ave4p504bk461.png?width=624&format=png&auto=webp&s=8428d25c1841c71eb27dafe2469238ea6f608238\n\nThe truth is Airbnb’s TAM, and we   agree with Damodaran’s analysis  here, is probably somewhere in between  these two numbers. Ignoring  Airbnb’s experiences portion of the TAMcalculation because that  business line is nascent at best, we get a upper estimate of $2trn and a  lower estimate of $600bn for Airbnb’s   TAM.\n\n**Peers:** \n\nWe   identify comparable peers to get a sense of Airbnb’s valuation and   how  in-line it is with the industry, while also keeping in mind Airbnb   is  growing faster and attempting to disrupt the hotel and travel  booking   industries. Current Hotel comparable peers are trading at a median of 4.1x 2021 sales and 2.0x 2022 sales according to [Bloomberg](https://www.bloomberg.com/professional/solution/bloomberg-terminal/)  Analyst Consensus estimates, while Airbnb’s IPO price implies – 18.45x  and 15.33x Sales based on our own estimates of 2021 and 2022 sales,    respecivetly. The EBITDA comparison is tough to make with Airbnb because    we estimate they will be EBITDA negative in 2021, and the EBITDA in    2022 and 2023 will be $130mm and $370mm leading to high multipliers. We    can see that the median hotel company is trading at 22.3x 2021   estimated  EBITDA and 13.9x 2022 estimated EBITDA according to Bloomberg    consensus.\n\nHowever, perhaps a   more apt comparison is looking at online travel  booking peers such as   Expedia (EXPE) and Booking.com (BKNG). The EV /  Sales and EV / EBITDA are slightly higher for this comparable group vs  the pure hotels peers,   primarily due to Booking.com. The median among  this group trade at   4.5x 2021 sales and 3.4x 2022 sales according to  Bloomberg consensus.\n\nhttps://preview.redd.it/40h2lhl9bk461.png?width=624&format=png&auto=webp&s=4f32a8d313aa93cee47b38d78f6ed105578f86ef\n\n \n\nIs the Airbnb premium justified? One   can argue a more resilient  business model, the promise of fast growth, and large market opportunities created by disruption and innovation may make the premium  seem reasonable when we try to compare the  company to  peer groups. There  truly is only one Airbnb and these peer  groups aren’t entirely  indicative of the future company profile of  Airbnb.\n\n**Valuation:**\n\nSetting the stage for the valuation, we take a look at Airbnb’s [Venture Capital pricing in](https://craft.co/airbnb/funding-rounds) the rounds leading up to the IPO. We can see that the company has    raised $5.8bn in VC funding and it’s latest Series F round in 2016. In  April 2020 the company was valued [at $18bn](https://www.reuters.com/article/us-airbnb-debt/airbnbs-new-1-billion-investment-comes-at-lower-valuation-sources-idUSKBN21P3IM).\n\nhttps://preview.redd.it/zgc3eyeabk461.png?width=624&format=png&auto=webp&s=298b0e974f95c2b74ec900ff1d9e6856b0c6fdfb\n\nThe IPO has clearly priced in a lot   of generous assumptions as well  as simple speculation with a hot   market. Initially, Airbnb planned to  sell shares for a range of [$44-$50 per share](https://www.sec.gov/Archives/edgar/data/1559720/000119312520306257/d81668ds1a.htm) in a filing made December 1. Then on December 7, they announced plans to sell shares for a range of [$56 – $60.](https://www.sec.gov/Archives/edgar/data/1559720/000119312520311265/d81668ds1a.htm) The company then priced their IPO at [$68 a share](https://www.wsj.com/articles/airbnb-expected-to-price-ipo-above-56-to-60-a-share-range-11607527468) on Wednesday, December 9. Shares opened trading at around $150 and ended the day at $144.71.\n\nHere’s some [institutional investor background](https://themarketear.com/posts/coBkK-wxO2)   on how this IPO is being looked at, \"Sanford  Bernstein ran a  Procensus investor survey to compile major talking  points. \\~100   investors participated. Consensus  suggests Airbnb delivers a +16%  revenue CAGR in the next  decade with  steady state margins at \\~25%.  Bulls will argue the IPO price  range (now indicating near \\~$60) is reasonable”\n\n\\+16%  Revenue CAGR  seems somewhat reasonable to us, so the biggest assumption in question  really is the \\~25% margins in our view. With that being said, and trying  to remain reasonable from an assumptions stand   point, here are our  main assumptions:\n\n* In  2020 Airbnb Bookings will be down \\~34%, but Airbnb will have a  bounce   back year in 2021, with high Bookings growth in 2022-2025, and   Bookings  growth slowing in 2026-2030. Our Base case in Bookings growth   is shown  below.\n\nhttps://preview.redd.it/9pqh0wigbk461.png?width=624&format=png&auto=webp&s=41f519e04eed800de49de37bd391f170f8207f81\n\n* Revenues   as a % of Bookings will continue to increase  in the future as the new   host model for professional hosts and  Experiences business gain steam   and a larger % of Airbnb Bookings.  Revenue as a % of Bookings was [12.6% in 2019](https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm) and we estimate it will be around 14.6% in 2025 for example.\n* Operating    costs will continue to decrease as a % of revenue as Airbnb continues    to grow in scale. This continuing growth in scale culminates in a  high   single digit operating margin by 2025 and a 27.1% operating  margin by   2030. This is lower than Booking’s (BKNG) operating margin  of [35.5% in 2019](https://www.sec.gov/ix?doc=/Archives/edgar/data/1075531/000107553120000011/bkng1231201910k.htm), but higher than hotel operators such as [Marriott’s](https://www.sec.gov/ix?doc=/Archives/edgar/data/1524358/000152435820000011/a2019q410-kdocument.htm) (VAC) or 17.4% [Hyatt](https://www.sec.gov/Archives/edgar/data/1468174/000146817420000015/0001468174-20-000015-index.htm) (H), 9.1% respectively in 2019.\n\nhttps://preview.redd.it/u0vwzf4ibk461.png?width=624&format=png&auto=webp&s=5ab6c603129841215f6cde4c026ece0fff823325\n\nTaking a look into future revenue growth scenarios with revenues  increasing as a % of Bookings and Bookings growth, we get a range of potential 2025 revenues. We think anywhere from $11bn to $13.7bn in revenue is the likeliest scenario for Airbnb in 2025. \n\nhttps://preview.redd.it/rqq5brtjbk461.png?width=624&format=png&auto=webp&s=131a5ef3c87d7a9556fdb5c8c2822e4626e7e8f5\n\nUsing a discounted cash flow model with a [Weighted Average Cost of Capital](https://www.investopedia.com/terms/w/wacc.asp) of 8% and a [perpetual growth rate](https://www.investopedia.com/terms/p/perpetuity.asp) of 3%, we get a Base Case price of $77.40.\n\nWhat’s interesting in our valuation is that the vast majority of value in Airbnb is from the [Net Present Value](https://www.investopedia.com/terms/n/npv.asp) of the [terminal value](https://www.investopedia.com/terms/t/terminalvalue.asp). Because Terminal Value is based on the company’s value in perpetuity    beyond our 10-year cash flow forecast, assumptions have an incredibly large effect on the current valuation. Any sort of valuation can be justified based on any set of input growth assumptions. We try to stay  reasonable while acknowledging the upside that Airbnb does really exhibit. We show a range of cases below:\n\nhttps://preview.redd.it/m3p1i80mbk461.png?width=624&format=png&auto=webp&s=cf3f5dd4ab45530a22ac077e8c5bc23416b59726\n\n **Upside and Downside Risks:**\n\nUpside risks include higher than anticipated Bookings leading to  higher   revenue estimates. It is certainly possible we (and the market)  are  underestimated top line growth potential as Airbnb continues to  expand   domestically and abroad.\n\nAnother upside risk is profitability. Airbnb in theory should be able  to scale effectively given its business model and that the company  itself does not own or hold the properties. They provide a platform and  services, not the physical product, so as they become larger more  efficiencies   should be achieved and redundancies should be eliminated.\n\nThe main downside risks are two: valuation and regulatory issues. We  love   this company, but the valuation is simply incredibly rich and  already  at our Bull Case. A good company does not equal a good  investment if  the price is not good. However, we are not calling for  shorting this   because the market is red hot and can continue to be for  months or even   years. We are simply stating that odds are [not in your favor](https://blogs.cfainstitute.org/investor/2019/02/19/howard-marks-cfa-getting-the-odds-on-your-side/) here at this price level.\n\nAnother meaningful risk is regulatory scrutiny. Airbnb [lists what regulations apply](https://www.airbnb.com/help/article/961/what-regulations-apply-to-my-city) may to a host’s city and there has been pushback in certain [cities](https://www.nytimes.com/2019/11/05/nyregion/airbnb-jersey-city-election-results.html) and [communities](https://www.stltoday.com/news/local/govt-and-politics/new-effort-underway-to-regulate-short-term-home-rentals-in-st-louis/article_370e0012-0338-574d-8f17-38afd097f93c.html) against short-term rentals through platforms like Airbnb. Here is a list of certain [short-term rental laws](https://www.2ndaddress.com/research/short-term-rental-laws/) across the US.\n\nIf you want to download the model for free and input your own assumptions you can do so here at the bottom of the page:\n\n[http://millennialmkts.com/2020/12/10/airbnb-valuation-growth-is-expensive-in-this-market/](http://millennialmkts.com/2020/12/10/airbnb-valuation-growth-is-expensive-in-this-market/)\n\n**TLDR;** Great company, not so great valuation. If you like Airbnb, you'll love  BKNG. It's priced for perfection, but market is hot and it can stay  hot  for months or years so time will tell if/when it'll come down.", "author_fullname": "t2_4ay7zeti", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Airbnb Valuation - Growth is expensive in this market", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 80, "top_awarded_type": null, "hide_score": false, "media_metadata": {"zgc3eyeabk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 36, "x": 108, "u": "https://preview.redd.it/zgc3eyeabk461.png?width=108&crop=smart&auto=webp&s=1a30223d963a744863dd466be8f4d945c4a96fa6"}, {"y": 72, "x": 216, "u": "https://preview.redd.it/zgc3eyeabk461.png?width=216&crop=smart&auto=webp&s=a21842b090340fc0438824c057698429e8fab929"}, {"y": 107, "x": 320, "u": "https://preview.redd.it/zgc3eyeabk461.png?width=320&crop=smart&auto=webp&s=a899a1871981005852178e52aa01657570ff8714"}], "s": {"y": 209, "x": 624, "u": "https://preview.redd.it/zgc3eyeabk461.png?width=624&format=png&auto=webp&s=298b0e974f95c2b74ec900ff1d9e6856b0c6fdfb"}, "id": "zgc3eyeabk461"}, "ave4p504bk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 30, "x": 108, "u": "https://preview.redd.it/ave4p504bk461.png?width=108&crop=smart&auto=webp&s=830c21fb12303296fa4c47aae0b7e63c01cf046b"}, {"y": 60, "x": 216, "u": "https://preview.redd.it/ave4p504bk461.png?width=216&crop=smart&auto=webp&s=5a4bc0f92fd37ff120956280b0a10a60a724165d"}, {"y": 89, "x": 320, "u": "https://preview.redd.it/ave4p504bk461.png?width=320&crop=smart&auto=webp&s=4a4e14dcfaa1b2a95e0801cedf96715ce90d3594"}], "s": {"y": 175, "x": 624, "u": "https://preview.redd.it/ave4p504bk461.png?width=624&format=png&auto=webp&s=8428d25c1841c71eb27dafe2469238ea6f608238"}, "id": "ave4p504bk461"}, "q0lc324qak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 58, "x": 108, "u": "https://preview.redd.it/q0lc324qak461.png?width=108&crop=smart&auto=webp&s=0d3408be39e8315703708db883ecc2002d26dc94"}, {"y": 116, "x": 216, "u": "https://preview.redd.it/q0lc324qak461.png?width=216&crop=smart&auto=webp&s=401d8d1184b077012089bde2210e130c68a16a0d"}, {"y": 173, "x": 320, "u": "https://preview.redd.it/q0lc324qak461.png?width=320&crop=smart&auto=webp&s=ac44528026030f21345df79e8ce3f7e67898b4e5"}], "s": {"y": 338, "x": 624, "u": "https://preview.redd.it/q0lc324qak461.png?width=624&format=png&auto=webp&s=7ba72173c69f93b6a926d36b67d15fdc46e8beb2"}, "id": "q0lc324qak461"}, "lg0rycx5ak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 45, "x": 108, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=108&crop=smart&auto=webp&s=d6e46f3f89c29fe11800b46a956e5f7d10614691"}, {"y": 90, "x": 216, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=216&crop=smart&auto=webp&s=07e0b3a39f2c70d2272583b2c8adde3da87ac8b5"}, {"y": 134, "x": 320, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=320&crop=smart&auto=webp&s=8c9c4252ce16bfd1a3863268e7326b92223dba7c"}, {"y": 269, "x": 640, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=640&crop=smart&auto=webp&s=a59f4bc21041be0ceb875f11bf9bdff78ced3298"}, {"y": 403, "x": 960, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=960&crop=smart&auto=webp&s=c5cb26ce8f10cd37e64210dbe443f95d22118efd"}], "s": {"y": 424, "x": 1008, "u": "https://preview.redd.it/lg0rycx5ak461.png?width=1008&format=png&auto=webp&s=2e5632ff708ff63323fec8659eace83449205923"}, "id": "lg0rycx5ak461"}, "qd5s6uwbak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 106, "x": 108, "u": "https://preview.redd.it/qd5s6uwbak461.png?width=108&crop=smart&auto=webp&s=f7a6be247c7a7883ec3104df06ea8d4a192814d9"}, {"y": 212, "x": 216, "u": "https://preview.redd.it/qd5s6uwbak461.png?width=216&crop=smart&auto=webp&s=15d0b2fc32710bb925430214173fa5f881be24dc"}, {"y": 314, "x": 320, "u": "https://preview.redd.it/qd5s6uwbak461.png?width=320&crop=smart&auto=webp&s=ce83a6bb79711d5135f42d9bfaf5646431e15b9b"}], "s": {"y": 613, "x": 624, "u": "https://preview.redd.it/qd5s6uwbak461.png?width=624&format=png&auto=webp&s=8f31f59757384127b60bcee981d39fe6f51b4ce2"}, "id": "qd5s6uwbak461"}, "jrckxy31bk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 50, "x": 108, "u": "https://preview.redd.it/jrckxy31bk461.png?width=108&crop=smart&auto=webp&s=a433bed5b537b15200d24ff75ec76ed01f6495f6"}, {"y": 101, "x": 216, "u": "https://preview.redd.it/jrckxy31bk461.png?width=216&crop=smart&auto=webp&s=5ae7bf9b9a46233520953b56121b735a12cc4436"}, {"y": 150, "x": 320, "u": "https://preview.redd.it/jrckxy31bk461.png?width=320&crop=smart&auto=webp&s=98b9e7f6fb5a4ff5a60c760dcefc497998569177"}], "s": {"y": 257, "x": 548, "u": "https://preview.redd.it/jrckxy31bk461.png?width=548&format=png&auto=webp&s=9c9e4ea99993a2e8f07644dbfed790ac2b7d722b"}, "id": "jrckxy31bk461"}, "jfh4q0k8ak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 88, "x": 108, "u": "https://preview.redd.it/jfh4q0k8ak461.png?width=108&crop=smart&auto=webp&s=8c324e8bb8232aaa04f146d01d04ce80ac8b6f31"}, {"y": 176, "x": 216, "u": "https://preview.redd.it/jfh4q0k8ak461.png?width=216&crop=smart&auto=webp&s=8b5a2dc68b05e95415c2bdee4deb6db6af83fb83"}, {"y": 262, "x": 320, "u": "https://preview.redd.it/jfh4q0k8ak461.png?width=320&crop=smart&auto=webp&s=fba2ccb0ffa5e2eb5d44b573d8ac136970be53c9"}], "s": {"y": 511, "x": 624, "u": "https://preview.redd.it/jfh4q0k8ak461.png?width=624&format=png&auto=webp&s=e5636ed51c0c4867231b7c5d015cb98a455bf21c"}, "id": "jfh4q0k8ak461"}, "cjgmuu5gak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 32, "x": 108, "u": "https://preview.redd.it/cjgmuu5gak461.png?width=108&crop=smart&auto=webp&s=1466d30cc2ff0c30e219f74524e0a819b80ee5d3"}, {"y": 64, "x": 216, "u": "https://preview.redd.it/cjgmuu5gak461.png?width=216&crop=smart&auto=webp&s=4dc1ead4ad2446f70a544a114c120f0b75808b22"}, {"y": 95, "x": 320, "u": "https://preview.redd.it/cjgmuu5gak461.png?width=320&crop=smart&auto=webp&s=1eaff32abf365bdef651d215d6d0cc48ddcc5bb5"}], "s": {"y": 186, "x": 624, "u": "https://preview.redd.it/cjgmuu5gak461.png?width=624&format=png&auto=webp&s=7dc335ba9eb14e5cf2a93d394d12362943848213"}, "id": "cjgmuu5gak461"}, "zgld3exgak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 31, "x": 108, "u": "https://preview.redd.it/zgld3exgak461.png?width=108&crop=smart&auto=webp&s=807d6d440f0431c8d12aa154b15fe25a6e3f32eb"}, {"y": 63, "x": 216, "u": "https://preview.redd.it/zgld3exgak461.png?width=216&crop=smart&auto=webp&s=43801922dcc6dcafdcc399360ceb4a99b6888575"}, {"y": 94, "x": 320, "u": "https://preview.redd.it/zgld3exgak461.png?width=320&crop=smart&auto=webp&s=a070f5c2e2fcaec15a8891d70bde31d124dde24b"}], "s": {"y": 184, "x": 624, "u": "https://preview.redd.it/zgld3exgak461.png?width=624&format=png&auto=webp&s=a8898a508d1ffdec0acc59d243e23ea945538c74"}, "id": "zgld3exgak461"}, "o3cwgw32bk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 81, "x": 108, "u": "https://preview.redd.it/o3cwgw32bk461.png?width=108&crop=smart&auto=webp&s=eaf7487ca20e7495b9f94cb68f27c7c99e6fd780"}, {"y": 162, "x": 216, "u": "https://preview.redd.it/o3cwgw32bk461.png?width=216&crop=smart&auto=webp&s=631ab29b7c445073e23c190bd2c704835d0384f0"}, {"y": 240, "x": 320, "u": "https://preview.redd.it/o3cwgw32bk461.png?width=320&crop=smart&auto=webp&s=6011aaa4160f4802937c606e1fbf2122e0e87036"}], "s": {"y": 391, "x": 521, "u": "https://preview.redd.it/o3cwgw32bk461.png?width=521&format=png&auto=webp&s=6814c943d70ac8e5951c247875995e27c3e39d2f"}, "id": "o3cwgw32bk461"}, "l8vwl6klak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 41, "x": 108, "u": "https://preview.redd.it/l8vwl6klak461.png?width=108&crop=smart&auto=webp&s=0311de86e75b574bfacee97063011155c5276e0b"}, {"y": 83, "x": 216, "u": "https://preview.redd.it/l8vwl6klak461.png?width=216&crop=smart&auto=webp&s=ea3190c0314f11afa644e3a45f2c7812853d734a"}, {"y": 123, "x": 320, "u": "https://preview.redd.it/l8vwl6klak461.png?width=320&crop=smart&auto=webp&s=256f0bcf0c83036f3076c3f0ad6150f5be02c37f"}], "s": {"y": 240, "x": 624, "u": "https://preview.redd.it/l8vwl6klak461.png?width=624&format=png&auto=webp&s=c47266ada3851c20e505b022c3054c850715bea5"}, "id": "l8vwl6klak461"}, "40h2lhl9bk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 53, "x": 108, "u": "https://preview.redd.it/40h2lhl9bk461.png?width=108&crop=smart&auto=webp&s=1b0936b209344c21babc88ff97bffb89598a19bc"}, {"y": 106, "x": 216, "u": "https://preview.redd.it/40h2lhl9bk461.png?width=216&crop=smart&auto=webp&s=0793ddfd44af915032a042a92af5e467567e6d18"}, {"y": 157, "x": 320, "u": "https://preview.redd.it/40h2lhl9bk461.png?width=320&crop=smart&auto=webp&s=ab1269810199be177fee0cc2ce7fcbbb276b3502"}], "s": {"y": 308, "x": 624, "u": "https://preview.redd.it/40h2lhl9bk461.png?width=624&format=png&auto=webp&s=4f32a8d313aa93cee47b38d78f6ed105578f86ef"}, "id": "40h2lhl9bk461"}, "rqq5brtjbk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 28, "x": 108, "u": "https://preview.redd.it/rqq5brtjbk461.png?width=108&crop=smart&auto=webp&s=b72786ce0c8faaaa32e8f028aa1a0c7871658f6a"}, {"y": 56, "x": 216, "u": "https://preview.redd.it/rqq5brtjbk461.png?width=216&crop=smart&auto=webp&s=63770adb58f58a07c744da5dce2432859fc71885"}, {"y": 83, "x": 320, "u": "https://preview.redd.it/rqq5brtjbk461.png?width=320&crop=smart&auto=webp&s=5afba20be04fc9ace6df1d1a26e487d39ea81bcd"}], "s": {"y": 163, "x": 624, "u": "https://preview.redd.it/rqq5brtjbk461.png?width=624&format=png&auto=webp&s=131a5ef3c87d7a9556fdb5c8c2822e4626e7e8f5"}, "id": "rqq5brtjbk461"}, "u0vwzf4ibk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/u0vwzf4ibk461.png?width=108&crop=smart&auto=webp&s=539f20e4c00fca22255b1fa0f01990e5e5c1adad"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/u0vwzf4ibk461.png?width=216&crop=smart&auto=webp&s=d97e4d1560f215dfe61d43794088bf2de85a634c"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/u0vwzf4ibk461.png?width=320&crop=smart&auto=webp&s=68f45614571d08c66b7cc007984c5cba80af4134"}], "s": {"y": 278, "x": 624, "u": "https://preview.redd.it/u0vwzf4ibk461.png?width=624&format=png&auto=webp&s=5ab6c603129841215f6cde4c026ece0fff823325"}, "id": "u0vwzf4ibk461"}, "m3p1i80mbk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 43, "x": 108, "u": "https://preview.redd.it/m3p1i80mbk461.png?width=108&crop=smart&auto=webp&s=e4ce5e09eff5ff08452f35e3eb55612e20cb8da8"}, {"y": 87, "x": 216, "u": "https://preview.redd.it/m3p1i80mbk461.png?width=216&crop=smart&auto=webp&s=0a3e3305e70a7812bf1cdecd4745ffdd7aebef4e"}, {"y": 130, "x": 320, "u": "https://preview.redd.it/m3p1i80mbk461.png?width=320&crop=smart&auto=webp&s=3fcbe3f6d3f7c1777e0061646c5269272a3d219d"}], "s": {"y": 254, "x": 624, "u": "https://preview.redd.it/m3p1i80mbk461.png?width=624&format=png&auto=webp&s=cf3f5dd4ab45530a22ac077e8c5bc23416b59726"}, "id": "m3p1i80mbk461"}, "9pqh0wigbk461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/9pqh0wigbk461.png?width=108&crop=smart&auto=webp&s=0e5c54834b29f97af0588e879711ccd80c9d201e"}, {"y": 127, "x": 216, "u": "https://preview.redd.it/9pqh0wigbk461.png?width=216&crop=smart&auto=webp&s=1a99fbad142306e7cb2302e6e3b6eda86a83bc86"}, {"y": 189, "x": 320, "u": "https://preview.redd.it/9pqh0wigbk461.png?width=320&crop=smart&auto=webp&s=96da184634eff2812f9e6f5a4210a3e08567e159"}], "s": {"y": 369, "x": 624, "u": "https://preview.redd.it/9pqh0wigbk461.png?width=624&format=png&auto=webp&s=41f519e04eed800de49de37bd391f170f8207f81"}, "id": "9pqh0wigbk461"}, "zap4dhgnak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 65, "x": 108, "u": "https://preview.redd.it/zap4dhgnak461.png?width=108&crop=smart&auto=webp&s=7ca641f1f157aa3325a46ceffb7247f98866dd6a"}, {"y": 130, "x": 216, "u": "https://preview.redd.it/zap4dhgnak461.png?width=216&crop=smart&auto=webp&s=d67fb44cecdf557f3b3c2fbf11d5a795d8d2d697"}, {"y": 193, "x": 320, "u": "https://preview.redd.it/zap4dhgnak461.png?width=320&crop=smart&auto=webp&s=fed397293fa47eeb1a8dd3b96e4122a93e9cd3f9"}], "s": {"y": 377, "x": 624, "u": "https://preview.redd.it/zap4dhgnak461.png?width=624&format=png&auto=webp&s=147ce7e7e1b224cbcbaf8e2eeb54a78c1dd7e1b9"}, "id": "zap4dhgnak461"}, "8alte914ak461": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 61, "x": 108, "u": "https://preview.redd.it/8alte914ak461.png?width=108&crop=smart&auto=webp&s=0bb9e0c8bbe6a03d9111b784a5cfa69f90ffb8f4"}, {"y": 123, "x": 216, "u": "https://preview.redd.it/8alte914ak461.png?width=216&crop=smart&auto=webp&s=e95f6d92a960b5102c699c7676474362ab5e5fac"}, {"y": 183, "x": 320, "u": "https://preview.redd.it/8alte914ak461.png?width=320&crop=smart&auto=webp&s=fb59d30bb46ddb3a28a17fb820b0d04cc85f3a59"}, {"y": 366, "x": 640, "u": "https://preview.redd.it/8alte914ak461.png?width=640&crop=smart&auto=webp&s=1ec1e08a30b9304a3810ecfdc80c82716fb6fdfc"}, {"y": 550, "x": 960, "u": "https://preview.redd.it/8alte914ak461.png?width=960&crop=smart&auto=webp&s=a92b67de5fdba76a0650617dedf761e4035df811"}], "s": {"y": 587, "x": 1024, "u": "https://preview.redd.it/8alte914ak461.png?width=1024&format=png&auto=webp&s=d2688c48b7a8048876de069175f72191c2c0a0e2"}, "id": "8alte914ak461"}}, "name": "t3_kb33ut", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.91, "author_flair_background_color": null, "subreddit_type": "public", "ups": 52, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 52, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/DklfS6AYfbf_VHgK-hLOHSX99hCtoYFRSc_UuBBg5lY.jpg", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1607723350.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<ul>\n<li>AirBnb has more than <a href=\"https://news.airbnb.com/thankyou/\">4 million hosts</a>  offering private rooms in their own homes to luxury experiences, from    one night to several weeks or months. AirBnb has a presence in more  than 220 countries and regions and has served over 825 million guest  arrivals and has cumulatively earned $110bn in revenue.</li>\n<li>AirBnb intends to <a href=\"https://www.theatlantic.com/business/archive/2018/02/airbnb-hotels-disruption/553556/\">disrupt</a> the one-size-fits-all approach that was the standard for travel and    leisure. The company believes that hosting is at the center of the AirBnb experience and this focus enables guests to access unique places and experiences that were previously inaccessible.</li>\n<li>In   2019, the  company generated Gross Booking Value of $38bn, 29%  growth  y/y,  and has generated $507mm in free cash flow since inception, signifying its clear potential to cash generation in the near future.  Gross Bookings Value were down 39% y/y in the first 9 months of 2020 due  to the Covid pandemic per the  <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">company S-1.</a></li>\n<li>The company business model has shown resilience in the face of the   pandemic  with business beginning to pick up within two months of travel   shutting  down around the world per the company S-1. Domestic travel   has been especially strong and has rebounded at a rapid pace with   people choosing  to travel closer to home.</li>\n<li>The   stock is priced incredibly high,  and while we love the company and  what it’s doing, the valuation is  simply not enticing as an investor. The stock is trading near our absolute Bull Case scenario which we   outline in our valuation.</li>\n</ul>\n\n<p><strong>Business Model:</strong></p>\n\n<p>The  concept of AirBnb was born in  2007 when the two founders, Brian  and  Joe, noticed an international  conference was coming to town and  every  hotel was sold out. The  founders quickly created a website,   AirBedandBreakfast.com, and were  able to rent their apartment to the   conference attendees.</p>\n\n<p>Airbnb is the latest company to make use of the <a href=\"https://www.investopedia.com/terms/s/sharing-economy.asp\">sharing economy,</a> or the peer-to-peer economy. The business model is built on buyers  and   sellers sharing resources through collaborative consumption of  goods,   services, and of ownership. The Airbnb platform <a href=\"https://www.airbnb.com/host/homes\">provides tools</a> that make it easy to connect hosts who own houses and apartments with    guests who seek to rent them for short-term stays. Airbnb’s revenues comes from fees collected on guest rental stays with fees being  charged   on both the host and the guest side per the <a href=\"https://www.airbnb.com/host/homes\">company S-1</a>. In 2016, Airbnb added another business line with <a href=\"https://www.airbnb.com/s/experiences\">experiences</a>, but the business has been slow to gain any meaningful traction with only <a href=\"http://aswathdamodaran.blogspot.com/\">$10 million in sales in 2017</a>.</p>\n\n<p>This is a handy graphic summarizing the business model courtesy of <a href=\"http://aswathdamodaran.blogspot.com/\">Aswath Damodaran</a>.</p>\n\n<p><a href=\"https://preview.redd.it/8alte914ak461.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d2688c48b7a8048876de069175f72191c2c0a0e2\">https://preview.redd.it/8alte914ak461.png?width=1024&amp;format=png&amp;auto=webp&amp;s=d2688c48b7a8048876de069175f72191c2c0a0e2</a></p>\n\n<p>And Airbnb provides an illustrative example of the business model at work with the fees they would collect in their <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">S-1</a>. </p>\n\n<p><a href=\"https://preview.redd.it/lg0rycx5ak461.png?width=1008&amp;format=png&amp;auto=webp&amp;s=2e5632ff708ff63323fec8659eace83449205923\">https://preview.redd.it/lg0rycx5ak461.png?width=1008&amp;format=png&amp;auto=webp&amp;s=2e5632ff708ff63323fec8659eace83449205923</a></p>\n\n<p><strong>Hosts:</strong></p>\n\n<p>As of September 30, 2020, AirBnb had <a href=\"https://news.airbnb.com/thankyou/\">4 million hosts</a>  around the world, with 86% of hosts outside the United States, and 7.4    million available listings of homes and experiences, 5.6 million of   which were active listings per the <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">company S-1</a>.   Per the company, “We consider a listing of a home or an experience  tobe an active listing if it is viewable on Airbnb and has been   previously booked at least once on Airbnb.”</p>\n\n<p>Hosts generally fall into two categories – individual and <a href=\"https://www.airbnb.com/d/host_pro\">professional.</a> Individual hosts activate their listings directly on the Airbnb    platform through the website or app. Professional hosts in contrast run    their own property management or hospitality business and use programs    to list their properties on the Airbnb platform. As of December 31,  2019, 90% of hosts were individual hosts and 72% of nights booked were    with individual hosts per the <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">company S-1</a>. Individual hosts are the core component and key supply for Airbnb.</p>\n\n<p>Airbnb provides a number of services to enable their 4 million hosts. Anyone <a href=\"https://www.airbnb.com/host/homes?af=43720035&amp;c=.pi0.pk37076538223_185707635826_c_141022032497&amp;gclid=CjwKCAiAq8f-BRBtEiwAGr3DgW9my6otYP6hT1Yr5gQAFtISRM1zMA7k0KbUXYnB7wIFE1cdiLkoHhoCoK8QAvD_BwE\">can become a successful host</a> on the Airbnb platform and Airbnb is able to provide a number of services per the <a href=\"https://www.airbnb.com/host/homes?af=43720035&amp;c=.pi0.pk37076538223_185707635826_c_141022032497&amp;gclid=CjwKCAiAq8f-BRBtEiwAGr3DgW9my6otYP6hT1Yr5gQAFtISRM1zMA7k0KbUXYnB7wIFE1cdiLkoHhoCoK8QAvD_BwE\">S-1</a> including:</p>\n\n<p><a href=\"https://preview.redd.it/jfh4q0k8ak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=e5636ed51c0c4867231b7c5d015cb98a455bf21c\">https://preview.redd.it/jfh4q0k8ak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=e5636ed51c0c4867231b7c5d015cb98a455bf21c</a></p>\n\n<ul>\n<li>Global demand: Anyone with an internet connection can book an Airbnb experience from anywhere in the world</li>\n<li>Merchandising: Airbnb helps hosts create and activate their listings on the  platform. By taking hosts step-by-step through the process, Airbnb is  able to  make  posting effective and easy.</li>\n<li>Pricing:  Hosts can set their own  prices, but Airbnb does provide smart pricing  tools that suggest prices  based on changes in demand for other similar listings based on factors like the season and expected demand.</li>\n<li>Scheduling:   Hosts can  easily manage their calendars and accept and manage their  listings and  reservations on the platform through the website or app.</li>\n<li>Payments:  Airbnb facilitates all payments by collecting payments from guests and    processing the payments to hosts. In 2019, Airbnb processed  approximately $70bn of guest and host transactions.</li>\n</ul>\n\n<p>Airbnb also provides services like community support, host protections, posted reviews and feedback, and a superhost program.</p>\n\n<p><strong>Key metrics and Covid resilience:</strong></p>\n\n<p>According to the company <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">S-1 filing</a>, the majority of guests who have ever made a booking on Airbnb were  between the ages of 18-34. In 2019, 54 million active bookers worldwide  booked 327 million nights and experiences on the platform.</p>\n\n<p><a href=\"https://preview.redd.it/qd5s6uwbak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=8f31f59757384127b60bcee981d39fe6f51b4ce2\">https://preview.redd.it/qd5s6uwbak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=8f31f59757384127b60bcee981d39fe6f51b4ce2</a></p>\n\n<p>Nights and experiences booked are a key measure of the true scale of  the Airbnb platform. Per the company S-1, “Nights and Experiences Booked  on our platform in a period represents the sum of the total number of  nights booked for stays and  the total number of seats booked for  experiences, net of cancellations and alterations that occurred in that  period.”</p>\n\n<p>In   2019, Airbnb had 326.9 mm Nights and Experiences booked, a 31% increase from the 250.3 mm in 2018, which grew 35% from 2017. Typically,    the first, second, and third quarters of the year each have higher Nights and Experiences Booked compared to the fourth quarter, as guests  travel during the peak travel season, which is in the third quarter  for   North America and EMEA according to the company S-1.</p>\n\n<p>Covid has obviously <a href=\"https://www.ahla.com/covid-19s-impact-hotel-industry\">had an effect</a> on the hotel industry, and Airbnb is not immune with 2020 being a down    year and Q2 being particularly severe across several key metrics. However, the business model has shown resilience and management attributes this to the renewed ability and willingness of guests to travel. I know personally I’m looking at Airbnb’s in warmer climates as I’m itching to get out of the cold and soon to be lock downed  northeast US.</p>\n\n<p><a href=\"https://preview.redd.it/cjgmuu5gak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=7dc335ba9eb14e5cf2a93d394d12362943848213\">https://preview.redd.it/cjgmuu5gak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=7dc335ba9eb14e5cf2a93d394d12362943848213</a></p>\n\n<p>For the nine months ended Sept 30,   2020, the company had 146.9 mm  Nights and Experiences Booked, a   decrease of 41% compared to the prior year period according to the <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">company S-1</a>.    However, the decline was most severe in the second quarter and   business  has rebounded with Q3 being down only 28% y/y. The company   credits this  improvements primarily to stronger results in North   America and Europe  and in particular to resilience in domestic and   short-distance travel.</p>\n\n<p>Gross   Bookings value is defined in the S-1 as “the dollar  value of  bookings  on our platform in a period and is inclusive of host  earnings,  service  fees, cleaning fees, and taxes, net of cancellations  and  alterations  that occurred during that period.” Growth in Gross Bookings Value  reflects the company’s ability to attract and retain hosts and guests   and  reflects growth in Nights and Experiences booked. In 2019, Gross  Bookings Value grew 29%  y/y and 2018 grew 40% y/y.</p>\n\n<p><a href=\"https://preview.redd.it/zgld3exgak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=a8898a508d1ffdec0acc59d243e23ea945538c74\">https://preview.redd.it/zgld3exgak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=a8898a508d1ffdec0acc59d243e23ea945538c74</a></p>\n\n<p>In 2020, there is a similar drop in  Gross Bookings due to the Covid pandemic.  For the first nine months  ended Sept 30 2020 Gross Bookings was $18bn, a 39%  decrease from the  prior year period  according to the S-1. The decline  was once again  most severe in Q2 and  Q3 rebounded, being down only 17%  y/y.</p>\n\n<p>In   2019, Gross Bookings and revenue by region were about equal between  Europe, Middle East, and Africa and  for  North America. However, as a  result of the pandemic, Gross Bookings and revenue have reflected a  shift toward North America where the recovery has been strongest.   “For  the first nine months of 2020, Gross Bookings Value was $9.7 billion,  or 54% of the total, in North America compared to $5.6 billion, or 31%,  in Europe, Middle East, and Africa, $1.6 billion, or 9%, in Asia  Pacific, and $1.1 billion, or 6%, in Latin   America” – company S-1</p>\n\n<p><a href=\"https://preview.redd.it/l8vwl6klak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=c47266ada3851c20e505b022c3054c850715bea5\">https://preview.redd.it/l8vwl6klak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=c47266ada3851c20e505b022c3054c850715bea5</a></p>\n\n<p>Historically, Airbnb has had a strong weight toward cross-border travel,  with 49% of nights in 2019 compared to management’s estimate of 20% of total overnight paid trips for the travel industry as a whole according  the company S-1. However, the pandemic has marked a shift to  domestic travel in Airbnb’s traditional travel corridor mix. In   September 2020, 77% of experiences booked were domestic compared to 52%  in January. In  fact, domestic bookings have grown at a rapid clip with   54% growth in  June 2020 and 35% growth in September 2020. </p>\n\n<p><a href=\"https://preview.redd.it/zap4dhgnak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=147ce7e7e1b224cbcbaf8e2eeb54a78c1dd7e1b9\">https://preview.redd.it/zap4dhgnak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=147ce7e7e1b224cbcbaf8e2eeb54a78c1dd7e1b9</a></p>\n\n<p>Clearly, Airbnb is well-positioned because of its wide offering to cater   shifting consumer travel habits and this has enabled the company to be  more resilient in a downturn than travel competitors, in some metrics even being able to achieve grow. If we look at hotel and travel booking competitors, we see that Airbnb has weathered the pandemic much  better   than most peers when looking at 9 months ended Sept 30 2020 revenue. Airbnb revenue is down -31.9% so far in 2020 compared to the  median hotel revenue being down -48.2% and travel bookings being down  -53.3%.  Airbnb has also bounced back faster than every competitor minus  <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1046311/000104631120000041/chh-10q09302020.htm\">CHH</a> in Q3 with revenues down -18.4% compared to the 50.9% median for hotels and -52.7% for travel bookings companies. </p>\n\n<p><a href=\"https://preview.redd.it/q0lc324qak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=7ba72173c69f93b6a926d36b67d15fdc46e8beb2\">https://preview.redd.it/q0lc324qak461.png?width=624&amp;format=png&amp;auto=webp&amp;s=7ba72173c69f93b6a926d36b67d15fdc46e8beb2</a></p>\n\n<p><strong>TAM and growth strategy:</strong></p>\n\n<p>Management highlights massive market opportunities in its <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">S-1 filing,</a>  “We have a substantial market opportunity in the growing travel market    and experience economy. We estimate our serviceable addressable market    (“SAM”) today to be $1.5 trillion, including $1.2 trillion for   short-term stays and $239 billion for experiences. We estimate our total addressable market (“TAM”) to be $3.4 trillion, including $1.8   trillion  for short-term stays, $210 billion for long-term stays, and   $1.4 trillion for experiences.<em>”</em></p>\n\n<p>In   general, these assumptions are based on the belief that new travel   behaviors will expand the market opportunity over time as well as the need to justify a large market cap. Management uses their own internal    estimates to come up with the $1.2trn for short-term stays and <a href=\"https://www.euromonitor.com/usa\">Euromonitor</a>estimates of tourist spend on attractions and experiences to estimate  the $239mm for Experiences. To get the TAM short-term stays estimate, management assumes an increase in trips per capita based on The World    Travel and Tourism Council <a href=\"https://wttc.org/Research/Economic-Impact\">estimated 3.5% CAGR</a>.   For long-term stays, the company uses 10% of the $1.6trn global residential rental market. And for experiences, they add $1.1trn of   non-tourist recreational spend, again as estimated by <a href=\"https://www.euromonitor.com/usa\">Euromonitor</a>.</p>\n\n<p><a href=\"https://preview.redd.it/jrckxy31bk461.png?width=548&amp;format=png&amp;auto=webp&amp;s=9c9e4ea99993a2e8f07644dbfed790ac2b7d722b\">https://preview.redd.it/jrckxy31bk461.png?width=548&amp;format=png&amp;auto=webp&amp;s=9c9e4ea99993a2e8f07644dbfed790ac2b7d722b</a></p>\n\n<p>In its early stages when it was a <a href=\"https://millennialmkts.com/Users/danie/AppData/Local/Temp/startup%20pitching%20to%20VCs%20back%20in%202009\">startup pitching to VCs back in 2009.</a>  Airbnb estimated the TAM to be 2 billion+ trips a year and its SAM to be 560mn trips a year. </p>\n\n<p><a href=\"https://preview.redd.it/o3cwgw32bk461.png?width=521&amp;format=png&amp;auto=webp&amp;s=6814c943d70ac8e5951c247875995e27c3e39d2f\">https://preview.redd.it/o3cwgw32bk461.png?width=521&amp;format=png&amp;auto=webp&amp;s=6814c943d70ac8e5951c247875995e27c3e39d2f</a></p>\n\n<p>Another way to look at Airbnb’s TAM is to look at the hotel business globally. According to NYU professor <a href=\"http://aswathdamodaran.blogspot.com/\">Aswath Damodaran’s Airbnb analysis</a>.    The industry generated over $600bn in revenues in 2019, but its  growth   has stalled and the industry remains concentrated among the top  5  hotel  chains. The US is the leading geographical market, but Asia  has  been gaining ground. </p>\n\n<p><a href=\"https://preview.redd.it/ave4p504bk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=8428d25c1841c71eb27dafe2469238ea6f608238\">https://preview.redd.it/ave4p504bk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=8428d25c1841c71eb27dafe2469238ea6f608238</a></p>\n\n<p>The truth is Airbnb’s TAM, and we   agree with Damodaran’s analysis  here, is probably somewhere in between  these two numbers. Ignoring  Airbnb’s experiences portion of the TAMcalculation because that  business line is nascent at best, we get a upper estimate of $2trn and a  lower estimate of $600bn for Airbnb’s   TAM.</p>\n\n<p><strong>Peers:</strong> </p>\n\n<p>We   identify comparable peers to get a sense of Airbnb’s valuation and   how  in-line it is with the industry, while also keeping in mind Airbnb   is  growing faster and attempting to disrupt the hotel and travel  booking   industries. Current Hotel comparable peers are trading at a median of 4.1x 2021 sales and 2.0x 2022 sales according to <a href=\"https://www.bloomberg.com/professional/solution/bloomberg-terminal/\">Bloomberg</a>  Analyst Consensus estimates, while Airbnb’s IPO price implies – 18.45x  and 15.33x Sales based on our own estimates of 2021 and 2022 sales,    respecivetly. The EBITDA comparison is tough to make with Airbnb because    we estimate they will be EBITDA negative in 2021, and the EBITDA in    2022 and 2023 will be $130mm and $370mm leading to high multipliers. We    can see that the median hotel company is trading at 22.3x 2021   estimated  EBITDA and 13.9x 2022 estimated EBITDA according to Bloomberg    consensus.</p>\n\n<p>However, perhaps a   more apt comparison is looking at online travel  booking peers such as   Expedia (EXPE) and Booking.com (BKNG). The EV /  Sales and EV / EBITDA are slightly higher for this comparable group vs  the pure hotels peers,   primarily due to Booking.com. The median among  this group trade at   4.5x 2021 sales and 3.4x 2022 sales according to  Bloomberg consensus.</p>\n\n<p><a href=\"https://preview.redd.it/40h2lhl9bk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=4f32a8d313aa93cee47b38d78f6ed105578f86ef\">https://preview.redd.it/40h2lhl9bk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=4f32a8d313aa93cee47b38d78f6ed105578f86ef</a></p>\n\n<p>Is the Airbnb premium justified? One   can argue a more resilient  business model, the promise of fast growth, and large market opportunities created by disruption and innovation may make the premium  seem reasonable when we try to compare the  company to  peer groups. There  truly is only one Airbnb and these peer  groups aren’t entirely  indicative of the future company profile of  Airbnb.</p>\n\n<p><strong>Valuation:</strong></p>\n\n<p>Setting the stage for the valuation, we take a look at Airbnb’s <a href=\"https://craft.co/airbnb/funding-rounds\">Venture Capital pricing in</a> the rounds leading up to the IPO. We can see that the company has    raised $5.8bn in VC funding and it’s latest Series F round in 2016. In  April 2020 the company was valued <a href=\"https://www.reuters.com/article/us-airbnb-debt/airbnbs-new-1-billion-investment-comes-at-lower-valuation-sources-idUSKBN21P3IM\">at $18bn</a>.</p>\n\n<p><a href=\"https://preview.redd.it/zgc3eyeabk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=298b0e974f95c2b74ec900ff1d9e6856b0c6fdfb\">https://preview.redd.it/zgc3eyeabk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=298b0e974f95c2b74ec900ff1d9e6856b0c6fdfb</a></p>\n\n<p>The IPO has clearly priced in a lot   of generous assumptions as well  as simple speculation with a hot   market. Initially, Airbnb planned to  sell shares for a range of <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520306257/d81668ds1a.htm\">$44-$50 per share</a> in a filing made December 1. Then on December 7, they announced plans to sell shares for a range of <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520311265/d81668ds1a.htm\">$56 – $60.</a> The company then priced their IPO at <a href=\"https://www.wsj.com/articles/airbnb-expected-to-price-ipo-above-56-to-60-a-share-range-11607527468\">$68 a share</a> on Wednesday, December 9. Shares opened trading at around $150 and ended the day at $144.71.</p>\n\n<p>Here’s some <a href=\"https://themarketear.com/posts/coBkK-wxO2\">institutional investor background</a>   on how this IPO is being looked at, &quot;Sanford  Bernstein ran a  Procensus investor survey to compile major talking  points. ~100   investors participated. Consensus  suggests Airbnb delivers a +16%  revenue CAGR in the next  decade with  steady state margins at ~25%.  Bulls will argue the IPO price  range (now indicating near ~$60) is reasonable”</p>\n\n<p>+16%  Revenue CAGR  seems somewhat reasonable to us, so the biggest assumption in question  really is the ~25% margins in our view. With that being said, and trying  to remain reasonable from an assumptions stand   point, here are our  main assumptions:</p>\n\n<ul>\n<li>In  2020 Airbnb Bookings will be down ~34%, but Airbnb will have a  bounce   back year in 2021, with high Bookings growth in 2022-2025, and   Bookings  growth slowing in 2026-2030. Our Base case in Bookings growth   is shown  below.</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/9pqh0wigbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=41f519e04eed800de49de37bd391f170f8207f81\">https://preview.redd.it/9pqh0wigbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=41f519e04eed800de49de37bd391f170f8207f81</a></p>\n\n<ul>\n<li>Revenues   as a % of Bookings will continue to increase  in the future as the new   host model for professional hosts and  Experiences business gain steam   and a larger % of Airbnb Bookings.  Revenue as a % of Bookings was <a href=\"https://www.sec.gov/Archives/edgar/data/1559720/000119312520294801/d81668ds1.htm\">12.6% in 2019</a> and we estimate it will be around 14.6% in 2025 for example.</li>\n<li>Operating    costs will continue to decrease as a % of revenue as Airbnb continues    to grow in scale. This continuing growth in scale culminates in a  high   single digit operating margin by 2025 and a 27.1% operating  margin by   2030. This is lower than Booking’s (BKNG) operating margin  of <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1075531/000107553120000011/bkng1231201910k.htm\">35.5% in 2019</a>, but higher than hotel operators such as <a href=\"https://www.sec.gov/ix?doc=/Archives/edgar/data/1524358/000152435820000011/a2019q410-kdocument.htm\">Marriott’s</a> (VAC) or 17.4% <a href=\"https://www.sec.gov/Archives/edgar/data/1468174/000146817420000015/0001468174-20-000015-index.htm\">Hyatt</a> (H), 9.1% respectively in 2019.</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/u0vwzf4ibk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=5ab6c603129841215f6cde4c026ece0fff823325\">https://preview.redd.it/u0vwzf4ibk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=5ab6c603129841215f6cde4c026ece0fff823325</a></p>\n\n<p>Taking a look into future revenue growth scenarios with revenues  increasing as a % of Bookings and Bookings growth, we get a range of potential 2025 revenues. We think anywhere from $11bn to $13.7bn in revenue is the likeliest scenario for Airbnb in 2025. </p>\n\n<p><a href=\"https://preview.redd.it/rqq5brtjbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=131a5ef3c87d7a9556fdb5c8c2822e4626e7e8f5\">https://preview.redd.it/rqq5brtjbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=131a5ef3c87d7a9556fdb5c8c2822e4626e7e8f5</a></p>\n\n<p>Using a discounted cash flow model with a <a href=\"https://www.investopedia.com/terms/w/wacc.asp\">Weighted Average Cost of Capital</a> of 8% and a <a href=\"https://www.investopedia.com/terms/p/perpetuity.asp\">perpetual growth rate</a> of 3%, we get a Base Case price of $77.40.</p>\n\n<p>What’s interesting in our valuation is that the vast majority of value in Airbnb is from the <a href=\"https://www.investopedia.com/terms/n/npv.asp\">Net Present Value</a> of the <a href=\"https://www.investopedia.com/terms/t/terminalvalue.asp\">terminal value</a>. Because Terminal Value is based on the company’s value in perpetuity    beyond our 10-year cash flow forecast, assumptions have an incredibly large effect on the current valuation. Any sort of valuation can be justified based on any set of input growth assumptions. We try to stay  reasonable while acknowledging the upside that Airbnb does really exhibit. We show a range of cases below:</p>\n\n<p><a href=\"https://preview.redd.it/m3p1i80mbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=cf3f5dd4ab45530a22ac077e8c5bc23416b59726\">https://preview.redd.it/m3p1i80mbk461.png?width=624&amp;format=png&amp;auto=webp&amp;s=cf3f5dd4ab45530a22ac077e8c5bc23416b59726</a></p>\n\n<p><strong>Upside and Downside Risks:</strong></p>\n\n<p>Upside risks include higher than anticipated Bookings leading to  higher   revenue estimates. It is certainly possible we (and the market)  are  underestimated top line growth potential as Airbnb continues to  expand   domestically and abroad.</p>\n\n<p>Another upside risk is profitability. Airbnb in theory should be able  to scale effectively given its business model and that the company  itself does not own or hold the properties. They provide a platform and  services, not the physical product, so as they become larger more  efficiencies   should be achieved and redundancies should be eliminated.</p>\n\n<p>The main downside risks are two: valuation and regulatory issues. We  love   this company, but the valuation is simply incredibly rich and  already  at our Bull Case. A good company does not equal a good  investment if  the price is not good. However, we are not calling for  shorting this   because the market is red hot and can continue to be for  months or even   years. We are simply stating that odds are <a href=\"https://blogs.cfainstitute.org/investor/2019/02/19/howard-marks-cfa-getting-the-odds-on-your-side/\">not in your favor</a> here at this price level.</p>\n\n<p>Another meaningful risk is regulatory scrutiny. Airbnb <a href=\"https://www.airbnb.com/help/article/961/what-regulations-apply-to-my-city\">lists what regulations apply</a> may to a host’s city and there has been pushback in certain <a href=\"https://www.nytimes.com/2019/11/05/nyregion/airbnb-jersey-city-election-results.html\">cities</a> and <a href=\"https://www.stltoday.com/news/local/govt-and-politics/new-effort-underway-to-regulate-short-term-home-rentals-in-st-louis/article_370e0012-0338-574d-8f17-38afd097f93c.html\">communities</a> against short-term rentals through platforms like Airbnb. Here is a list of certain <a href=\"https://www.2ndaddress.com/research/short-term-rental-laws/\">short-term rental laws</a> across the US.</p>\n\n<p>If you want to download the model for free and input your own assumptions you can do so here at the bottom of the page:</p>\n\n<p><a href=\"http://millennialmkts.com/2020/12/10/airbnb-valuation-growth-is-expensive-in-this-market/\">http://millennialmkts.com/2020/12/10/airbnb-valuation-growth-is-expensive-in-this-market/</a></p>\n\n<p><strong>TLDR;</strong> Great company, not so great valuation. If you like Airbnb, you&#39;ll love  BKNG. It&#39;s priced for perfection, but market is hot and it can stay  hot  for months or years so time will tell if/when it&#39;ll come down.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 80, "id": "award_8352bdff-3e03-4189-8a08-82501dd8f835", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Everything is better with a good hug", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Hugz", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kb33ut", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "2021mba_throwaway", "fullname": "t2_4ay7zeti"}, "discussion_type": null, "num_comments": 20, "send_replies": false, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/", "subreddit_subscribers": 1690956, "created_utc": 1607694550.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 51, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfe38j8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "whitehypeman", "fullname": "t2_7gxjpyxk"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb33ut", "score": 51, "author_fullname": "t2_7gxjpyxk", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Adderall is a hell of a drug", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Adderall is a hell of a drug</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfe38j8/", "num_reports": null, "locked": false, "name": "t1_gfe38j8", "created": 1607723497.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607694697.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfeu7rg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "waterfrog987654321", "fullname": "t2_8o9s9ghl"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gfe38j8", "score": 4, "author_fullname": "t2_8o9s9ghl", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Nah, i just had to scroll for 10 seconds. This dude is straight on meth.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Nah, i just had to scroll for 10 seconds. This dude is straight on meth.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfeu7rg/", "num_reports": null, "locked": false, "name": "t1_gfeu7rg", "created": 1607736524.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607707724.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 43, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfe3h3q", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Rrrrandle", "fullname": "t2_5xbrca8f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb33ut", "score": 43, "author_fullname": "t2_5xbrca8f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Holy shit I had to scroll further then I do on pornhub just to get to the good stuff.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Holy shit I had to scroll further then I do on pornhub just to get to the good stuff.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfe3h3q/", "num_reports": null, "locked": false, "name": "t1_gfe3h3q", "created": 1607723647.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607694847.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfe6hzj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Adamn27", "fullname": "t2_utirq"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb33ut", "score": 6, "author_fullname": "t2_utirq", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Translation to retard speech?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Translation to retard speech?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfe6hzj/", "num_reports": null, "locked": false, "name": "t1_gfe6hzj", "created": 1607725435.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607696635.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": "57c0331a-0d2e-11ea-86f4-0ef7601af6ab", "likes": null, "user_reports": [], "saved": false, "id": "gfe78af", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "CumFlakess", "fullname": "t2_4tayr4tl"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gfe6hzj", "score": 8, "author_fullname": "t2_4tayr4tl", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Stonks go up", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "FTFY"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Stonks go up</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfe78af/", "num_reports": null, "locked": false, "name": "t1_gfe78af", "created": 1607725849.0, "author_flair_text": "FTFY", "treatment_tags": [], "created_utc": 1607697049.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "#ff4500", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb33ut", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfe9ga6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "scientistthrowaway23", "fullname": "t2_iyfpe"}, "can_mod_post": false, "created_utc": 1607698306.0, "send_replies": true, "parent_id": "t1_gfe78af", "score": 8, "author_fullname": "t2_iyfpe", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "OK I buy", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>OK I buy</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb33ut/airbnb_valuation_growth_is_expensive_in_this/gfe9ga6/", "num_reports": null, "locked": false, "name": "t1_gfe9ga6", "created": 1607727106.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}