{"approved_at_utc": null, "selftext": "*Build your opponent a golden bridge to retreat across.*\n\n**Sun Tzu, Art of War**\n\n*Everything was for tomorrow, but tomorrow never came. The present was only a bridge and on this bridge they are still groaning, as the world groans, and not one idiot ever thinks of blowing up the bridge.*\n\n**Henry Miller, Tropic of Capricorn**\n\n*I was wrong! Blow the bridge! Blow the fucking bridge!*\n\n**Tugg Speedman, Tropic Thunder**\n\nHello again GME Gang! It’s been a while since I last ranted at you, but I know we’ve been in some very good hands here at WSB with all the great DD folks have posted over the past few weeks. So no need for CPT Hubbard go for 11 again on the Thumbscroll Dial (until today, that is). I’ve enjoyed a lot of these posts very much, so thank you on behalf of myself and the attention-deficient Rocket Children for continuing to deliver that 100% Chaff-Free GME-grade Wheat at such a feverish clip.\n\nNow, I am going to get to Hong Kong’s [Lamest Outlaw](https://www.scmp.com/business/money/investment-products/article/2009448/hong-kong-finds-citron-researchs-andrew-left) and his disconcertingly vacant eyes here shortly. But first I want to take you on a journey back to Christmas Eve, in the year of our lord 2020—a heady time in all our lives. We were all so young and innocent then, weren’t we? Fresh off the run up to 22. Blissfully oblivious that we were living in the last moments where the question What is The War of 1812? was the only acceptable Jeopardy question for the answer: The Last Time the Goddamn U.S. Capitol Was Stormed. This was also before we all became irresponsibly overleveraged in Cathie Wood’s Ornamental Gourds ETF. It was a wondrous, confusing time.\n\nBut before we get too off topic, let’s all hop in my 1985 DeLorean (purchased with proceeds from my Jan 15 calls – thanks RC!), fire up the ol’ Flux Capacitor, and get that shit to 88 because something happened that evening that is Worth Pondering—particularly in light of recent events. And just as a friendly reminder: even though you’re going back in time in a DeLorean, no one here has to deviate funds away from GME shares to Save the Clock Tower and you are under no obligation to fulfill a scenario where you wind up making out with your Mom (unless your Mom is Cathie Wood like mine—in which case maybe just some quick over-the-clothes stuff).\n\n**On the Subject of How It Once ‘Twas The Night Before Christmas**\n\nSo what in the holy fuck happened on the night before Christmas, Captain? Well, while all you Gentiles were sleeping soundly after lying to your children about benign home intruders and before gorging yourself on the teat of late-stage capitalism, me and the rest of the Chosen People were up late eating Chinese food and thinking about tendies (self-hating Jew Joke! Ba-zing!). But then: when out on the electric twitter machine there arose such a clatter, I sprang to my phone to see what was the matter. And what to my wondering eyes did appear, a mysterious tweet from a Rich-Ass Viking who had a lot of fucking interesting things to say about this whole GME situation that’s what.\n\nThis tweet, buried as a reply to a tweet sent by Mr. Rod Alzmann (@RodAlzmann or [u/Uberkikz11](https://www.reddit.com/u/Uberkikz11/)), simply said: “Merry Christmas. Shhh.” But it included this screen shot:\n\n\\[\\*\\*Image Deleted Due to the Mods - check the link below where someone transcribed it - I'll try to add later\\*\\*\\]\n\nNow, this tweet to Rod, sent late at night and likely after a strong Mead or three, was very promptly deleted. But your intrepid cub reporter saw this here tweet that night with his own two eyes—seeing as I am a degenerate GME addict and devoted follower of Mr. Rod Alzmann (Hi Rod!). And I took screenshots, of course, like any responsible records custodian might. And so did the dude who wrote a somewhat-overlooked WSB post on this, which included the most pertinent text of the message if you are having trouble reading it here:\n\n[https://www.reddit.com/r/wallstreetbets/comments/kk0omp/christmas\\_miracle\\_gamergate\\_2020\\_gme\\_shorts/](https://www.reddit.com/r/wallstreetbets/comments/kk0omp/christmas_miracle_gamergate_2020_gme_shorts/)\n\nNow, what are we to make of this? At the time, I thought it was very interesting. But I did not give it too much attention seeing as how the internet is overcrowded with anonymous weirdos claiming to know more than they do about all sorts of subjects (and now I feel your judging eyes…). Also, there was some very good commentary in that WSB post from some sharp folks about the screenshot author’s questionable use of the shorthand PE/IB—given that private equity and investment banks wouldn’t apparently be involved in a behind-the-scenes transaction with the short funds like what was being discussed there (don’t ask me, I just string together silly words here). But maybe you poke around his [Twitter](https://twitter.com/KjetillStjerne) a bit and see for yourself.\n\nStill, plausibility assessments based on preferred nomenclature aside, it seemed to me that some version of that conversation **had** to be taking place behind the scenes in a situation like this—given the batshit insane short interest, the funds supposedly involved, and the rapid rise in SP coinciding with RC’s share accumulation, December 21st amended 13D filing, and new status as a GME Insider and Board member (just love saying all that in a row, don’t you?).\n\nSo the Viking’s screenshot tweet, and the very likely possibility that shorts are in so deep that they’re attempting to negotiate peace with large shareholders behind the scenes, stuck in my tiny little baby brain as a pretty plausible set of scenarios. And from the look of it, it seems like some funds were at least willing to discuss offering these shorts a Golden Bridge away from Certain Fucking Destruction on the open market. And if the words on the screenshot are at all aligned with reality, these short funds have no good options. Yet it seems like they are still playing hardball to negotiate the carat on this generous bridge offer they’re getting. Why? Maybe they’ve been getting high on their own supply for so long and they don’t know how to see this situation for what it is. Who knows? Maybe there is no Ryan Cohen and we’re all living in a simulation. But if the recent low-rent anti-GME articles and market manipulation efforts we’re seeing are any indication, these overleveraged short fuckers seem to think they’re going to be able to spin out of this hold and drive the SP back down to even *smaller* peanuts than it’s at now by sheer force of will (and some deployment of well-honed tricks of the trade *amirite*?) to emerge unscathed. Or even victorious? I dunno—it’s their delusional fantasy sequence.\n\nBut do you know what this scenario reminds me of? And this is just coming to me so please bear with me as I’m not showing this to my editor before we print (I haven’t seen this movie in ages – don’t know what made me think of this!). Fuck it, I’m just gonna start riffing here. The shorts trying to thread this needle, against all odds and logic and common sense, reminds me of that hilarious scene in Dumb and Dumber where haplessly delusional Jim Carrey thinks he has a chance with Mary Samsonite Swanson. But the scene is funny because he really doesn’t. Have any chance. At all.\n\nNow, I know this is a 1990s movie originally released on VHS that we haven’t seen or seen it referenced in ages. But now that you’re thinking of it again after all this time, doesn’t it remind you of this too? I know, I get it: You’d have to have fucking peanuts for brains for it not to.\n\n**On the Subject of the Continued Internet Bumbling of Mr. Justin Dopierala**\n\nNow that screenshot came to mind this past week when something kind of weird happened while we were all enjoying our quick rocket ship ride. And yes, we are briefly going to talk again about Seeking Alpha’s second finest pro-GME author (always been more of a Dmitriy man myself) and recurring CPT Hubbard character, Justin Dopierala (and no, Angela, I do not want to have like 10,000 of his babies).\n\nLast Thursday, after we were all virtually high-fiving one another and counting our future Lambos, Mr. Justin Dopierala, head of Domo Capital and longstanding uber-bull GME shareholder and author at Seeking Alpha (last seen arguing pithily with our own Rod Alzmann about the conservative nature of Rod’s holiday earnings projections. Hi again Rod!), made it known that he sold all of Domo Capital’s 500,000 shares for around $42.50—at the very top of the run up last Thursday morning.\n\nNow, Domo Capital’s business decisions are none of my goddamn business. And there are plenty of market opportunities right now. Shit, I hear there is even a new Cathie Wood Gourd ETF coming online soon that people are really excited about and that I’m sure Justin’s clients would find intriguing. But Domo’s decision to sell seemed curious given a few things: (1) on Wednesday, when the rocket is mid-flight, he got a twitter follow from Gabe Plotkin, head of Melvin Capital, which he promptly tweeted about with a “get a load of this fuckin’ guy” vibe (oh the sweet, intoxicating arrogance of tendie victory, I too love it so); (2) he had also tweeted that day comparing GME’s rise to Apron’s short squeeze that lasted 4 days—where he also stressed to his followers that Apron had a *much lower* SI than GME; and (3) he then promptly **deleted** all of these tweets and almost everything else GME-related on Thursday after apparently introducing 500,000 shares of liquidity into the height of a stressed market up and through the Thursday reversal and to his own personal tendie town.\n\nNow, after seeing all this, I mouthed off a bit to Justin on the electric twitter machine because that’s kind of my thing. And if you are familiar with my prior ramblings, you know that he and I go way back. In response, Justin talked a bit of shit about your intrepid cub reporter here in a comment on Dimitry Kozin’s October 21, 2020 Article about a possible Sony Revenue Share deal or something, the comment section of which has become the preferred SA water cooler over there. (And I can’t link that because Thems The Rulez). And Justin hurt my little feelings a bit with very sharp denial. And by all means have at it over there to check out his comment about why he sold if you give a shit. That is if Justin hasn’t deleted it yet. Free country and all.\n\nBut to summarize, on the subject of treacherous coordination with Melvin Capital, Justin said he would not could not in a boat and he would not could not with a goat. And I for one believe him. And do you know why? Because even though Justin seems like a very smart guy in some ways, he’s also a well-known internet bumbler who blurts out things to his internet friends that a person with better self-control would keep to themselves. And so I do not think he is capable of pulling that off or keeping a secret like that. Also: he said he didn’t so I am more than willing to give someone the benefit of any doubt in that area and you should too. I think we keep Hanlon’s razor firmly in mind here about never attributing to malice that which is explained by stupidity. That is unless, of course, you’re Andrew Left and you’re actually trying to convince people that you didn’t realize there was a US presidential inauguration planned for the same time you announced your Super Important TeeVee Yammerfest ‘21 about GME not being a good candidate for an imminent short squeeze no way no how not if my name isn’t Andrew Left short seller expert extraordinaire and Hong Kong’s Most Misunderstood Ethically-Minded Businessman. You can ascribe the fuck out of malice to that one.\n\nNo, even though I really have no idea, I think the most likely thing that happened there was that Gabe Plotkin, Master of the Universe, Head of Melvin Capital, and Acolyte of Perennial Most Ethical Business Man MVP candidate, Steven Cohen—got into Justin’s head when Plotkin followed him on twitter during the 57% (at one point 94%) day last Wednesday and then Justin got a bit chippy about it.\n\nAnd this is the real reason I’m bringing this up.\n\nBecause I honestly care very little about the Nervous Investing Habits of the Wisconsin hedge fund voted most likely to prompt a Mr. Roboto reference. No: I think that Gabe Plotkin sent a message with that follow. Without even ever having to say it directly. And I think that after GME’s huge run and getting a little overexcited while working the twitter machine, Justin maybe had a chance to relax with a warm glass of milk that night and reflect on that message. Which I believe was: ***I’m watching you, motherfucker***. *And the only reason I’m paying any attention to some shitstain Wisconsin pseudo-fund on a day like today when I am getting my ass fucking torched is because I want you to know that if this GME shit blows up on me, I’m going to fuck your ass up.* *I will remember the name Domo Capital forevermore.* *And when you least expect me, I’ll be there. Now: your move, motherfucker.*\n\nAnd once I realized what might have happened there, that made me feel kinda bad for Justin if he felt that way. Definitely a puss move because fuck you Plotkin I drink your fucking milkshake, right? But bad because that’s a mean message for a business colleague to send, Gabriel. Shame on you if that's how you roll like a big New York bully and scaring our poor Justin like that. And if you just wanted to follow him to shoot the shit or swap listicles and Star Wars Prequel memes with a respected contemporary—even in the very midst of getting fucking annihilated while short GME—well Justin has a totally different account for that and he’s not allowed to access it during work hours.\n\n**On The Likelihood That The Most Heavily Shorted Stock in History Is Not Been Subject to Continued Market Manipulation When A Steve Cohen Acolyte Is Losing His Fucking Shirt**\n\nHave you heard about Steve Fucking Cohen? The guy who looks like he’s tip top of the list of the premier Hollywood casting agency’s rolodex for Saddest Dipshit Still At the Strip Club After Everyone Else Has Already Gone Home. I’m sorry, that’s mean and my mother told me to always be kind to the truly hideous looking because they’re probably still beautiful on the inside (spoiler alert: he’s not!).\n\nGet a load of this guy:\n\n[https://www.bloomberg.com/news/articles/2014-01-02/why-sac-capitals-steven-cohen-isnt-in-jail](https://www.bloomberg.com/news/articles/2014-01-02/why-sac-capitals-steven-cohen-isnt-in-jail)\n\n[https://www.latimes.com/entertainment-arts/business/story/2020-09-02/controversial-hedge-fund-billionaire-steven-cohen-takes-on-hollywood](https://www.latimes.com/entertainment-arts/business/story/2020-09-02/controversial-hedge-fund-billionaire-steven-cohen-takes-on-hollywood)\n\n[https://www.marketwatch.com/story/steven-a-cohen-among-the-million-dollar-donors-to-trump-inauguration-2017-04-19](https://www.marketwatch.com/story/steven-a-cohen-among-the-million-dollar-donors-to-trump-inauguration-2017-04-19)\n\n[https://www.vanityfair.com/news/2016/11/steve-cohen-trump](https://www.vanityfair.com/news/2016/11/steve-cohen-trump)\n\n[https://nypost.com/2015/06/17/billionaire-steve-cohen-bros-out-with-guy-fieri/](https://nypost.com/2015/06/17/billionaire-steve-cohen-bros-out-with-guy-fieri/)\n\nAre you back? I’ve missed you. That was scary, wasn’t it? But allow me to **TL/DR** all that for you who decided to avoid all that unpleasantness: the dude just has all this bad luck and keeps finding himself into these really awkward situations where someone could potentially question his commitment to ethical business and life practices as well as adherence to the laws of the United States and it’s just not fair and nothing’s fair and Nice Guy Steve Cohen Is The Victim Here So Just Stop Right There Mister I See What You’re Doing. He's also bros with Guy Fieri. Cool.\n\nBut why am I talking about a guy who would so clearly pass Billy Madison’s Final Question about Business Ethics without even breaking a sweat?\n\nBecause Steve Cohen once had a young Ace Protegee that he loved very much. With the name of an Archangel, so tender and pure. And one day this young man decided he wanted to Prove Himself and Leave Steve’s Nest. And thus was born Melvin Capital, seeded financially by Steve Cohen but named after famed Crooner Melvin H. Tormé, which Gabe’s esteemed mentor Steve would play in his office, over and over, all those years ago.\n\nNow let’s fast forward a bit because I’m boring myself with all that fucking Cohen reading (the *bad* Cohen—don’t you dare get anyone confused here). As I was saying: Gabe Plotkin, head of Melvin Capital, has by all accounts gotten himself into a bit of a pickle here being so deeply short GME. Lots of people have analyzed and overanalyzed it, and I’m not going to do it again here; that dead horse is well and truly beaten. But to bottom line it: we’re all just staring down what is essentially an unprecedented math problem that will, at some point, resolve itself. And if it revolves itself in favor of the Good Guys, then the Bad Guys will lose a Fuck-ton of Money. That’s your money block quote, WSJ, so fuck off and stop calling me.\n\nNow: picture yourself as a Steve Cohen acolyte that just bought a [$44M Miami Compound](https://therealdeal.com/miami/2020/12/07/melvin-capital-founder-revealed-as-buyer-of-44m-miami-beach-property-sources/) and who cannot stop talking about how [co-owning the Charlotte Hornets](https://www.charlotteobserver.com/sports/charlotte-hornets/article232128902.html) is worth it just for the courtsides alone bro once basketball is a thing again and so what if Michael Jordan keeps calling him Gary it’s close enough. Are you feeling the most financially secure that you have ever felt in your young rich life right about now? Or might you be a wee bit worried that you’ve pursued an investment thesis so reckless, so irrationally and intentionally destructive of equity, that even Melvin H. Tormé himself must be rolling in his fucking grave that you would ever dare put at risk your ability to continue being Michael Jordan’s Gary?\n\nAnd so here is when I again link my good buddy Jim Cramer’s [Great Unveiling of the Tactics Deployed by Short Sellers](https://www.reddit.com/r/wallstreetbets/comments/l09n23/it_all_makes_sense_about_cramer_now_if_youre/) hoping to change the narrative and construct a “new truth” to suppress the SP in the face of, oh, let’s just say: a very promising turnaround story in a high-growth industry by An E-Commerce Canadian Genius who does not fuck around and who knows what he’s fucking doing and aims to sell more and better video games experiences to crackhead video gamers and there’s a million things he wants to do but just you wait, just you wait.\n\nIs this plot that hard to follow?\n\nAnd I’ll also say this: I know fuck-all about monitoring order flows or how funds continue to create synthetic shares to short shit into oblivion. But I’m just stepping back and thinking of the broader narrative and tactics on this. Spit-balling here again—bear with me. Now, if you were massively short a security while paying out your ass in borrowing fees for the privilege of entering the most crowded short trade in the market and you’re now opposite a massive business turnaround story, Ryan Cohen, numerous institutions, funds, retail whales, Norwegian HNW Freemason Consortiums, and the energy behind the Finest Rocket Children Ever to Grace Planet Fucking Earth—and you’re taking it in the ass week after week here—Do you then play this straight? Do you set aside all of these illegal and deceptive short tactics Jim Cramer candidly outlines in that video even though they’re impossible to enforce and are in fact *not* enforced? That Jim basically says you’d be professionally negligent if you were short and didn’t do this shit because fuck it *whosgonnastopyou*? And now you fucked up and that steamroller is barreling down upon you and there are all these things you *could theoretically* do try to get yourself out of this jam if you were That Kind of Person? Do you set this all aside and, at least in Jim’s view, tie one hand behind your precious ethical back? On the most heavily shorted stock off all time where you are bleeding Real Life Big-Boy Money? Just buying and selling you know, just a job, nothing much to it, sometimes you win, sometimes you lose, can't get too carried away with it.\n\n*Or is it something a little bit fucking different than that?*\n\nI don’t know. I’m not in the industry myself. And I would never accuse anyone of doing anything so clearly contrary to the values upon which their professional career as Master of the Universe was built. So Gabe: chill. Don’t follow me or something on twitter man, since for all I know that’s Plotkinese for I Hope You Don’t Mind Sleeping With This Severed Horse Head in Your Bed Motherfucker. It’s just money, dude. You seem pretty well taken care of. But man would I be sweating if I were short right now staring down the barrel of your new neighbor Ryan Cohen’s whims and patience and polite Canadian manners and ambiguous emojis that we all lose our shit for. I mean, fuck man: are you ok? Don’t forgot to exercise and eat well during all this. Maybe switch to green tea or something. And remember: you’ll always—always—be Michael Jordan’s Gary.\n\nBut here is where we return to our good friend Andrew Left from Citron Research.\n\nDo you remember the excitement you felt this past weekend? I’ve never seen WSB so jacked. People were coming out hot on Tuesday—an uptick day! The new phone book’s here! The new phone book's here! What luck to be free of Gary’s tomfoolery for one fine day. And then GME spiked right away—reaching a high of over $45 that morning.\n\nBut then something happened. We all know what it was. But here is where any SEC lookie-loos need to close those Pornhub links and pay closer attention. Because in the moments before the Citron tweet that morning about Andy’s upcoming BuzzFeed Listicle call on Why GME is Scary Investment GRRRR, total short shares available **dropped from 1.2M to 0**. And a **$300K put bet** was placed on a weekly with a strike price well over 10% out of the money at the very moment that GME’s price was accelerating rapidly. (H/t [u/FatAspirations](https://www.reddit.com/u/FatAspirations/)). That’s some WSB-level retard shit right there, whoever you are.\n\nAnd yet they pull it off! GME immediately shoots down nearly 30% intraday, and eventually climbing abck up above 10%, making us all feel a little weird and like ungrateful millennial brats for feeling so shitty about a 10% day. But we all know what fucking happened, now don’t we?\n\nSo what can we say about ol’ Andy? Well, just like future call-back candidate for the role of Frightened Inmate #2, Mr. Steve Cohen, Andy is also but a Caveman—frightened and confused by your modern concepts of “ethics” and “rules.” No! No!—He’s a straight shooter! Devoted to rooting out obvious frauds, like Lukin Coffee and TSLA (Do not fuck with Elon or my Hot Mom’s ETF, Andy). And like the aspirations of Antoine Bugle Boy when he entered the blue jeans market, Andy saw an overcrowded short trade here based on an overly simplistic and obsolete short thesis about GME and said: “Me Too!” And as this thing is ripping to the stratosphere, Andy starts ringing his dumb dumb twitter bell and saying hear ye, hear ye—Inauguration Day and time it shall be for all my Big Brain thoughts about GME! Nothing weird about that. No sir.\n\nNow, many of you know Andy as the dumbshit who shorted TSLA until he was ground into little bits of dumb dumb dust and made to look ever so foolish over and over again until he finally cried drunk uncle and flipped to being long TSLA and now he’s cool to you or whatever. Or you might know him as the guy who puts out really shoddy research that often, by pure happenstance, drives a new narrative to control the orderflow and SP on a WSB-beloved security like PLTR? You know the guy I’m talking about. Once in hot pursuit by Hong Kong fuzz, an International Man of Obviousness with a face that says: why yes, I *will* have another vodka tonic *thankyouverymuch*. That’s him.\n\nSo Andy Citron or whatever the fuck his name is will be putting out some dumbshit video or something today in what seems to be a pretty clear attempt to scare my poor Rocket Children and get those pesky computers to high frequency this shit to drive the SP down to more acceptable loss levels (cause let’s be honest: they’re still taking a fucking bath here) for Melvin H. Tormé’s namesake hedgefund and all the other cretins that are dug into short position here. And they’re gonna try to scare ya’ with the color red! And they know that no one here likes the color red.\n\nBut do see what’s going on here and who we’re dealing with. This really ain’t rocket science, Rocket Children. The dude actually tried to claim he forgot about the Inauguration. In 2021. He has not been in a coma, to the best of my knowledge. Btw, you look a little bleary eyed, Andy. Must have been all that staying up super late working on those last few bullet points to fill out the powerpoint on that GME listicle of yours, eh sport?\n\n**Conclusion: On the Subject of Patience and The Arc of The Universe Bending Toward Ryan Fucking Cohen**\n\n*In my youth there was a period of time where I went out on boats that would drop crates into the waters of the Arctic. Bundled inside them were raw pieces of meat. In the coming days the boats would head back out to the frigid seas, hook the floats bobbing upon the waters, and pull the crates up. Packed inside would be many crabs. They were so delicious & made a good price at market. The difference between the crate that was empty and the create full of bounty was a mystery even the great physicist Erwin Schrödinger pondered at much length.*\n\n*But the hearty fishermen of my youth already knew the answer long ago. Why did the trap fill up? Time. In time, all traps fill. In time, all things pondered shall be revealed.*\n\n**--The Fucking Viking, That’s Who**\n\nNow look, you all know I have a soft spot for Ryan Cohen. Hell, we all do. He’s a good dude. And the man has played this flawlessly so far. He really has. The fact that we are all sitting here with Ryan Cohen having successfully negotiated three seats on the Board—a bloodless coup as my man Rod Alzmann says—here in January? It’s amazing. His vision for GME is dialed-the-fuck in and extremely exciting. This misunderstood business is on the threshold of an exciting turnaround with Ryan Cohen at the helm. And though I was very much looking forward to the potential repercussions of a vote being called at the annual meeting and what that might mean for the short-term share price, this result is infinitely better. Whatever their motivations, that Board and George Sherman saw the writing on the wall here and accepted the Golden Bridge that Ryan offered them. And Ryan Cohen has done everything he’s set out to do here. And he’s clearly been having fun while doing it. Read up on the guy at some point if you haven’t–there’s lots of good DD out there on him, obviously. And while you’re reading and thinking about Ryan Cohen, think also about guys like Steve Cohen (*no* *fucking relation*) and Gabe Plotkin and Andy Left and how lucky we are that we get to roll with RC against that motley crew of fuckwads.\n\nAnd do you know what? I’m guessing that RC, and maybe even the funds being discussed in that screenshot, have been very patient with Mr. Plotkin *et al* in recent weeks. You don’t go around bankrupting hedge funds willy nilly, you know--bad form and all that old chap. People tend to remember that. And guys like Steve Cohen and Gabe Plotkin seem like they play for keeps. So now you try to build them a Golden Bridge to cross—maybe not their preferred route of travel, but could be worse and all that, right guys? But for whatever reason it seems like the natural instinct here on the short side is fight over flight. And these short FUD tactics are getting increasingly ridiculous to help slow down the inevitable march toward the detonator right next to that bridge. So relax everyone! And let’s not fool ourselves: All those Masters of the Universes are well aware of the math problem they’re all facing here and they must have a vague grasp of the odds that this goes off in one direction over the other. And what that could mean for the size of their money pits and how many sports teams they can buy this year. Shit, I assume Steve Cohen is counseling his young acolyte about how many sads he himself felt deep down in his man heart on that fateful day in 2008 when he lost $250M on a short when Volkswagon squeezed to infinity—a sadness that he will continue to draw on when his agent finally finds him a role that calls for it.\n\nBut my point is: the longs here can afford to be patient and let this play out. When this thing moves, the Viking’s Schrödinger crabs will only be in one fucking pot. And I’m guessing that pot is the one being held by the guy who is actually in total fucking control here: Ryan Goddamn Cohen.\n\nSo enjoy the show today. If you’re anything like me, you’re feeling relaxed after gorging yourself on lucky space peanuts all week. And though these silly wabbits with their cumbersome FUD efforts can get a bit tiresome, I’m still very much enjoying this GME show at this point and almost do not want it to end—what with all these Sorkin-esque twists and turns and my Cohen Tweet Decorder Ring getting all this sweet action.\n\nBut just remember who Ryan Cohen is, what he cares about, and what, so far, he has told us he intends to do here. And then you might realize, as I have, that Ryan Cohen has had the Gray’s Sports Almanac here all along. This story has already been written. He’s already won. And Melvin Capital’s Schrödinger-ass crabs are dead as fuck. The only question now is: what causes that Golden Bridge to blow? I, for one, am content to wait on RC while counting my good fortune that I can continue to accumulate until whatever happens here happens. So pass the rocket peanuts.\n\nIt’s just money after all. Right Gabe?\n\n**TL/DR**: *Psst*: a Mysterious Viking once told me about behind-the-scenes Golden Bridge negotiations that are likely taking place that give shorts no chance but the shorts seem to think they’re saying there’s a chance but there really is no chance; Gabe Plotkin, Steve Cohen and Andy Left are misunderstood Straight Shooters who probably answer typical interview questions about their own perceived weaknesses by saying “Sometimes I just care *too much* about doing the right thing”; and Ryan Cohen is the Goddamn Man so we can all relax and not worry so much about all this dumb short FUD bullshit, ok? OK. **🚀🚀🚀**\n\n25,380 shares, 680 20/25/30/40 calls from Feb to July.\n\n\\*\\*If you construe any of the above as investment advice without doing your own DD or at least Googling Ryan Cohen then you are a fucking idiot and may God have mercy on your soul. You too, Andy.", "author_fullname": "t2_3f8m59wk", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "GME Gang: On the Subject of the Golden Bridge and Its Inevitable Destruction By Fire 🚀🚀🚀", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_l21pwh", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.94, "author_flair_background_color": null, "subreddit_type": "public", "ups": 32, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 32, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1611275050.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><em>Build your opponent a golden bridge to retreat across.</em></p>\n\n<p><strong>Sun Tzu, Art of War</strong></p>\n\n<p><em>Everything was for tomorrow, but tomorrow never came. The present was only a bridge and on this bridge they are still groaning, as the world groans, and not one idiot ever thinks of blowing up the bridge.</em></p>\n\n<p><strong>Henry Miller, Tropic of Capricorn</strong></p>\n\n<p><em>I was wrong! Blow the bridge! Blow the fucking bridge!</em></p>\n\n<p><strong>Tugg Speedman, Tropic Thunder</strong></p>\n\n<p>Hello again GME Gang! It’s been a while since I last ranted at you, but I know we’ve been in some very good hands here at WSB with all the great DD folks have posted over the past few weeks. So no need for CPT Hubbard go for 11 again on the Thumbscroll Dial (until today, that is). I’ve enjoyed a lot of these posts very much, so thank you on behalf of myself and the attention-deficient Rocket Children for continuing to deliver that 100% Chaff-Free GME-grade Wheat at such a feverish clip.</p>\n\n<p>Now, I am going to get to Hong Kong’s <a href=\"https://www.scmp.com/business/money/investment-products/article/2009448/hong-kong-finds-citron-researchs-andrew-left\">Lamest Outlaw</a> and his disconcertingly vacant eyes here shortly. But first I want to take you on a journey back to Christmas Eve, in the year of our lord 2020—a heady time in all our lives. We were all so young and innocent then, weren’t we? Fresh off the run up to 22. Blissfully oblivious that we were living in the last moments where the question What is The War of 1812? was the only acceptable Jeopardy question for the answer: The Last Time the Goddamn U.S. Capitol Was Stormed. This was also before we all became irresponsibly overleveraged in Cathie Wood’s Ornamental Gourds ETF. It was a wondrous, confusing time.</p>\n\n<p>But before we get too off topic, let’s all hop in my 1985 DeLorean (purchased with proceeds from my Jan 15 calls – thanks RC!), fire up the ol’ Flux Capacitor, and get that shit to 88 because something happened that evening that is Worth Pondering—particularly in light of recent events. And just as a friendly reminder: even though you’re going back in time in a DeLorean, no one here has to deviate funds away from GME shares to Save the Clock Tower and you are under no obligation to fulfill a scenario where you wind up making out with your Mom (unless your Mom is Cathie Wood like mine—in which case maybe just some quick over-the-clothes stuff).</p>\n\n<p><strong>On the Subject of How It Once ‘Twas The Night Before Christmas</strong></p>\n\n<p>So what in the holy fuck happened on the night before Christmas, Captain? Well, while all you Gentiles were sleeping soundly after lying to your children about benign home intruders and before gorging yourself on the teat of late-stage capitalism, me and the rest of the Chosen People were up late eating Chinese food and thinking about tendies (self-hating Jew Joke! Ba-zing!). But then: when out on the electric twitter machine there arose such a clatter, I sprang to my phone to see what was the matter. And what to my wondering eyes did appear, a mysterious tweet from a Rich-Ass Viking who had a lot of fucking interesting things to say about this whole GME situation that’s what.</p>\n\n<p>This tweet, buried as a reply to a tweet sent by Mr. Rod Alzmann (@RodAlzmann or <a href=\"https://www.reddit.com/u/Uberkikz11/\">u/Uberkikz11</a>), simply said: “Merry Christmas. Shhh.” But it included this screen shot:</p>\n\n<p>[**Image Deleted Due to the Mods - check the link below where someone transcribed it - I&#39;ll try to add later**]</p>\n\n<p>Now, this tweet to Rod, sent late at night and likely after a strong Mead or three, was very promptly deleted. But your intrepid cub reporter saw this here tweet that night with his own two eyes—seeing as I am a degenerate GME addict and devoted follower of Mr. Rod Alzmann (Hi Rod!). And I took screenshots, of course, like any responsible records custodian might. And so did the dude who wrote a somewhat-overlooked WSB post on this, which included the most pertinent text of the message if you are having trouble reading it here:</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kk0omp/christmas_miracle_gamergate_2020_gme_shorts/\">https://www.reddit.com/r/wallstreetbets/comments/kk0omp/christmas_miracle_gamergate_2020_gme_shorts/</a></p>\n\n<p>Now, what are we to make of this? At the time, I thought it was very interesting. But I did not give it too much attention seeing as how the internet is overcrowded with anonymous weirdos claiming to know more than they do about all sorts of subjects (and now I feel your judging eyes…). Also, there was some very good commentary in that WSB post from some sharp folks about the screenshot author’s questionable use of the shorthand PE/IB—given that private equity and investment banks wouldn’t apparently be involved in a behind-the-scenes transaction with the short funds like what was being discussed there (don’t ask me, I just string together silly words here). But maybe you poke around his <a href=\"https://twitter.com/KjetillStjerne\">Twitter</a> a bit and see for yourself.</p>\n\n<p>Still, plausibility assessments based on preferred nomenclature aside, it seemed to me that some version of that conversation <strong>had</strong> to be taking place behind the scenes in a situation like this—given the batshit insane short interest, the funds supposedly involved, and the rapid rise in SP coinciding with RC’s share accumulation, December 21st amended 13D filing, and new status as a GME Insider and Board member (just love saying all that in a row, don’t you?).</p>\n\n<p>So the Viking’s screenshot tweet, and the very likely possibility that shorts are in so deep that they’re attempting to negotiate peace with large shareholders behind the scenes, stuck in my tiny little baby brain as a pretty plausible set of scenarios. And from the look of it, it seems like some funds were at least willing to discuss offering these shorts a Golden Bridge away from Certain Fucking Destruction on the open market. And if the words on the screenshot are at all aligned with reality, these short funds have no good options. Yet it seems like they are still playing hardball to negotiate the carat on this generous bridge offer they’re getting. Why? Maybe they’ve been getting high on their own supply for so long and they don’t know how to see this situation for what it is. Who knows? Maybe there is no Ryan Cohen and we’re all living in a simulation. But if the recent low-rent anti-GME articles and market manipulation efforts we’re seeing are any indication, these overleveraged short fuckers seem to think they’re going to be able to spin out of this hold and drive the SP back down to even <em>smaller</em> peanuts than it’s at now by sheer force of will (and some deployment of well-honed tricks of the trade <em>amirite</em>?) to emerge unscathed. Or even victorious? I dunno—it’s their delusional fantasy sequence.</p>\n\n<p>But do you know what this scenario reminds me of? And this is just coming to me so please bear with me as I’m not showing this to my editor before we print (I haven’t seen this movie in ages – don’t know what made me think of this!). Fuck it, I’m just gonna start riffing here. The shorts trying to thread this needle, against all odds and logic and common sense, reminds me of that hilarious scene in Dumb and Dumber where haplessly delusional Jim Carrey thinks he has a chance with Mary Samsonite Swanson. But the scene is funny because he really doesn’t. Have any chance. At all.</p>\n\n<p>Now, I know this is a 1990s movie originally released on VHS that we haven’t seen or seen it referenced in ages. But now that you’re thinking of it again after all this time, doesn’t it remind you of this too? I know, I get it: You’d have to have fucking peanuts for brains for it not to.</p>\n\n<p><strong>On the Subject of the Continued Internet Bumbling of Mr. Justin Dopierala</strong></p>\n\n<p>Now that screenshot came to mind this past week when something kind of weird happened while we were all enjoying our quick rocket ship ride. And yes, we are briefly going to talk again about Seeking Alpha’s second finest pro-GME author (always been more of a Dmitriy man myself) and recurring CPT Hubbard character, Justin Dopierala (and no, Angela, I do not want to have like 10,000 of his babies).</p>\n\n<p>Last Thursday, after we were all virtually high-fiving one another and counting our future Lambos, Mr. Justin Dopierala, head of Domo Capital and longstanding uber-bull GME shareholder and author at Seeking Alpha (last seen arguing pithily with our own Rod Alzmann about the conservative nature of Rod’s holiday earnings projections. Hi again Rod!), made it known that he sold all of Domo Capital’s 500,000 shares for around $42.50—at the very top of the run up last Thursday morning.</p>\n\n<p>Now, Domo Capital’s business decisions are none of my goddamn business. And there are plenty of market opportunities right now. Shit, I hear there is even a new Cathie Wood Gourd ETF coming online soon that people are really excited about and that I’m sure Justin’s clients would find intriguing. But Domo’s decision to sell seemed curious given a few things: (1) on Wednesday, when the rocket is mid-flight, he got a twitter follow from Gabe Plotkin, head of Melvin Capital, which he promptly tweeted about with a “get a load of this fuckin’ guy” vibe (oh the sweet, intoxicating arrogance of tendie victory, I too love it so); (2) he had also tweeted that day comparing GME’s rise to Apron’s short squeeze that lasted 4 days—where he also stressed to his followers that Apron had a <em>much lower</em> SI than GME; and (3) he then promptly <strong>deleted</strong> all of these tweets and almost everything else GME-related on Thursday after apparently introducing 500,000 shares of liquidity into the height of a stressed market up and through the Thursday reversal and to his own personal tendie town.</p>\n\n<p>Now, after seeing all this, I mouthed off a bit to Justin on the electric twitter machine because that’s kind of my thing. And if you are familiar with my prior ramblings, you know that he and I go way back. In response, Justin talked a bit of shit about your intrepid cub reporter here in a comment on Dimitry Kozin’s October 21, 2020 Article about a possible Sony Revenue Share deal or something, the comment section of which has become the preferred SA water cooler over there. (And I can’t link that because Thems The Rulez). And Justin hurt my little feelings a bit with very sharp denial. And by all means have at it over there to check out his comment about why he sold if you give a shit. That is if Justin hasn’t deleted it yet. Free country and all.</p>\n\n<p>But to summarize, on the subject of treacherous coordination with Melvin Capital, Justin said he would not could not in a boat and he would not could not with a goat. And I for one believe him. And do you know why? Because even though Justin seems like a very smart guy in some ways, he’s also a well-known internet bumbler who blurts out things to his internet friends that a person with better self-control would keep to themselves. And so I do not think he is capable of pulling that off or keeping a secret like that. Also: he said he didn’t so I am more than willing to give someone the benefit of any doubt in that area and you should too. I think we keep Hanlon’s razor firmly in mind here about never attributing to malice that which is explained by stupidity. That is unless, of course, you’re Andrew Left and you’re actually trying to convince people that you didn’t realize there was a US presidential inauguration planned for the same time you announced your Super Important TeeVee Yammerfest ‘21 about GME not being a good candidate for an imminent short squeeze no way no how not if my name isn’t Andrew Left short seller expert extraordinaire and Hong Kong’s Most Misunderstood Ethically-Minded Businessman. You can ascribe the fuck out of malice to that one.</p>\n\n<p>No, even though I really have no idea, I think the most likely thing that happened there was that Gabe Plotkin, Master of the Universe, Head of Melvin Capital, and Acolyte of Perennial Most Ethical Business Man MVP candidate, Steven Cohen—got into Justin’s head when Plotkin followed him on twitter during the 57% (at one point 94%) day last Wednesday and then Justin got a bit chippy about it.</p>\n\n<p>And this is the real reason I’m bringing this up.</p>\n\n<p>Because I honestly care very little about the Nervous Investing Habits of the Wisconsin hedge fund voted most likely to prompt a Mr. Roboto reference. No: I think that Gabe Plotkin sent a message with that follow. Without even ever having to say it directly. And I think that after GME’s huge run and getting a little overexcited while working the twitter machine, Justin maybe had a chance to relax with a warm glass of milk that night and reflect on that message. Which I believe was: <strong><em>I’m watching you, motherfucker</em></strong>. <em>And the only reason I’m paying any attention to some shitstain Wisconsin pseudo-fund on a day like today when I am getting my ass fucking torched is because I want you to know that if this GME shit blows up on me, I’m going to fuck your ass up.</em> <em>I will remember the name Domo Capital forevermore.</em> <em>And when you least expect me, I’ll be there. Now: your move, motherfucker.</em></p>\n\n<p>And once I realized what might have happened there, that made me feel kinda bad for Justin if he felt that way. Definitely a puss move because fuck you Plotkin I drink your fucking milkshake, right? But bad because that’s a mean message for a business colleague to send, Gabriel. Shame on you if that&#39;s how you roll like a big New York bully and scaring our poor Justin like that. And if you just wanted to follow him to shoot the shit or swap listicles and Star Wars Prequel memes with a respected contemporary—even in the very midst of getting fucking annihilated while short GME—well Justin has a totally different account for that and he’s not allowed to access it during work hours.</p>\n\n<p><strong>On The Likelihood That The Most Heavily Shorted Stock in History Is Not Been Subject to Continued Market Manipulation When A Steve Cohen Acolyte Is Losing His Fucking Shirt</strong></p>\n\n<p>Have you heard about Steve Fucking Cohen? The guy who looks like he’s tip top of the list of the premier Hollywood casting agency’s rolodex for Saddest Dipshit Still At the Strip Club After Everyone Else Has Already Gone Home. I’m sorry, that’s mean and my mother told me to always be kind to the truly hideous looking because they’re probably still beautiful on the inside (spoiler alert: he’s not!).</p>\n\n<p>Get a load of this guy:</p>\n\n<p><a href=\"https://www.bloomberg.com/news/articles/2014-01-02/why-sac-capitals-steven-cohen-isnt-in-jail\">https://www.bloomberg.com/news/articles/2014-01-02/why-sac-capitals-steven-cohen-isnt-in-jail</a></p>\n\n<p><a href=\"https://www.latimes.com/entertainment-arts/business/story/2020-09-02/controversial-hedge-fund-billionaire-steven-cohen-takes-on-hollywood\">https://www.latimes.com/entertainment-arts/business/story/2020-09-02/controversial-hedge-fund-billionaire-steven-cohen-takes-on-hollywood</a></p>\n\n<p><a href=\"https://www.marketwatch.com/story/steven-a-cohen-among-the-million-dollar-donors-to-trump-inauguration-2017-04-19\">https://www.marketwatch.com/story/steven-a-cohen-among-the-million-dollar-donors-to-trump-inauguration-2017-04-19</a></p>\n\n<p><a href=\"https://www.vanityfair.com/news/2016/11/steve-cohen-trump\">https://www.vanityfair.com/news/2016/11/steve-cohen-trump</a></p>\n\n<p><a href=\"https://nypost.com/2015/06/17/billionaire-steve-cohen-bros-out-with-guy-fieri/\">https://nypost.com/2015/06/17/billionaire-steve-cohen-bros-out-with-guy-fieri/</a></p>\n\n<p>Are you back? I’ve missed you. That was scary, wasn’t it? But allow me to <strong>TL/DR</strong> all that for you who decided to avoid all that unpleasantness: the dude just has all this bad luck and keeps finding himself into these really awkward situations where someone could potentially question his commitment to ethical business and life practices as well as adherence to the laws of the United States and it’s just not fair and nothing’s fair and Nice Guy Steve Cohen Is The Victim Here So Just Stop Right There Mister I See What You’re Doing. He&#39;s also bros with Guy Fieri. Cool.</p>\n\n<p>But why am I talking about a guy who would so clearly pass Billy Madison’s Final Question about Business Ethics without even breaking a sweat?</p>\n\n<p>Because Steve Cohen once had a young Ace Protegee that he loved very much. With the name of an Archangel, so tender and pure. And one day this young man decided he wanted to Prove Himself and Leave Steve’s Nest. And thus was born Melvin Capital, seeded financially by Steve Cohen but named after famed Crooner Melvin H. Tormé, which Gabe’s esteemed mentor Steve would play in his office, over and over, all those years ago.</p>\n\n<p>Now let’s fast forward a bit because I’m boring myself with all that fucking Cohen reading (the <em>bad</em> Cohen—don’t you dare get anyone confused here). As I was saying: Gabe Plotkin, head of Melvin Capital, has by all accounts gotten himself into a bit of a pickle here being so deeply short GME. Lots of people have analyzed and overanalyzed it, and I’m not going to do it again here; that dead horse is well and truly beaten. But to bottom line it: we’re all just staring down what is essentially an unprecedented math problem that will, at some point, resolve itself. And if it revolves itself in favor of the Good Guys, then the Bad Guys will lose a Fuck-ton of Money. That’s your money block quote, WSJ, so fuck off and stop calling me.</p>\n\n<p>Now: picture yourself as a Steve Cohen acolyte that just bought a <a href=\"https://therealdeal.com/miami/2020/12/07/melvin-capital-founder-revealed-as-buyer-of-44m-miami-beach-property-sources/\">$44M Miami Compound</a> and who cannot stop talking about how <a href=\"https://www.charlotteobserver.com/sports/charlotte-hornets/article232128902.html\">co-owning the Charlotte Hornets</a> is worth it just for the courtsides alone bro once basketball is a thing again and so what if Michael Jordan keeps calling him Gary it’s close enough. Are you feeling the most financially secure that you have ever felt in your young rich life right about now? Or might you be a wee bit worried that you’ve pursued an investment thesis so reckless, so irrationally and intentionally destructive of equity, that even Melvin H. Tormé himself must be rolling in his fucking grave that you would ever dare put at risk your ability to continue being Michael Jordan’s Gary?</p>\n\n<p>And so here is when I again link my good buddy Jim Cramer’s <a href=\"https://www.reddit.com/r/wallstreetbets/comments/l09n23/it_all_makes_sense_about_cramer_now_if_youre/\">Great Unveiling of the Tactics Deployed by Short Sellers</a> hoping to change the narrative and construct a “new truth” to suppress the SP in the face of, oh, let’s just say: a very promising turnaround story in a high-growth industry by An E-Commerce Canadian Genius who does not fuck around and who knows what he’s fucking doing and aims to sell more and better video games experiences to crackhead video gamers and there’s a million things he wants to do but just you wait, just you wait.</p>\n\n<p>Is this plot that hard to follow?</p>\n\n<p>And I’ll also say this: I know fuck-all about monitoring order flows or how funds continue to create synthetic shares to short shit into oblivion. But I’m just stepping back and thinking of the broader narrative and tactics on this. Spit-balling here again—bear with me. Now, if you were massively short a security while paying out your ass in borrowing fees for the privilege of entering the most crowded short trade in the market and you’re now opposite a massive business turnaround story, Ryan Cohen, numerous institutions, funds, retail whales, Norwegian HNW Freemason Consortiums, and the energy behind the Finest Rocket Children Ever to Grace Planet Fucking Earth—and you’re taking it in the ass week after week here—Do you then play this straight? Do you set aside all of these illegal and deceptive short tactics Jim Cramer candidly outlines in that video even though they’re impossible to enforce and are in fact <em>not</em> enforced? That Jim basically says you’d be professionally negligent if you were short and didn’t do this shit because fuck it <em>whosgonnastopyou</em>? And now you fucked up and that steamroller is barreling down upon you and there are all these things you <em>could theoretically</em> do try to get yourself out of this jam if you were That Kind of Person? Do you set this all aside and, at least in Jim’s view, tie one hand behind your precious ethical back? On the most heavily shorted stock off all time where you are bleeding Real Life Big-Boy Money? Just buying and selling you know, just a job, nothing much to it, sometimes you win, sometimes you lose, can&#39;t get too carried away with it.</p>\n\n<p><em>Or is it something a little bit fucking different than that?</em></p>\n\n<p>I don’t know. I’m not in the industry myself. And I would never accuse anyone of doing anything so clearly contrary to the values upon which their professional career as Master of the Universe was built. So Gabe: chill. Don’t follow me or something on twitter man, since for all I know that’s Plotkinese for I Hope You Don’t Mind Sleeping With This Severed Horse Head in Your Bed Motherfucker. It’s just money, dude. You seem pretty well taken care of. But man would I be sweating if I were short right now staring down the barrel of your new neighbor Ryan Cohen’s whims and patience and polite Canadian manners and ambiguous emojis that we all lose our shit for. I mean, fuck man: are you ok? Don’t forgot to exercise and eat well during all this. Maybe switch to green tea or something. And remember: you’ll always—always—be Michael Jordan’s Gary.</p>\n\n<p>But here is where we return to our good friend Andrew Left from Citron Research.</p>\n\n<p>Do you remember the excitement you felt this past weekend? I’ve never seen WSB so jacked. People were coming out hot on Tuesday—an uptick day! The new phone book’s here! The new phone book&#39;s here! What luck to be free of Gary’s tomfoolery for one fine day. And then GME spiked right away—reaching a high of over $45 that morning.</p>\n\n<p>But then something happened. We all know what it was. But here is where any SEC lookie-loos need to close those Pornhub links and pay closer attention. Because in the moments before the Citron tweet that morning about Andy’s upcoming BuzzFeed Listicle call on Why GME is Scary Investment GRRRR, total short shares available <strong>dropped from 1.2M to 0</strong>. And a <strong>$300K put bet</strong> was placed on a weekly with a strike price well over 10% out of the money at the very moment that GME’s price was accelerating rapidly. (H/t <a href=\"https://www.reddit.com/u/FatAspirations/\">u/FatAspirations</a>). That’s some WSB-level retard shit right there, whoever you are.</p>\n\n<p>And yet they pull it off! GME immediately shoots down nearly 30% intraday, and eventually climbing abck up above 10%, making us all feel a little weird and like ungrateful millennial brats for feeling so shitty about a 10% day. But we all know what fucking happened, now don’t we?</p>\n\n<p>So what can we say about ol’ Andy? Well, just like future call-back candidate for the role of Frightened Inmate #2, Mr. Steve Cohen, Andy is also but a Caveman—frightened and confused by your modern concepts of “ethics” and “rules.” No! No!—He’s a straight shooter! Devoted to rooting out obvious frauds, like Lukin Coffee and TSLA (Do not fuck with Elon or my Hot Mom’s ETF, Andy). And like the aspirations of Antoine Bugle Boy when he entered the blue jeans market, Andy saw an overcrowded short trade here based on an overly simplistic and obsolete short thesis about GME and said: “Me Too!” And as this thing is ripping to the stratosphere, Andy starts ringing his dumb dumb twitter bell and saying hear ye, hear ye—Inauguration Day and time it shall be for all my Big Brain thoughts about GME! Nothing weird about that. No sir.</p>\n\n<p>Now, many of you know Andy as the dumbshit who shorted TSLA until he was ground into little bits of dumb dumb dust and made to look ever so foolish over and over again until he finally cried drunk uncle and flipped to being long TSLA and now he’s cool to you or whatever. Or you might know him as the guy who puts out really shoddy research that often, by pure happenstance, drives a new narrative to control the orderflow and SP on a WSB-beloved security like PLTR? You know the guy I’m talking about. Once in hot pursuit by Hong Kong fuzz, an International Man of Obviousness with a face that says: why yes, I <em>will</em> have another vodka tonic <em>thankyouverymuch</em>. That’s him.</p>\n\n<p>So Andy Citron or whatever the fuck his name is will be putting out some dumbshit video or something today in what seems to be a pretty clear attempt to scare my poor Rocket Children and get those pesky computers to high frequency this shit to drive the SP down to more acceptable loss levels (cause let’s be honest: they’re still taking a fucking bath here) for Melvin H. Tormé’s namesake hedgefund and all the other cretins that are dug into short position here. And they’re gonna try to scare ya’ with the color red! And they know that no one here likes the color red.</p>\n\n<p>But do see what’s going on here and who we’re dealing with. This really ain’t rocket science, Rocket Children. The dude actually tried to claim he forgot about the Inauguration. In 2021. He has not been in a coma, to the best of my knowledge. Btw, you look a little bleary eyed, Andy. Must have been all that staying up super late working on those last few bullet points to fill out the powerpoint on that GME listicle of yours, eh sport?</p>\n\n<p><strong>Conclusion: On the Subject of Patience and The Arc of The Universe Bending Toward Ryan Fucking Cohen</strong></p>\n\n<p><em>In my youth there was a period of time where I went out on boats that would drop crates into the waters of the Arctic. Bundled inside them were raw pieces of meat. In the coming days the boats would head back out to the frigid seas, hook the floats bobbing upon the waters, and pull the crates up. Packed inside would be many crabs. They were so delicious &amp; made a good price at market. The difference between the crate that was empty and the create full of bounty was a mystery even the great physicist Erwin Schrödinger pondered at much length.</em></p>\n\n<p><em>But the hearty fishermen of my youth already knew the answer long ago. Why did the trap fill up? Time. In time, all traps fill. In time, all things pondered shall be revealed.</em></p>\n\n<p><strong>--The Fucking Viking, That’s Who</strong></p>\n\n<p>Now look, you all know I have a soft spot for Ryan Cohen. Hell, we all do. He’s a good dude. And the man has played this flawlessly so far. He really has. The fact that we are all sitting here with Ryan Cohen having successfully negotiated three seats on the Board—a bloodless coup as my man Rod Alzmann says—here in January? It’s amazing. His vision for GME is dialed-the-fuck in and extremely exciting. This misunderstood business is on the threshold of an exciting turnaround with Ryan Cohen at the helm. And though I was very much looking forward to the potential repercussions of a vote being called at the annual meeting and what that might mean for the short-term share price, this result is infinitely better. Whatever their motivations, that Board and George Sherman saw the writing on the wall here and accepted the Golden Bridge that Ryan offered them. And Ryan Cohen has done everything he’s set out to do here. And he’s clearly been having fun while doing it. Read up on the guy at some point if you haven’t–there’s lots of good DD out there on him, obviously. And while you’re reading and thinking about Ryan Cohen, think also about guys like Steve Cohen (<em>no</em> <em>fucking relation</em>) and Gabe Plotkin and Andy Left and how lucky we are that we get to roll with RC against that motley crew of fuckwads.</p>\n\n<p>And do you know what? I’m guessing that RC, and maybe even the funds being discussed in that screenshot, have been very patient with Mr. Plotkin <em>et al</em> in recent weeks. You don’t go around bankrupting hedge funds willy nilly, you know--bad form and all that old chap. People tend to remember that. And guys like Steve Cohen and Gabe Plotkin seem like they play for keeps. So now you try to build them a Golden Bridge to cross—maybe not their preferred route of travel, but could be worse and all that, right guys? But for whatever reason it seems like the natural instinct here on the short side is fight over flight. And these short FUD tactics are getting increasingly ridiculous to help slow down the inevitable march toward the detonator right next to that bridge. So relax everyone! And let’s not fool ourselves: All those Masters of the Universes are well aware of the math problem they’re all facing here and they must have a vague grasp of the odds that this goes off in one direction over the other. And what that could mean for the size of their money pits and how many sports teams they can buy this year. Shit, I assume Steve Cohen is counseling his young acolyte about how many sads he himself felt deep down in his man heart on that fateful day in 2008 when he lost $250M on a short when Volkswagon squeezed to infinity—a sadness that he will continue to draw on when his agent finally finds him a role that calls for it.</p>\n\n<p>But my point is: the longs here can afford to be patient and let this play out. When this thing moves, the Viking’s Schrödinger crabs will only be in one fucking pot. And I’m guessing that pot is the one being held by the guy who is actually in total fucking control here: Ryan Goddamn Cohen.</p>\n\n<p>So enjoy the show today. If you’re anything like me, you’re feeling relaxed after gorging yourself on lucky space peanuts all week. And though these silly wabbits with their cumbersome FUD efforts can get a bit tiresome, I’m still very much enjoying this GME show at this point and almost do not want it to end—what with all these Sorkin-esque twists and turns and my Cohen Tweet Decorder Ring getting all this sweet action.</p>\n\n<p>But just remember who Ryan Cohen is, what he cares about, and what, so far, he has told us he intends to do here. And then you might realize, as I have, that Ryan Cohen has had the Gray’s Sports Almanac here all along. This story has already been written. He’s already won. And Melvin Capital’s Schrödinger-ass crabs are dead as fuck. The only question now is: what causes that Golden Bridge to blow? I, for one, am content to wait on RC while counting my good fortune that I can continue to accumulate until whatever happens here happens. So pass the rocket peanuts.</p>\n\n<p>It’s just money after all. Right Gabe?</p>\n\n<p><strong>TL/DR</strong>: <em>Psst</em>: a Mysterious Viking once told me about behind-the-scenes Golden Bridge negotiations that are likely taking place that give shorts no chance but the shorts seem to think they’re saying there’s a chance but there really is no chance; Gabe Plotkin, Steve Cohen and Andy Left are misunderstood Straight Shooters who probably answer typical interview questions about their own perceived weaknesses by saying “Sometimes I just care <em>too much</em> about doing the right thing”; and Ryan Cohen is the Goddamn Man so we can all relax and not worry so much about all this dumb short FUD bullshit, ok? OK. <strong>🚀🚀🚀</strong></p>\n\n<p>25,380 shares, 680 20/25/30/40 calls from Feb to July.</p>\n\n<p>**If you construe any of the above as investment advice without doing your own DD or at least Googling Ryan Cohen then you are a fucking idiot and may God have mercy on your soul. You too, Andy.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?auto=webp&s=c6a5cb1d9333353d31eb3257aa5c31859ab2b783", "width": 1200, "height": 630}, "resolutions": [{"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=108&crop=smart&auto=webp&s=5b424b21af3ec34173708f1e01c4e9c9ea9241d5", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=216&crop=smart&auto=webp&s=b6453932bfc1eeadca19efa5548a7c4d4a7dfcaa", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=320&crop=smart&auto=webp&s=ccd55b0ff587a2c21824f19e344daa6837b89a0c", "width": 320, "height": 168}, {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=640&crop=smart&auto=webp&s=45c6cf2e01731eb44ec36fbb56e396508c94c2c6", "width": 640, "height": 336}, {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=960&crop=smart&auto=webp&s=a9dd26345100ef1ce55ffb22cb704dd850fb86bf", "width": 960, "height": 504}, {"url": "https://external-preview.redd.it/cHeHXYC8xlnQtwnLBAIet74B23Ea0nTjH9V1-Kqe3Ug.jpg?width=1080&crop=smart&auto=webp&s=1245eee223eb7ace6c13c1c9a91f4672375043a7", "width": 1080, "height": 567}], "variants": {}, "id": "4D7GZ6-yxeWx-KydXKJ0Ltx81AbarsWsxwYGBHpdRLE"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "l21pwh", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "CPTHubbard", "fullname": "t2_3f8m59wk"}, "discussion_type": null, "num_comments": 12, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/", "subreddit_subscribers": 1924010, "created_utc": 1611246250.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 34, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_l21pwh", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "gk2pd12", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "zjz", "fullname": "t2_4nc92"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l21pwh", "score": 34, "author_fullname": "t2_4nc92", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "jesus fucking christ op", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>jesus fucking christ op</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/gk2pd12/", "num_reports": null, "locked": false, "name": "t1_gk2pd12", "created": 1611275383.0, "author_flair_text": ":zjz_flair:", "treatment_tags": [], "created_utc": 1611246583.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l21pwh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gk2rcjs", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "gptt916", "fullname": "t2_9x211"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gk2pd12", "score": 8, "author_fullname": "t2_9x211", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Did you have to read through that whole thing as a part of your mod duties?", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Did you have to read through that whole thing as a part of your mod duties?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/gk2rcjs/", "num_reports": null, "locked": false, "name": "t1_gk2rcjs", "created": 1611276257.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611247457.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 11, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l21pwh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gk2qgv9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "PRNbourbon", "fullname": "t2_6canucr"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l21pwh", "score": 11, "author_fullname": "t2_6canucr", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Wtf. Am I supposed to read all that?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Wtf. Am I supposed to read all that?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/gk2qgv9/", "num_reports": null, "locked": false, "name": "t1_gk2qgv9", "created": 1611275873.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611247073.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_l21pwh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gk2pwav", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "arvyFPS", "fullname": "t2_75p2u4w4"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l21pwh", "score": 10, "author_fullname": "t2_75p2u4w4", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "🚀?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b210104:1:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>🚀?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l21pwh/gme_gang_on_the_subject_of_the_golden_bridge_and/gk2pwav/", "num_reports": null, "locked": false, "name": "t1_gk2pwav", "created": 1611275620.0, "author_flair_text": "\u001b210104:1:1", "treatment_tags": [], "created_utc": 1611246820.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}