{"approved_at_utc": null, "selftext": "**What did the FED reveal yesterday after the meeting? FedEx reports today after Lennar smashed earnings results. Is today the stimulus deadline? Let’s talk about this and other stock market news**\n\n**\\~Very Long Post\\~**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday, as we saw the [Nasdaq Composite](https://ibb.co/Nj34Qdp) leading the way up 0.5% and closing at a new record high, with the broad stock market [SP500](https://ibb.co/WcwDrN2) also finishing in the green, up 0.18% and ended over the 3700 level for just the 2nd time in history, while the [Dow Industrial](https://ibb.co/Sdvkw4L) lagged and lost 0.15%. We also saw the [VIX](https://ibb.co/w62QhvW) continuing to drop 1.7%, back to some more normal levels after the recent spike near 25.\n\nDespite the broad market rally [yesterday](https://ibb.co/Z2qpxL2), about 55% of companies were losing ground on average volume, as we saw the Tech and Consumer Discretionary [sectors](https://ibb.co/BftQNpd) leading the way, while the only sector losing more than 1% for the day was the Utilities sector. As only Large-Cap growth [companies](https://ibb.co/cyY67bQ) from the tech sector finished in the green, while small-caps and especially value play lagged behind.\n\nYou can see in this [HEAT MAP](https://ibb.co/5LKrKdx) that most of the big tech names, Microsoft, Amazon, NFLX and even Alibaba which has suffered lately finished up well into the green, while the industrials and utilities were a big block of red.\n\nWe also got some economic data yesterday, with business [inventories](https://ibb.co/jZndKhQ) rising more than expected as sales increased by 0.9% month over month. We also saw retail [sales](https://ibb.co/XjqJyhW) falling 1.1% in November from the previous month, but this may be misleading, as sales actually rose by more than 4% year over year and by almost 6% after stripping out auto, gas and retail sales. \n\nWe also continue to see the housing demand market being [strong](https://ibb.co/cTT9BjX) as the housing market index was down from the previous month, but came in at the second highest level ever.\n\nOne last number that we got was a reading on the December [PMI](https://ibb.co/Mg0pgHq), which came in at 55.7, below expectations and the last month number. This was the lowest reading in three months as growth momentum keeps slowing down as more restrictions are re-imposed, but this is still a strong expansion of the manufacturing and services.\n\n[Today](https://ibb.co/fGq6Bqc) we will get some critical economic data, starting with initial and continuing jobless claims and housing starts, while we will also see get other important numbers later in the day.\n\nSo, we also got the AAII [survey](https://ibb.co/ynQhYRg) yesterday, which for me personally, was a good indicator that stocks may still go up, as the bullish number of investors declined by 4.6%, with most of them switching to a neutral view of the stock market. There are still a lot more investors that are bullish compared to the historical average of 38% but, this is an improving in the last weeks, as this is a very good contrarian indicator. When more people tend to be bearish that is usually a good sign that you should just go and buy stocks, as you can mostly buy them at a discount, while when to many people are bullish, there is a significantly bigger risk of a pullback or correction nearing the stock market.\n\n[Yesterday](https://ibb.co/5BwsTzH) we saw the FED keeping rates unchanged and signaling that they will continue to keep a near-zero rate through 2023 to support the economic recovery.\n\nThey also announced that the economy is expected to contract by only 2.4% in 2020, that is a big improvement from a contraction of 3.7% previously expected. They also expect the economy to grow by 4.2% next year and by more than 3% in 2022, with both revisions also being up from the previous estimates. They also vowed to keep buying bonds until there is substantial economic progress in the US, so they are expected to continue to buy $120B, with $80B in Treasury securities and another $40B in mortgage-backed securities.\n\nOther revisions in the projected economic data also showed an improved outlook in the unemployment rate, which is expected to drop to 3.7% by 2023.\n\nThe FED Chief Powell also reinforced the commitment to aid the economy with even more easing if it deems it necessary while also suggesting they will give ample warning before tapering bond purchases.\n\nThis was happening while the congress was still haggling over details on a bigger $900B relief [BILL](https://ibb.co/PQBrH2Y). We also saw a major change from the last day as now it is expected that it will include a 600$ stimulus check and extended unemployment benefits. I think this must be agreed on as soon as today if it stands a chance of passing by the end of the week, even if Congress leaders have repeatedly told they will remain in session as long as needed, even working through the weekend, they should just put their act together and pass the stuff they can agree on so that uncertainty goes away, at least for the moment.\n\nWe also have some interesting [earnings](https://ibb.co/vHCS87T) reports coming today with FedEx, BlackBerry and General Mills.\n\n[FedEx](https://ibb.co/D89m06D) is expected to post an EPS of over 4$, that would be up almost 60% over last year with an operating Margin of 7.1%. FedEx has also just received an upgrade from Credit Suisse based on accelerating e-commerce trends with a longer and stronger holiday season than expected.\n\n[JABIL](https://ibb.co/tL2qNRb) just reported while writing this post a nice surprise due to the high demand in the new Apple lineup, with a beat of 34 cents on earnings and almost $800M on revenues. The stock skyrocketed after the release.\n\nWe also got [Lennar](https://ibb.co/f9pLZxP) earnings after the close yesterday, as they beat the estimates easily, while also offering better numbers in new orders and guidance. As they expect more than 62K deliveries and 24% gross margins in FY 2021, that is up from 53K and a 20.6% gross margin in FY2020, this pushed the stock up 3% in after hours, in an unexpected move to the upside for me, despite my expectations for a great quarter for the company.\n\nIn other stock market [news](https://ibb.co/C82FmBg), we saw Roku gaining more than 5% in after-hours, after they finally reached an agreement with Warner Media to make HBO Max available directly to their streaming business.\n\nMeanwhile, gambling seems to be getting a boost every other day, as the most [recent](https://ibb.co/YhtQJH9) comment from Cuomo, made investors feel like gambling could become a big source of income for the state of New York. This boosted companies like DraftKings and Penn Gaming even more, as gambling is coming faster than expected in the entire country. [DraftKings](https://ibb.co/1QdMW97) also managed to strike a deal to launch a brand-new retail gift card just in time for the holiday season. This will be available in multiple convenience stores and is a good way for DraftKings to attract even more users to their platform in my opinion.\n\nWe Also saw [companies](https://ibb.co/yVS3v1H) lose ground yesterday like Fiverr which dropped in early trading before recovering to finish -2% for the day, after a report that Facebook is eyeing an entry into the gig business, this would be a major competitor that could eat up a lot of growth that Fiverr expected\n\nLet’s hope for another great day in the market as the [FUTURES](https://ibb.co/1zf63r8) seem to be pointing at a good open, hopefully some green action continues after that.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Stock Market News Today | FED Meeting News | Stimulus Deadline? FedEx & Lennar Earnings [12-17]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kexuve", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.92, "author_flair_background_color": null, "subreddit_type": "public", "ups": 22, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 22, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {"gid_1": 1}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1608242100.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>What did the FED reveal yesterday after the meeting? FedEx reports today after Lennar smashed earnings results. Is today the stimulus deadline? Let’s talk about this and other stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday, as we saw the <a href=\"https://ibb.co/Nj34Qdp\">Nasdaq Composite</a> leading the way up 0.5% and closing at a new record high, with the broad stock market <a href=\"https://ibb.co/WcwDrN2\">SP500</a> also finishing in the green, up 0.18% and ended over the 3700 level for just the 2nd time in history, while the <a href=\"https://ibb.co/Sdvkw4L\">Dow Industrial</a> lagged and lost 0.15%. We also saw the <a href=\"https://ibb.co/w62QhvW\">VIX</a> continuing to drop 1.7%, back to some more normal levels after the recent spike near 25.</p>\n\n<p>Despite the broad market rally <a href=\"https://ibb.co/Z2qpxL2\">yesterday</a>, about 55% of companies were losing ground on average volume, as we saw the Tech and Consumer Discretionary <a href=\"https://ibb.co/BftQNpd\">sectors</a> leading the way, while the only sector losing more than 1% for the day was the Utilities sector. As only Large-Cap growth <a href=\"https://ibb.co/cyY67bQ\">companies</a> from the tech sector finished in the green, while small-caps and especially value play lagged behind.</p>\n\n<p>You can see in this <a href=\"https://ibb.co/5LKrKdx\">HEAT MAP</a> that most of the big tech names, Microsoft, Amazon, NFLX and even Alibaba which has suffered lately finished up well into the green, while the industrials and utilities were a big block of red.</p>\n\n<p>We also got some economic data yesterday, with business <a href=\"https://ibb.co/jZndKhQ\">inventories</a> rising more than expected as sales increased by 0.9% month over month. We also saw retail <a href=\"https://ibb.co/XjqJyhW\">sales</a> falling 1.1% in November from the previous month, but this may be misleading, as sales actually rose by more than 4% year over year and by almost 6% after stripping out auto, gas and retail sales. </p>\n\n<p>We also continue to see the housing demand market being <a href=\"https://ibb.co/cTT9BjX\">strong</a> as the housing market index was down from the previous month, but came in at the second highest level ever.</p>\n\n<p>One last number that we got was a reading on the December <a href=\"https://ibb.co/Mg0pgHq\">PMI</a>, which came in at 55.7, below expectations and the last month number. This was the lowest reading in three months as growth momentum keeps slowing down as more restrictions are re-imposed, but this is still a strong expansion of the manufacturing and services.</p>\n\n<p><a href=\"https://ibb.co/fGq6Bqc\">Today</a> we will get some critical economic data, starting with initial and continuing jobless claims and housing starts, while we will also see get other important numbers later in the day.</p>\n\n<p>So, we also got the AAII <a href=\"https://ibb.co/ynQhYRg\">survey</a> yesterday, which for me personally, was a good indicator that stocks may still go up, as the bullish number of investors declined by 4.6%, with most of them switching to a neutral view of the stock market. There are still a lot more investors that are bullish compared to the historical average of 38% but, this is an improving in the last weeks, as this is a very good contrarian indicator. When more people tend to be bearish that is usually a good sign that you should just go and buy stocks, as you can mostly buy them at a discount, while when to many people are bullish, there is a significantly bigger risk of a pullback or correction nearing the stock market.</p>\n\n<p><a href=\"https://ibb.co/5BwsTzH\">Yesterday</a> we saw the FED keeping rates unchanged and signaling that they will continue to keep a near-zero rate through 2023 to support the economic recovery.</p>\n\n<p>They also announced that the economy is expected to contract by only 2.4% in 2020, that is a big improvement from a contraction of 3.7% previously expected. They also expect the economy to grow by 4.2% next year and by more than 3% in 2022, with both revisions also being up from the previous estimates. They also vowed to keep buying bonds until there is substantial economic progress in the US, so they are expected to continue to buy $120B, with $80B in Treasury securities and another $40B in mortgage-backed securities.</p>\n\n<p>Other revisions in the projected economic data also showed an improved outlook in the unemployment rate, which is expected to drop to 3.7% by 2023.</p>\n\n<p>The FED Chief Powell also reinforced the commitment to aid the economy with even more easing if it deems it necessary while also suggesting they will give ample warning before tapering bond purchases.</p>\n\n<p>This was happening while the congress was still haggling over details on a bigger $900B relief <a href=\"https://ibb.co/PQBrH2Y\">BILL</a>. We also saw a major change from the last day as now it is expected that it will include a 600$ stimulus check and extended unemployment benefits. I think this must be agreed on as soon as today if it stands a chance of passing by the end of the week, even if Congress leaders have repeatedly told they will remain in session as long as needed, even working through the weekend, they should just put their act together and pass the stuff they can agree on so that uncertainty goes away, at least for the moment.</p>\n\n<p>We also have some interesting <a href=\"https://ibb.co/vHCS87T\">earnings</a> reports coming today with FedEx, BlackBerry and General Mills.</p>\n\n<p><a href=\"https://ibb.co/D89m06D\">FedEx</a> is expected to post an EPS of over 4$, that would be up almost 60% over last year with an operating Margin of 7.1%. FedEx has also just received an upgrade from Credit Suisse based on accelerating e-commerce trends with a longer and stronger holiday season than expected.</p>\n\n<p><a href=\"https://ibb.co/tL2qNRb\">JABIL</a> just reported while writing this post a nice surprise due to the high demand in the new Apple lineup, with a beat of 34 cents on earnings and almost $800M on revenues. The stock skyrocketed after the release.</p>\n\n<p>We also got <a href=\"https://ibb.co/f9pLZxP\">Lennar</a> earnings after the close yesterday, as they beat the estimates easily, while also offering better numbers in new orders and guidance. As they expect more than 62K deliveries and 24% gross margins in FY 2021, that is up from 53K and a 20.6% gross margin in FY2020, this pushed the stock up 3% in after hours, in an unexpected move to the upside for me, despite my expectations for a great quarter for the company.</p>\n\n<p>In other stock market <a href=\"https://ibb.co/C82FmBg\">news</a>, we saw Roku gaining more than 5% in after-hours, after they finally reached an agreement with Warner Media to make HBO Max available directly to their streaming business.</p>\n\n<p>Meanwhile, gambling seems to be getting a boost every other day, as the most <a href=\"https://ibb.co/YhtQJH9\">recent</a> comment from Cuomo, made investors feel like gambling could become a big source of income for the state of New York. This boosted companies like DraftKings and Penn Gaming even more, as gambling is coming faster than expected in the entire country. <a href=\"https://ibb.co/1QdMW97\">DraftKings</a> also managed to strike a deal to launch a brand-new retail gift card just in time for the holiday season. This will be available in multiple convenience stores and is a good way for DraftKings to attract even more users to their platform in my opinion.</p>\n\n<p>We Also saw <a href=\"https://ibb.co/yVS3v1H\">companies</a> lose ground yesterday like Fiverr which dropped in early trading before recovering to finish -2% for the day, after a report that Facebook is eyeing an entry into the gig business, this would be a major competitor that could eat up a lot of growth that Fiverr expected</p>\n\n<p>Let’s hope for another great day in the market as the <a href=\"https://ibb.co/1zf63r8\">FUTURES</a> seem to be pointing at a good open, hopefully some green action continues after that.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [{"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 100, "id": "gid_1", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Shows the Silver Award... and that's it.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Silver", "resized_static_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_format": null, "icon_height": 512, "penny_price": null, "award_type": "global", "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kexuve", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 7, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/", "subreddit_subscribers": 1711418, "created_utc": 1608213300.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kexuve", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg5309l", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kexuve", "score": 6, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "\\~Tl:dr\\~ Buy  DKNG, PENN\\~", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>~Tl:dr~ Buy  DKNG, PENN~</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/gg5309l/", "num_reports": null, "locked": false, "name": "t1_gg5309l", "created": 1608242105.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608213305.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kexuve", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg55y7e", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "cadehalada", "fullname": "t2_6y03y"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kexuve", "score": 4, "author_fullname": "t2_6y03y", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Do you do this every week? It's nice.\n\nDidnt know fiverr was a stock. But it is one I would love to short. Tried it once for a few months as a seller and hated it.\n\nCant believe it's a $7 billion company.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Do you do this every week? It&#39;s nice.</p>\n\n<p>Didnt know fiverr was a stock. But it is one I would love to short. Tried it once for a few months as a seller and hated it.</p>\n\n<p>Cant believe it&#39;s a $7 billion company.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/gg55y7e/", "num_reports": null, "locked": false, "name": "t1_gg55y7e", "created": 1608243922.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608215122.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kexuve", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg56br5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gg55y7e", "score": 6, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "I do this almost every day if i have time", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I do this almost every day if i have time</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/gg56br5/", "num_reports": null, "locked": false, "name": "t1_gg56br5", "created": 1608244143.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608215343.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kexuve", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg5nxr2", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "roughactionhank", "fullname": "t2_39nb6vyb"}, "can_mod_post": false, "created_utc": 1608224418.0, "send_replies": true, "parent_id": "t1_gg56br5", "score": 1, "author_fullname": "t2_39nb6vyb", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Gunna follow you. You useful son of a bitch.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Gunna follow you. You useful son of a bitch.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/gg5nxr2/", "num_reports": null, "locked": false, "name": "t1_gg5nxr2", "created": 1608253218.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kexuve", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gg546gk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "lilbrunchie", "fullname": "t2_6dsqcmz5"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kexuve", "score": 3, "author_fullname": "t2_6dsqcmz5", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "No mention of STEEL?!  REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No mention of STEEL?!  REEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEEE</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kexuve/stock_market_news_today_fed_meeting_news_stimulus/gg546gk/", "num_reports": null, "locked": false, "name": "t1_gg546gk", "created": 1608242843.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608214043.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}