{"approved_at_utc": null, "selftext": " Here is a shamelessly stolen DD that I am investing in. Just FYI, I'm up 20% so far.\n\n\\-----------------------------------------------------------------------------------------------------------------------------------\n\n**Summary:** CD Projekt’s current stock valuation does not reflect the transformative effect of *Cyberpunk 2077* which will be released on Dec 10, 2020. RED engine 4 will be an asset that will provide a unique game development ability to the company in the future. Delays and uncertainty around the launch of *Cyberpunk 2077* in addition to sparse analyst coverage of the company have resulted in suppressed stock price and present a great risk vs reward ratio for investors.\n\n# Introduction\n\nCD Projekt SA ($OTGLY) is a polish company that with its subsidiaries develops and publishes videogames in addition to owning GOG.com platform. The firm derives most of its revenues from CD Projekt Red segment, which is best known for *The Witcher* series. *Cyberpunk 2077* is the latest and the most ambitious project by the company. We expect the video game market to grow in coming years, reflecting the continuing popularity of interactive entertainment. The demographics of the gaming industry have broadened significantly in recent years, with video games becoming an increasingly popular form of mainstream entertainment. Average gamer is 35 years old North American male with increasing disposable income. In response to gamers becoming more hardcore enthusiast, CD Projekt Red has dedicated significant resources to develop and publish high-quality interactive role-playing games that appeal to hardcore gamers.\n\n# Shares\n\nCD Projekt SA trades on Warsaw Stock Exchange which is denominated in Polish złoty. Only recently $OTGLY American Depositary Receipt which represent ¼ of a CD.R share has been available to OTC investors in North America. Since most investment firms avoid investing in assets not denominated in USD, the coverage of CD Projekt SA is sparse, and shares are undersubscribed. European investors that prefer investing using Euro may invest 7CD, which is traded in Frankfurt stock exchange. The company currently has a market capitalization of 9.5 Billion USD. It has 15X its market cap in the past 5 years due to success of *The Witcher* series. The board owns 1/3 of the shares and 2/3 is floated on stock markets. The two founders own 24% of the company.\n\n# CD Projekt Red Game Development\n\nCD Projekt Red invests significant resources in games that it develops. It does not divide its resources trying to make and maintain multiple projects. Their 121-million-dollar investment in development of *Cyberpunk 2077* is reflective of that philosophy. *Cyberpunk 2077* was announced in May 2012 and in January 2013 a teaser trailer was released.\n\nTheir in house developed RED engine 4 with Ray Tracing Technology is a great asset which will benefit future iterations of *Cyberpunk* and *The Witcher* series. This is also beneficial to the company since it does not have to license its game development engine from third party companies.\n\nDelays and release problems are common themes for CD Projekt Red and its founders (Marcin Iwiński and Michał Kiciński). At no point in time were they able to release a major game without any delays or even with just minor delays. They even took the company to the brink of bankruptcy about a decade ago due to mismanagement of game development. *Cyberpunk 2077* release has not been any different and has been fraught with delays. Initial release of April 16th, 2020 was first delayed to Sept 17, then to Nov 19th and finally to Dec 10th. The last delay was after the company mentioned that the game has gone “gold”, which means the code is finalized. The delays were unfortunate since they have resulted in loss of sales during the time that video game industry benefited from school closures and stay at home gaming due to Covid-19 shelter in place orders. Furthermore, the delay from Nov 19th will cause some shoppers to choose alternative games as thanksgiving gifts. However, we believe that gamers will flock to this game due to uniqueness of its content, depth of game development, ray tracing technology, and a multifaceted storyline.\n\nThe history of CD Projekt game development and success can be found the following chart:\n\n&#x200B;\n\nhttps://preview.redd.it/i48uqni8vf261.png?width=700&format=png&auto=webp&s=ef825026b3bca3abffab2e3b590dcb9fedbdbedf\n\nAll the information above is based on our best research and accuracy of the information cannot be guaranteed.\n\n# Cyberpunk 2077:\n\nThe hype around *Cyberpunk 2077* is unlike any other game. Any material posted on social media instantly receives millions of views. Official trailers have amassed 50 million views online. Any post on social media receives more engagement than Red Dead Redemption II and Call of Duty Black Ops Cold War. CD Projekt Red has a fantastic track record for pleasing gamers. CD Projekt Red’s high level of craftsmanship of *The Witcher 3*, and promising gameplay reviews and demos have resulted in spectacular levels of excitement among fans. *Cyberpunk 2077* was the winner of Best PS Game, Best PC Game, Best RPG Game, and Most Wanted Game in 2020 Gamescom.\n\nThe fact that *Cyberpunk 2077* is compatible with eight generation consoles (PS4, Xbox One) in addition to ninth generation consoles increases its addressable market significantly. Gamers who do not want to upgrade to ninth generation consoles will have limited options in future; one of which will be *Cyberpunk*. This creates a significant and often overlooked advantage for *Cyberpunk 2077*.\n\n*Cyberpunk 2077* has great voice actors. Keanu Reeves getting most of the attention as Johnny Silverhand. Recruiting of Keanu Reeves was an excellent decision given his roles as in \\*The Matrix (\\*A cyberpunk genre movie), and *John Wick (An action-thriller).* There is also the following: Michael-Leon Wooley as Dexter \"Dex\" DeShawn. Grimes as Lizzy Wizzy. Samuel Barnett as Delamain A.I. Jason Hightower as Jackie Welles. Mark Holden as Doctor Paradox/Various Others. Cherami Leigh, Gavin Drea, Lidia Sadowa, Kamil Kula as Main Character/Protagonist \"V\".\n\nCyberpunk genre has a devout following. It is largely considered a subgenre of science fiction in a dystopian future. It has been proven engaging and attractive to mostly male target audience. It’s focus on high-tech lowlifes dealing with breakdown of societal order could not be any more relevant than these days. *Cyberpunk 2077* taps into fantasy of advanced technological and scientific achievements, such as artificial intelligence and cybernetics, juxtaposed with breakdown and radical change in the social order.\n\nWe anticipate *Cyberpunk 2077* to have record-breaking sales. Our predictions are more optimistic than that of others; however, we believe it is reflective of the game quality and current condition of gaming industry. The conservative version of our estimations can be found in the following chart:\n\n&#x200B;\n\nhttps://preview.redd.it/y4bhwh77vf261.png?width=877&format=png&auto=webp&s=96fe1118a7acc8b9212ec57ebede039e89b2d7f6\n\nThe figures for second year will depend largely on success of *Cyberpunk: Edgerunners*, an anime spin-off being produced for Netflix. It is scheduled to premiere on Netflix in 2022. The figures above do not account for Collector’s editions sales since it is unclear if CD Projekt is able to produce and supply them in the needed quantities on time. Collector’s editions are marketed at $250.\n\nWe anticipate about 60% of *Cyberpunk 2077* buyers to be in North America and 30% in Europe. Hence, there is negligible currency risk. Collector’s edition will be a key driver of North American excess sales.\n\n*Cyberpunk 2077* will offer no in game purchases. We view this with mixed feelings. Lack of loot boxes, subscriptions services or other major ancillary digital sources of revenue make the game feel authentic to gamers; which in turn results in increased sales. This revenue can be deferred to the MMORPG iteration of the franchise when released. The goodwill created by *Cyberpunk 2077* will not be reflected in bank accounts of the company yet but will lock in gamers into *Cyberpunk* series and create more enthusiasm for future release.\n\n# Discounting for risk:\n\nWhen compared to other mega launches and our expectations of sales, *Cyberpunk 2077* pre-orders are 40% behind. We attribute this to the perpetual delays and lack of preceding games in this title. Gamers are completely disillusioned by perpetual delays. Founders’ lack of transparency about game development and dishonesty about game “going gold” are of concern for investors. Management appears to be tone deaf to gamers and share holders’ expectations. In 2018 CEO blatantly refused to answer questions about development costs of *Thronebreakers: The Witcher Tales*. These issues cannot be resolved due to management’s hostility to mergers or being acquired by other firms. EA’s effort to buy the firm were rebuffed in the past. The management fails to understand that as a publicly traded company they have to work in the best interest of shareholder. As mentioned earlier, one third of the shares are owned by the board members.\n\nDeveloping melee combat in a first-person perspective is difficult. \\*Cyberpunk 2077’\\*s mechanics may fall short of high expectations. This was a minor issue that plagued *The Witcher* series.\n\nOur risk assessment includes our concerns regarding delays, technical difficulties, the unpredictability of video game sales, and an inherently hit-driven business model. With its smaller portfolio of games vs. other studios, we see CD Projekt carrying higher risk than its North American rivals. Due to these factors, we believe a 30% risk premium is justified.\n\n# CD Projekt Operations:\n\n· **Brands:** *The Witcher, Cyberpunk*, and GOG.com all are quality brands that ensure high margin operations.\n\n· **Technology:** REDengine allowing unique development of open-world RPGs with Ray tracing.\n\n· **Gamer goodwill:** The goodwill created by removing Digital Rights Management in *The Witcher* series and GOG games the team has generated the highest amount of goodwill in the gamer community (at times to the detriment of profits).\n\n· **Distribution:** GOG and direct distribution of games\n\n· **Development team:** Capable and experienced team of developers who are passionate about their games\n\n# Disclosures:\n\n# Not financial advice, or offer to buy or sell securities. Opinion only\n\n[www.CopalCapital.com/legal](http://www.copalcapital.com/legal)", "author_fullname": "t2_5ppe13es", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "CD Projekt is an underappreciated asset with an imminent transformative catalyst (Cyberpunk 2077 release)", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 103, "top_awarded_type": null, "hide_score": true, "media_metadata": {"i48uqni8vf261": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 79, "x": 108, "u": "https://preview.redd.it/i48uqni8vf261.png?width=108&crop=smart&auto=webp&s=e703489c58615b72a1fcf12a35ecc3df6b968fb1"}, {"y": 159, "x": 216, "u": "https://preview.redd.it/i48uqni8vf261.png?width=216&crop=smart&auto=webp&s=5b9ee2bddff861964ce9b201766b289e19387d57"}, {"y": 236, "x": 320, "u": "https://preview.redd.it/i48uqni8vf261.png?width=320&crop=smart&auto=webp&s=58698dd954bff1303a4be8312237990c7edf8f92"}, {"y": 472, "x": 640, "u": "https://preview.redd.it/i48uqni8vf261.png?width=640&crop=smart&auto=webp&s=46a082efb373712546a7313d958a9f7155f2e134"}], "s": {"y": 517, "x": 700, "u": "https://preview.redd.it/i48uqni8vf261.png?width=700&format=png&auto=webp&s=ef825026b3bca3abffab2e3b590dcb9fedbdbedf"}, "id": "i48uqni8vf261"}, "y4bhwh77vf261": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 16, "x": 108, "u": "https://preview.redd.it/y4bhwh77vf261.png?width=108&crop=smart&auto=webp&s=1be692fe8585c833151e99f90a25a134972c282b"}, {"y": 33, "x": 216, "u": "https://preview.redd.it/y4bhwh77vf261.png?width=216&crop=smart&auto=webp&s=952cc108dd5cd54ed054afe31b9f9cec8452db5e"}, {"y": 49, "x": 320, "u": "https://preview.redd.it/y4bhwh77vf261.png?width=320&crop=smart&auto=webp&s=2b76e49fed221d661b3b3af562349126baef73c9"}, {"y": 98, "x": 640, "u": "https://preview.redd.it/y4bhwh77vf261.png?width=640&crop=smart&auto=webp&s=95c9f7dd78f659c0745461b0c69a3c54566f585c"}], "s": {"y": 135, "x": 877, "u": "https://preview.redd.it/y4bhwh77vf261.png?width=877&format=png&auto=webp&s=96fe1118a7acc8b9212ec57ebede039e89b2d7f6"}, "id": "y4bhwh77vf261"}}, "name": "t3_k44qrk", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.72, "author_flair_background_color": "", "subreddit_type": "public", "ups": 17, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 17, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/e8g8Qvy01OE0VjeFpTye8QOhRAOdlcJnTQOW6_DLyrs.jpg", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [{"e": "text", "t": "\u001b201122:3:1"}], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1606797749.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "richtext", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Here is a shamelessly stolen DD that I am investing in. Just FYI, I&#39;m up 20% so far.</p>\n\n<p>-----------------------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Summary:</strong> CD Projekt’s current stock valuation does not reflect the transformative effect of <em>Cyberpunk 2077</em> which will be released on Dec 10, 2020. RED engine 4 will be an asset that will provide a unique game development ability to the company in the future. Delays and uncertainty around the launch of <em>Cyberpunk 2077</em> in addition to sparse analyst coverage of the company have resulted in suppressed stock price and present a great risk vs reward ratio for investors.</p>\n\n<h1>Introduction</h1>\n\n<p>CD Projekt SA ($OTGLY) is a polish company that with its subsidiaries develops and publishes videogames in addition to owning GOG.com platform. The firm derives most of its revenues from CD Projekt Red segment, which is best known for <em>The Witcher</em> series. <em>Cyberpunk 2077</em> is the latest and the most ambitious project by the company. We expect the video game market to grow in coming years, reflecting the continuing popularity of interactive entertainment. The demographics of the gaming industry have broadened significantly in recent years, with video games becoming an increasingly popular form of mainstream entertainment. Average gamer is 35 years old North American male with increasing disposable income. In response to gamers becoming more hardcore enthusiast, CD Projekt Red has dedicated significant resources to develop and publish high-quality interactive role-playing games that appeal to hardcore gamers.</p>\n\n<h1>Shares</h1>\n\n<p>CD Projekt SA trades on Warsaw Stock Exchange which is denominated in Polish złoty. Only recently $OTGLY American Depositary Receipt which represent ¼ of a CD.R share has been available to OTC investors in North America. Since most investment firms avoid investing in assets not denominated in USD, the coverage of CD Projekt SA is sparse, and shares are undersubscribed. European investors that prefer investing using Euro may invest 7CD, which is traded in Frankfurt stock exchange. The company currently has a market capitalization of 9.5 Billion USD. It has 15X its market cap in the past 5 years due to success of <em>The Witcher</em> series. The board owns 1/3 of the shares and 2/3 is floated on stock markets. The two founders own 24% of the company.</p>\n\n<h1>CD Projekt Red Game Development</h1>\n\n<p>CD Projekt Red invests significant resources in games that it develops. It does not divide its resources trying to make and maintain multiple projects. Their 121-million-dollar investment in development of <em>Cyberpunk 2077</em> is reflective of that philosophy. <em>Cyberpunk 2077</em> was announced in May 2012 and in January 2013 a teaser trailer was released.</p>\n\n<p>Their in house developed RED engine 4 with Ray Tracing Technology is a great asset which will benefit future iterations of <em>Cyberpunk</em> and <em>The Witcher</em> series. This is also beneficial to the company since it does not have to license its game development engine from third party companies.</p>\n\n<p>Delays and release problems are common themes for CD Projekt Red and its founders (Marcin Iwiński and Michał Kiciński). At no point in time were they able to release a major game without any delays or even with just minor delays. They even took the company to the brink of bankruptcy about a decade ago due to mismanagement of game development. <em>Cyberpunk 2077</em> release has not been any different and has been fraught with delays. Initial release of April 16th, 2020 was first delayed to Sept 17, then to Nov 19th and finally to Dec 10th. The last delay was after the company mentioned that the game has gone “gold”, which means the code is finalized. The delays were unfortunate since they have resulted in loss of sales during the time that video game industry benefited from school closures and stay at home gaming due to Covid-19 shelter in place orders. Furthermore, the delay from Nov 19th will cause some shoppers to choose alternative games as thanksgiving gifts. However, we believe that gamers will flock to this game due to uniqueness of its content, depth of game development, ray tracing technology, and a multifaceted storyline.</p>\n\n<p>The history of CD Projekt game development and success can be found the following chart:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/i48uqni8vf261.png?width=700&amp;format=png&amp;auto=webp&amp;s=ef825026b3bca3abffab2e3b590dcb9fedbdbedf\">https://preview.redd.it/i48uqni8vf261.png?width=700&amp;format=png&amp;auto=webp&amp;s=ef825026b3bca3abffab2e3b590dcb9fedbdbedf</a></p>\n\n<p>All the information above is based on our best research and accuracy of the information cannot be guaranteed.</p>\n\n<h1>Cyberpunk 2077:</h1>\n\n<p>The hype around <em>Cyberpunk 2077</em> is unlike any other game. Any material posted on social media instantly receives millions of views. Official trailers have amassed 50 million views online. Any post on social media receives more engagement than Red Dead Redemption II and Call of Duty Black Ops Cold War. CD Projekt Red has a fantastic track record for pleasing gamers. CD Projekt Red’s high level of craftsmanship of <em>The Witcher 3</em>, and promising gameplay reviews and demos have resulted in spectacular levels of excitement among fans. <em>Cyberpunk 2077</em> was the winner of Best PS Game, Best PC Game, Best RPG Game, and Most Wanted Game in 2020 Gamescom.</p>\n\n<p>The fact that <em>Cyberpunk 2077</em> is compatible with eight generation consoles (PS4, Xbox One) in addition to ninth generation consoles increases its addressable market significantly. Gamers who do not want to upgrade to ninth generation consoles will have limited options in future; one of which will be <em>Cyberpunk</em>. This creates a significant and often overlooked advantage for <em>Cyberpunk 2077</em>.</p>\n\n<p><em>Cyberpunk 2077</em> has great voice actors. Keanu Reeves getting most of the attention as Johnny Silverhand. Recruiting of Keanu Reeves was an excellent decision given his roles as in *The Matrix (*A cyberpunk genre movie), and <em>John Wick (An action-thriller).</em> There is also the following: Michael-Leon Wooley as Dexter &quot;Dex&quot; DeShawn. Grimes as Lizzy Wizzy. Samuel Barnett as Delamain A.I. Jason Hightower as Jackie Welles. Mark Holden as Doctor Paradox/Various Others. Cherami Leigh, Gavin Drea, Lidia Sadowa, Kamil Kula as Main Character/Protagonist &quot;V&quot;.</p>\n\n<p>Cyberpunk genre has a devout following. It is largely considered a subgenre of science fiction in a dystopian future. It has been proven engaging and attractive to mostly male target audience. It’s focus on high-tech lowlifes dealing with breakdown of societal order could not be any more relevant than these days. <em>Cyberpunk 2077</em> taps into fantasy of advanced technological and scientific achievements, such as artificial intelligence and cybernetics, juxtaposed with breakdown and radical change in the social order.</p>\n\n<p>We anticipate <em>Cyberpunk 2077</em> to have record-breaking sales. Our predictions are more optimistic than that of others; however, we believe it is reflective of the game quality and current condition of gaming industry. The conservative version of our estimations can be found in the following chart:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/y4bhwh77vf261.png?width=877&amp;format=png&amp;auto=webp&amp;s=96fe1118a7acc8b9212ec57ebede039e89b2d7f6\">https://preview.redd.it/y4bhwh77vf261.png?width=877&amp;format=png&amp;auto=webp&amp;s=96fe1118a7acc8b9212ec57ebede039e89b2d7f6</a></p>\n\n<p>The figures for second year will depend largely on success of <em>Cyberpunk: Edgerunners</em>, an anime spin-off being produced for Netflix. It is scheduled to premiere on Netflix in 2022. The figures above do not account for Collector’s editions sales since it is unclear if CD Projekt is able to produce and supply them in the needed quantities on time. Collector’s editions are marketed at $250.</p>\n\n<p>We anticipate about 60% of <em>Cyberpunk 2077</em> buyers to be in North America and 30% in Europe. Hence, there is negligible currency risk. Collector’s edition will be a key driver of North American excess sales.</p>\n\n<p><em>Cyberpunk 2077</em> will offer no in game purchases. We view this with mixed feelings. Lack of loot boxes, subscriptions services or other major ancillary digital sources of revenue make the game feel authentic to gamers; which in turn results in increased sales. This revenue can be deferred to the MMORPG iteration of the franchise when released. The goodwill created by <em>Cyberpunk 2077</em> will not be reflected in bank accounts of the company yet but will lock in gamers into <em>Cyberpunk</em> series and create more enthusiasm for future release.</p>\n\n<h1>Discounting for risk:</h1>\n\n<p>When compared to other mega launches and our expectations of sales, <em>Cyberpunk 2077</em> pre-orders are 40% behind. We attribute this to the perpetual delays and lack of preceding games in this title. Gamers are completely disillusioned by perpetual delays. Founders’ lack of transparency about game development and dishonesty about game “going gold” are of concern for investors. Management appears to be tone deaf to gamers and share holders’ expectations. In 2018 CEO blatantly refused to answer questions about development costs of <em>Thronebreakers: The Witcher Tales</em>. These issues cannot be resolved due to management’s hostility to mergers or being acquired by other firms. EA’s effort to buy the firm were rebuffed in the past. The management fails to understand that as a publicly traded company they have to work in the best interest of shareholder. As mentioned earlier, one third of the shares are owned by the board members.</p>\n\n<p>Developing melee combat in a first-person perspective is difficult. *Cyberpunk 2077’*s mechanics may fall short of high expectations. This was a minor issue that plagued <em>The Witcher</em> series.</p>\n\n<p>Our risk assessment includes our concerns regarding delays, technical difficulties, the unpredictability of video game sales, and an inherently hit-driven business model. With its smaller portfolio of games vs. other studios, we see CD Projekt carrying higher risk than its North American rivals. Due to these factors, we believe a 30% risk premium is justified.</p>\n\n<h1>CD Projekt Operations:</h1>\n\n<p>· <strong>Brands:</strong> <em>The Witcher, Cyberpunk</em>, and GOG.com all are quality brands that ensure high margin operations.</p>\n\n<p>· <strong>Technology:</strong> REDengine allowing unique development of open-world RPGs with Ray tracing.</p>\n\n<p>· <strong>Gamer goodwill:</strong> The goodwill created by removing Digital Rights Management in <em>The Witcher</em> series and GOG games the team has generated the highest amount of goodwill in the gamer community (at times to the detriment of profits).</p>\n\n<p>· <strong>Distribution:</strong> GOG and direct distribution of games</p>\n\n<p>· <strong>Development team:</strong> Capable and experienced team of developers who are passionate about their games</p>\n\n<h1>Disclosures:</h1>\n\n<h1>Not financial advice, or offer to buy or sell securities. Opinion only</h1>\n\n<p><a href=\"http://www.copalcapital.com/legal\">www.CopalCapital.com/legal</a></p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": "\u001b201122:3:1", "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "k44qrk", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "_WinnerTakesAll_", "fullname": "t2_5ppe13es"}, "discussion_type": null, "num_comments": 28, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": "dark", "permalink": "/r/wallstreetbets/comments/k44qrk/cd_projekt_is_an_underappreciated_asset_with_an/", "parent_whitelist_status": "no_ads", "stickied": true, "url": "https://www.reddit.com/r/wallstreetbets/comments/k44qrk/cd_projekt_is_an_underappreciated_asset_with_an/", "subreddit_subscribers": 1635472, "created_utc": 1606768949.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k44qrk", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "ge6p2lo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k44qrk", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k44qrk&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k44qrk&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=k44qrk)\n___\n ^comment ^will ^disappear ^--- ^232 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1606769462.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k44qrk&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k44qrk&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=k44qrk\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>232</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/k44qrk/cd_projekt_is_an_underappreciated_asset_with_an/ge6p2lo/", "num_reports": null, "locked": false, "name": "t1_ge6p2lo", "created": 1606797969.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1606769169.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 19, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k44qrk", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge6ox14", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0x01111f", "fullname": "t2_1nyvznz5"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k44qrk", "score": 19, "author_fullname": "t2_1nyvznz5", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "No", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k44qrk/cd_projekt_is_an_underappreciated_asset_with_an/ge6ox14/", "num_reports": null, "locked": false, "name": "t1_ge6ox14", "created": 1606797896.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606769096.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 11, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k44qrk", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge6p676", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Waterme1one", "fullname": "t2_1hnoue2c"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k44qrk", "score": 11, "author_fullname": "t2_1hnoue2c", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Believe me I'd throw all my money at them if they were on RH", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Believe me I&#39;d throw all my money at them if they were on RH</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k44qrk/cd_projekt_is_an_underappreciated_asset_with_an/ge6p676/", "num_reports": null, "locked": false, "name": "t1_ge6p676", "created": 1606798016.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606769216.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}