{"approved_at_utc": null, "selftext": "**Snowflake flops on earnings, while CrowdStrike and Okta spike, Will Chinese companies get delisted from the US? Let’s talk about what happened yesterday in the stock market**\n\nHey everyone! So, let’s start with the recap of yesterday as we saw both the [DOW JONES](https://ibb.co/sKKNVjr) and the [SP500](https://ibb.co/PzxfrWt) up about 0,2% with the SP closing at a new record high while the [NASDAQ COMPOSITE](https://ibb.co/f909849) trailed and finished just below the previous close, down only 0,05%. We did see a spike in the [VIX](https://ibb.co/QMqhtMv) of almost 2% as this was quite a volatile day with the market dropping at the open before regaining traction in the middle of the trading day. We saw a relatively even market yesterday as 56% of companies were advancing on below average volume as most of the companies continue to trade well above the moving averages. The leading [sectors](https://ibb.co/d0740g8) yesterday were Energy and Financials with Materials and Real Estate lagging the market as [Small and Large Cap value plays](https://ibb.co/hLDgLmm) kept the market positive with companies like Boeing being up [more than 5%](https://ibb.co/b3jRN2s) for the day after good news on multiple fronts like Ryanair [probably](https://ibb.co/8xpKXxQ) acquiring new planes and the [first flights made](https://ibb.co/qmJNkPc) with the new 737 by American.\n\n[STOCK MARKET CHART](https://ibb.co/BPVFx2d)\n\nHere is a complete [HEAT MAP](https://ibb.co/TKsdbDn) from yesterday as we saw an even market as I said earlier, with Salesforce being the only big looser in big caps as the stock continued to dive after the Slack news. I think this was a great opportunity to buy the stock in a dip as I doubled my portfolio value on the company from 1,5% to 3% of my portfolio while also getting in [more](https://ibb.co/Pr47Th5) on Boeing, Apple, Netflix and a couple of other companies.\n\nWe also got the AAII investor sentiment [survey](https://ibb.co/KxkbTbb) yesterday as the percentage of bulls has increased constantly in the last month. This is usually a very bad sign for the stock market as corrections, consolidations or even crashes occur when people tend be over-bullish. I don’t think this will be the case at least for a couple of weeks, though I think we are poised for a small market correction in the near future before moving on even higher.\n\nHere is the most interesting [economic data](https://ibb.co/PD2XBsn) that will be released today as we get new jobless claims as well as services PMI and ISM. I expect the jobless claims to continue to get worse sadly for the next couple of weeks at least until the vaccine starts to get distributed with ADP November jobs [numbers](https://ibb.co/S6V64xJ) coming in yesterday shy of forecasts and at the lowest level since July, this is not great news for the jobless claims that will pop up early today. [CALENDAR](https://ibb.co/wQ3mK2b)\n\n\\[Later EDIT\\] - Jobless claims came in way better than expected : [NUMBERS](https://ibb.co/Jscz1SZ)\n\nGreat news came in this morning as the US is [expected](https://ibb.co/vYp0LDT) to have capability to immunize at least 100 million people by the end of February, that is great news, as specialist believe a herd immunity can be reached if there are about 60-80% of people either immunized or have already developed natural antibodies.\n\nWe also have a couple of interesting earnings [scheduled](https://ibb.co/6nJjrRY) for Today, as I expect Kroger to beat the estimates, though I didn’t get any action on this, I did get some [action](https://ibb.co/y0ThT5D) on [Marvell](https://ibb.co/34x6mpN) as I bought the stock about a week ago. While I expected Dollar General to do alright and I think we might see some disappointment in [DocuSign](https://ibb.co/BPsz5Mj) just like I thought we would see bad reaction to great earnings with Zoom.\n\n\\[Later Edit:\n\n\\-Dollar General [reported](https://ibb.co/gJPRpXM) a beat on top & bottom line but did not offer guidance and the shares of the company have pulled back in pre-market trading 1,6%\n\n\\-Kroger [beats EPS](https://ibb.co/bgsMckw) by 0,05$ but misses on revenue by $310M, shares down 4% pre-market\\]\n\nAlongside Marvell which I expect to beat the estimates of 25cents per share and also beat on revenue, I also [bought](https://ibb.co/y0ThT5D) Okta which released earnings yesterday and [crushed](https://ibb.co/VmvBzYV) expectations as recurring [subscription revenue](https://ibb.co/nftnckz) grew by more than 40% year over year as well as big increases in operating margins, billings and customers. This led the stock to [spike 8%](https://ibb.co/xzyy0qr) after hours as I will make a good profit on the investment and may even consider holding this position for the long term in the company.\n\nAlso, one other staple company from my [portfolio](https://ibb.co/pKbNy8M), CrowdStrike released earnings yesterday and delivered great [results](https://ibb.co/dgyfn8g) as the annual recurring [revenue](https://ibb.co/N6vhWfW) has grown more than 80% year over year while adding over 11hundred new subscriptions this quarter while also improving [gross margins](https://ibb.co/THfGJ2c) by 2%. The company also gave guidance for next quarter way over analyst expectations as that made the [stock soar 13%](https://ibb.co/ZGxbsRx)\n\nThe only big disappointment from earnings released yesterday was [SNOWFLAKE](https://ibb.co/6BhYKHC) as they have suffered the same way as Palantir in the first earnings report as analysts were expecting even bigger numbers after the huge rally the stock has had since the IPO. One Morgan Stanley analyst said that they needed to deliver around a 140% growth of revenue to make a good impact on the stock as the company’s revenue only grew up 102%. If it continues to drop it might find the way to a good entry point, but for the moment I believe this price is to high for the company.\n\nWe also got news yesterday as the House [passed](https://ibb.co/w0Ly1MP) the billt hat allows Chinese companies to be delisted if they do not comply with new auditing rules, as this measure is expected to by signed fast by Trump.\n\nI think this is good news for investors in the long-run as I don’t believe big companies like Alibaba will suffer from this, with BABA being audited by established PWC Hong Kong auditors, though this might be a bigger problem for smaller companies that are not able to follow the rules. I still believe Alibaba is a great company to buy at this price point as the company has [dropped](https://ibb.co/W283kbG) due to bad news developments in the last 2 months, but I think has a lot of room to go higher, even testing the previous highs of 319$ and surpassing them, especially with this holiday season having great sales numbers.\n\nThis news combined with the recent [upgrade](https://ibb.co/c2mwgPc) at Goldman was music to the ears of Tesla investors as the stock rose almost 3% after hours and erased the daily losses.\n\nOther news came as the House is expected to vote on the [MORE ACT](https://ibb.co/RgjnPgY), though this will be surely blocked in the Senate, this is still good news for the cannabis sector as states will likely legalize this way before we can a national bill.\n\nWhile Palantir dropped big yesterday after Morgan Stanley [warned](https://ibb.co/m4NsSWr) for a negative-risk reward in the stock as the stock has dropped more than 20% in the last 5 trading days, I sold out of my position on Palantir for a 40% profit recently but I may get back in if the price starts to make more sense.\n\nSo, with the latest developments, I believe investors should not forget about the FAANG stocks that have brought us back from the depths of the March lows. [FACEBOOK](https://ibb.co/gFd1S5R) still gives small business that will be back when the economy returns the best bang for the buck in advertising, especially with the great platform that Instagram has become.\n\nWhile [APPLE](https://ibb.co/j4YW4Qy) seems to be doing very well with the iPhone 12 sales and the new 5G cycle while also growing the services business very fast, that will bring them more and more steady cash flows for the company.\n\nDespite missing the latest sub numbers, [NETFLIX](https://ibb.co/LJ8fr37), is still producing a lot of great content, has the most subs and the most content available for streaming and I believe they will remain the best in business alongside with Disney+\n\nWhat can you say about [AMAZON](https://ibb.co/nrD5qnY) as they are a death star for every sector they get in… E-commerce is here to stay, and Amazon still has huge room for growth especially in Europe and Asia.\n\nWhile [GOOGLE](https://ibb.co/tz2htpn) was the laggard for most of the year, with travel & entertainment returning to advertising, this will be very good for the company, as travel is the biggest advertiser usually.\n\nThis companies will remain great owns for the long run, even if they underperform now, which I don’t expect, in the long-run this will remain some of the biggest winners in this new economy.\n\nAnd don’t forget December is usually a great month for stocks as people tend to not take profits on capital gains at the end of the year, so it is likely that people will keep the winners while also receiving a boost from the stock market Santa Claus effect.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "CROWDSTRIKE |OKTA | SNOWFLAKE |CHINA STOCKS ON THE WATCH| FAANG STOCKS & STOCK MARKET NEWS [12-03]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_k5xbdq", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.89, "author_flair_background_color": null, "subreddit_type": "public", "ups": 18, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 18, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1607004249.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607031399.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Snowflake flops on earnings, while CrowdStrike and Okta spike, Will Chinese companies get delisted from the US? Let’s talk about what happened yesterday in the stock market</strong></p>\n\n<p>Hey everyone! So, let’s start with the recap of yesterday as we saw both the <a href=\"https://ibb.co/sKKNVjr\">DOW JONES</a> and the <a href=\"https://ibb.co/PzxfrWt\">SP500</a> up about 0,2% with the SP closing at a new record high while the <a href=\"https://ibb.co/f909849\">NASDAQ COMPOSITE</a> trailed and finished just below the previous close, down only 0,05%. We did see a spike in the <a href=\"https://ibb.co/QMqhtMv\">VIX</a> of almost 2% as this was quite a volatile day with the market dropping at the open before regaining traction in the middle of the trading day. We saw a relatively even market yesterday as 56% of companies were advancing on below average volume as most of the companies continue to trade well above the moving averages. The leading <a href=\"https://ibb.co/d0740g8\">sectors</a> yesterday were Energy and Financials with Materials and Real Estate lagging the market as <a href=\"https://ibb.co/hLDgLmm\">Small and Large Cap value plays</a> kept the market positive with companies like Boeing being up <a href=\"https://ibb.co/b3jRN2s\">more than 5%</a> for the day after good news on multiple fronts like Ryanair <a href=\"https://ibb.co/8xpKXxQ\">probably</a> acquiring new planes and the <a href=\"https://ibb.co/qmJNkPc\">first flights made</a> with the new 737 by American.</p>\n\n<p><a href=\"https://ibb.co/BPVFx2d\">STOCK MARKET CHART</a></p>\n\n<p>Here is a complete <a href=\"https://ibb.co/TKsdbDn\">HEAT MAP</a> from yesterday as we saw an even market as I said earlier, with Salesforce being the only big looser in big caps as the stock continued to dive after the Slack news. I think this was a great opportunity to buy the stock in a dip as I doubled my portfolio value on the company from 1,5% to 3% of my portfolio while also getting in <a href=\"https://ibb.co/Pr47Th5\">more</a> on Boeing, Apple, Netflix and a couple of other companies.</p>\n\n<p>We also got the AAII investor sentiment <a href=\"https://ibb.co/KxkbTbb\">survey</a> yesterday as the percentage of bulls has increased constantly in the last month. This is usually a very bad sign for the stock market as corrections, consolidations or even crashes occur when people tend be over-bullish. I don’t think this will be the case at least for a couple of weeks, though I think we are poised for a small market correction in the near future before moving on even higher.</p>\n\n<p>Here is the most interesting <a href=\"https://ibb.co/PD2XBsn\">economic data</a> that will be released today as we get new jobless claims as well as services PMI and ISM. I expect the jobless claims to continue to get worse sadly for the next couple of weeks at least until the vaccine starts to get distributed with ADP November jobs <a href=\"https://ibb.co/S6V64xJ\">numbers</a> coming in yesterday shy of forecasts and at the lowest level since July, this is not great news for the jobless claims that will pop up early today. <a href=\"https://ibb.co/wQ3mK2b\">CALENDAR</a></p>\n\n<p>[Later EDIT] - Jobless claims came in way better than expected : <a href=\"https://ibb.co/Jscz1SZ\">NUMBERS</a></p>\n\n<p>Great news came in this morning as the US is <a href=\"https://ibb.co/vYp0LDT\">expected</a> to have capability to immunize at least 100 million people by the end of February, that is great news, as specialist believe a herd immunity can be reached if there are about 60-80% of people either immunized or have already developed natural antibodies.</p>\n\n<p>We also have a couple of interesting earnings <a href=\"https://ibb.co/6nJjrRY\">scheduled</a> for Today, as I expect Kroger to beat the estimates, though I didn’t get any action on this, I did get some <a href=\"https://ibb.co/y0ThT5D\">action</a> on <a href=\"https://ibb.co/34x6mpN\">Marvell</a> as I bought the stock about a week ago. While I expected Dollar General to do alright and I think we might see some disappointment in <a href=\"https://ibb.co/BPsz5Mj\">DocuSign</a> just like I thought we would see bad reaction to great earnings with Zoom.</p>\n\n<p>[Later Edit:</p>\n\n<p>-Dollar General <a href=\"https://ibb.co/gJPRpXM\">reported</a> a beat on top &amp; bottom line but did not offer guidance and the shares of the company have pulled back in pre-market trading 1,6%</p>\n\n<p>-Kroger <a href=\"https://ibb.co/bgsMckw\">beats EPS</a> by 0,05$ but misses on revenue by $310M, shares down 4% pre-market]</p>\n\n<p>Alongside Marvell which I expect to beat the estimates of 25cents per share and also beat on revenue, I also <a href=\"https://ibb.co/y0ThT5D\">bought</a> Okta which released earnings yesterday and <a href=\"https://ibb.co/VmvBzYV\">crushed</a> expectations as recurring <a href=\"https://ibb.co/nftnckz\">subscription revenue</a> grew by more than 40% year over year as well as big increases in operating margins, billings and customers. This led the stock to <a href=\"https://ibb.co/xzyy0qr\">spike 8%</a> after hours as I will make a good profit on the investment and may even consider holding this position for the long term in the company.</p>\n\n<p>Also, one other staple company from my <a href=\"https://ibb.co/pKbNy8M\">portfolio</a>, CrowdStrike released earnings yesterday and delivered great <a href=\"https://ibb.co/dgyfn8g\">results</a> as the annual recurring <a href=\"https://ibb.co/N6vhWfW\">revenue</a> has grown more than 80% year over year while adding over 11hundred new subscriptions this quarter while also improving <a href=\"https://ibb.co/THfGJ2c\">gross margins</a> by 2%. The company also gave guidance for next quarter way over analyst expectations as that made the <a href=\"https://ibb.co/ZGxbsRx\">stock soar 13%</a></p>\n\n<p>The only big disappointment from earnings released yesterday was <a href=\"https://ibb.co/6BhYKHC\">SNOWFLAKE</a> as they have suffered the same way as Palantir in the first earnings report as analysts were expecting even bigger numbers after the huge rally the stock has had since the IPO. One Morgan Stanley analyst said that they needed to deliver around a 140% growth of revenue to make a good impact on the stock as the company’s revenue only grew up 102%. If it continues to drop it might find the way to a good entry point, but for the moment I believe this price is to high for the company.</p>\n\n<p>We also got news yesterday as the House <a href=\"https://ibb.co/w0Ly1MP\">passed</a> the billt hat allows Chinese companies to be delisted if they do not comply with new auditing rules, as this measure is expected to by signed fast by Trump.</p>\n\n<p>I think this is good news for investors in the long-run as I don’t believe big companies like Alibaba will suffer from this, with BABA being audited by established PWC Hong Kong auditors, though this might be a bigger problem for smaller companies that are not able to follow the rules. I still believe Alibaba is a great company to buy at this price point as the company has <a href=\"https://ibb.co/W283kbG\">dropped</a> due to bad news developments in the last 2 months, but I think has a lot of room to go higher, even testing the previous highs of 319$ and surpassing them, especially with this holiday season having great sales numbers.</p>\n\n<p>This news combined with the recent <a href=\"https://ibb.co/c2mwgPc\">upgrade</a> at Goldman was music to the ears of Tesla investors as the stock rose almost 3% after hours and erased the daily losses.</p>\n\n<p>Other news came as the House is expected to vote on the <a href=\"https://ibb.co/RgjnPgY\">MORE ACT</a>, though this will be surely blocked in the Senate, this is still good news for the cannabis sector as states will likely legalize this way before we can a national bill.</p>\n\n<p>While Palantir dropped big yesterday after Morgan Stanley <a href=\"https://ibb.co/m4NsSWr\">warned</a> for a negative-risk reward in the stock as the stock has dropped more than 20% in the last 5 trading days, I sold out of my position on Palantir for a 40% profit recently but I may get back in if the price starts to make more sense.</p>\n\n<p>So, with the latest developments, I believe investors should not forget about the FAANG stocks that have brought us back from the depths of the March lows. <a href=\"https://ibb.co/gFd1S5R\">FACEBOOK</a> still gives small business that will be back when the economy returns the best bang for the buck in advertising, especially with the great platform that Instagram has become.</p>\n\n<p>While <a href=\"https://ibb.co/j4YW4Qy\">APPLE</a> seems to be doing very well with the iPhone 12 sales and the new 5G cycle while also growing the services business very fast, that will bring them more and more steady cash flows for the company.</p>\n\n<p>Despite missing the latest sub numbers, <a href=\"https://ibb.co/LJ8fr37\">NETFLIX</a>, is still producing a lot of great content, has the most subs and the most content available for streaming and I believe they will remain the best in business alongside with Disney+</p>\n\n<p>What can you say about <a href=\"https://ibb.co/nrD5qnY\">AMAZON</a> as they are a death star for every sector they get in… E-commerce is here to stay, and Amazon still has huge room for growth especially in Europe and Asia.</p>\n\n<p>While <a href=\"https://ibb.co/tz2htpn\">GOOGLE</a> was the laggard for most of the year, with travel &amp; entertainment returning to advertising, this will be very good for the company, as travel is the biggest advertiser usually.</p>\n\n<p>This companies will remain great owns for the long run, even if they underperform now, which I don’t expect, in the long-run this will remain some of the biggest winners in this new economy.</p>\n\n<p>And don’t forget December is usually a great month for stocks as people tend to not take profits on capital gains at the end of the year, so it is likely that people will keep the winners while also receiving a boost from the stock market Santa Claus effect.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/w0smdGFCyZTbqHUTVxl-p7T9uu0yB6CfCYgh58gTt24.jpg?auto=webp&s=4f4da03d0d7c4c022602acb5865277131420528d", "width": 899, "height": 470}, "resolutions": [{"url": "https://external-preview.redd.it/w0smdGFCyZTbqHUTVxl-p7T9uu0yB6CfCYgh58gTt24.jpg?width=108&crop=smart&auto=webp&s=a2fb91955c7a0b032be64bea065fbe7730783844", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/w0smdGFCyZTbqHUTVxl-p7T9uu0yB6CfCYgh58gTt24.jpg?width=216&crop=smart&auto=webp&s=93316baa9e60a918687df699d1c1776a22f36805", "width": 216, "height": 112}, {"url": "https://external-preview.redd.it/w0smdGFCyZTbqHUTVxl-p7T9uu0yB6CfCYgh58gTt24.jpg?width=320&crop=smart&auto=webp&s=3ffceb36c7bf56d8a8ffa50c6235e312ac7b0542", "width": 320, "height": 167}, {"url": "https://external-preview.redd.it/w0smdGFCyZTbqHUTVxl-p7T9uu0yB6CfCYgh58gTt24.jpg?width=640&crop=smart&auto=webp&s=07b15fd1d8b091ad3e135bbbd833ad79036403c2", "width": 640, "height": 334}], "variants": {}, "id": "ARJD4fxOEnQeh6b7H3QjwrLg6atT3G6LiI7QixyeuCM"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "k5xbdq", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 12, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/", "subreddit_subscribers": 1650806, "created_utc": 1607002599.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehg7vo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Ginkobe", "fullname": "t2_4u7dlzqt"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k5xbdq", "score": 8, "author_fullname": "t2_4u7dlzqt", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Keep up the great work mon. U could operate wsb news daily at this rate", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Keep up the great work mon. U could operate wsb news daily at this rate</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehg7vo/", "num_reports": null, "locked": false, "name": "t1_gehg7vo", "created": 1607031688.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607002888.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehgawb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gehg7vo", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Thanks a lot!", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Thanks a lot!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehgawb/", "num_reports": null, "locked": false, "name": "t1_gehgawb", "created": 1607031744.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607002944.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehi2s4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "LOTEZK", "fullname": "t2_38tpuezg"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k5xbdq", "score": 3, "author_fullname": "t2_38tpuezg", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "It’s cool that you enjoy doing this for us. We appreciate it greatly.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>It’s cool that you enjoy doing this for us. We appreciate it greatly.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehi2s4/", "num_reports": null, "locked": false, "name": "t1_gehi2s4", "created": 1607032866.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607004066.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehig16", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gehi2s4", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "No problem! I do this for myself and why not share it?", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No problem! I do this for myself and why not share it?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehig16/", "num_reports": null, "locked": false, "name": "t1_gehig16", "created": 1607033094.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607004294.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehx0gn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "LOTEZK", "fullname": "t2_38tpuezg"}, "can_mod_post": false, "created_utc": 1607012022.0, "send_replies": true, "parent_id": "t1_gehig16", "score": 2, "author_fullname": "t2_38tpuezg", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Good answer. You come first. Always.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Good answer. You come first. Always.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehx0gn/", "num_reports": null, "locked": false, "name": "t1_gehx0gn", "created": 1607040822.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehs1i7", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Mike82BE", "fullname": "t2_43lubtr5"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k5xbdq", "score": 3, "author_fullname": "t2_43lubtr5", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Im picking up OKTA here", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Im picking up OKTA here</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehs1i7/", "num_reports": null, "locked": false, "name": "t1_gehs1i7", "created": 1607038374.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607009574.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k5xbdq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gehsa2f", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gehs1i7", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "I’d wait for the next red day. Lower risk. People might cash in some gains later today", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I’d wait for the next red day. Lower risk. People might cash in some gains later today</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k5xbdq/crowdstrike_okta_snowflake_china_stocks_on_the/gehsa2f/", "num_reports": null, "locked": false, "name": "t1_gehsa2f", "created": 1607038493.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607009693.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}