{"approved_at_utc": null, "selftext": "So I'm on the steel train and these past couple of weeks have sucked, but a bunch of news came out today regarding the increases in steel and iron prices and how that's impacting the market. This news may give us a peek into the kind of shit we might see when the steel players we follow start reporting from next week into February. Sharing this here as a lot of the steel info exists on another subreddit now. So this is for any of the stragglers still here.  In recent days (not covered in this post) we saw [Tata Steel post awesome results](https://www.telegraphindia.com/business/tata-arm-show-hints-at-sunny-days-in-steel/cid/1803856) for one of their subsidiaries as well as Jindal Steel & Power report a 29% increase in revenue along with their [highest ever steel production volumes](https://www.msn.com/en-in/news/other/jindal-steel-and-power-q3-results-posts-profit-of-rs-2432-crore-revenue-up-39-25/ar-BB1cXpps).\n\nOne of the biggest highlights in the news today for me was that **the world's fifth-largest steelmaker**, Posco, is estimated to have logged **double digit operating profit growth for the fourth quarter**. This is with them needing to absorb the iron ore costs. Remember that ArcelorMittal (MT), the world's largest steel manufacturer, doesn't experience this issue at the same magnitude (they provide 50% of their own iron ore). Nothing is certain, but that tells me to expect better than expected results from MT earnings that will surprise Wall Street.\n\nThe iron ore input cost angle continues to bolster the case for integrated players MT, Vale, CLF. As noted, they can widen their margins and even offer competitive pricing if they'd like due to providing a lot of their own raw materials.\n\nSomething that I'm mildly concerned about and watching is the push for steel price regulation which is happening in [India](https://timesofindia.indiatimes.com/business/india-business/will-use-alternatives-nitin-gadkari-warns-steel-cartel-on-price-hike/articleshow/80428821.cms) and [Malaysia](https://www.dailyexpress.com.my/news/165251/after-mco-prices-of-materials-have-gone-sky-high-complain-builders/). In New Delhi the road transport and highways minister is threatening to use synthetic and composite fiber bars in place of steel for roads and bridges. The argument being that steel industry is inflating prices despite mining their own iron ore and therefor don't have higher input costs. Curious to see how far that goes.\n\nMy positions: MT (Calls June $25-$35, Sept $24-$32 \\[added this week\\], Commons), VALE (March $21)\n\n\\---\n\n**Posco, the world's fifth-largest steelmaker by output, is expected to have logged double-digit operating profit growth in the fourth quarter.** [Link](http://www.koreaherald.com/view.php?ud=20210124000086)\n\n>Posco is estimated to have posted an operating profit of 838.3 billion won ($760.1 million) in the fourth quarter, up 50.3 percent from a year earlier, according to a median forecast of market research firm FnGuide.  \n>  \n>The quarterly results reflect a quick recovery of steel demand amid short supplies in the United States and Europe and a hike in steel prices, analysts said.  \n>  \n>Posco's quarterly results also \"got a boost from increased demand for steel in China,\" Park Hyun-wook, an analyst at Hyundai Motor Investment & Securities Co., said in a research note.  \n>  \n>Looking ahead, Kim Hyun-wook, an analyst at Shinhan Investment Corp., said Posco could enjoy the effects of a price hike of its steel products, noting a spike in raw material costs could lead to an increase in Posco's steel prices.  \n>  \n>A spike in raw material costs can weigh on Posco, but the company can increase prices of its steel products amid strong demand, which could help improve the steelmakers' bottom line.\n\n**Tata Motors is passing on the cost of input costs to their customers placing orders past 1/21/21 calling out steel costs as a major reason. Demand for vehicles continue to rise.** [Link](https://www.drivespark.com/four-wheelers/2021/tata-cars-price-hike-announced-for-all-models-new-price-list-effective-date-details/articlecontent-pf134171-033441.html)\n\n>Steel, which is a major component in the process of automotive manufacturing, has increased substantially in pricing over the past few months in the country. This is because of the rising domestic demand and iron ore prices, higher international prices and subdued production and limited imports. As a result, it could be among the key factors for automakers announcing a price hike on its entire model range.  \n>  \n>Despite the current market conditions, Tata Motors has seen a significant increase in its demand for its passenger vehicle range. The sales of its cars grew by 39 per cent in the first three quarters of the current financial year as compared to the same period in the previous fiscal year.\n\n**JSW Steel’s net profit jumps** ***14 times*** **to Rs 2,669 crore backed by a strong recovery in steel demand for the three months of October-December** [Link](https://www.msn.com/en-in/money/news/jsw-steel-s-net-profit-jumps-14-times-to-rs-2669-crore/ar-BB1d0CDZ)\n\n>\"Various high frequency economic indicators are better than the initial expectations pointing to a robust recovery. Growth in passenger vehicles and motorcycle sales, railway freight traffic, and electricity consumption is also strong,\" the company said in a statement.  \n>  \n>The company r**ecorded highest ever quarterly sales** of flat products, propelled by strong demand of coated products. Automotive steel sales increased by 57% y-o-y, while India's domestic automotive production grew by 16% y-o-y. Consequently, exports were much lower during the quarter. Overall value added and special products sales were up 12% y-o-y, making up 57% of overall sales versus 51% in Q2FY21. This was mainly driven by robust automotive sales and increased off-take from industrial and engineering, solar and appliances segment.\n\n**Port of Duluth-Superior saw December and January tonnage topping the previous season** ***significantly***\\*\\* [Link](https://www.msn.com/en-us/sports/other/pounded-by-the-pandemic-duluth-shipping-seeks-rebound-in-2021/ar-BB1d0Kdh)\n\n>The season \"will be remembered for early promise crushed by coronavirus, but the late-season rally was encouraging,\" said Jayson Hron, spokesman for the Duluth Seaway Port Authority. \"**December and January tonnage topped the previous season — significantly**, in January's case — and **with mines reopening, steel demand rising** and COVID vaccinations beginning, it hints at hope for 2021.\"\n\n**Malaysian contractors are asking the government to step in and try to regulate material pricing. Steel prices were called out among others.** [Link](https://www.dailyexpress.com.my/news/165251/after-mco-prices-of-materials-have-gone-sky-high-complain-builders/)\n\n>Md Nasir Ibrahim, chairman of the Guild of Bumiputra Contractors Bhd, said that steel in particular had increased in price by nearly 40% in the last six weeks up to nearly RM3,000 a tonne.  \n>  \n>He urged the government to “interfere” by controlling the prices of these products and penalising suppliers who take part in unethical price manipulation.  \n>  \n>This was echoed by the Master Builders Association of Malaysia, who said price increases are particularly damaging to smaller stakeholders, who may not have predicted the cost of adhering to Covid-19 standard operating procedures, like testing workers and operating with a limited workforce.  \n>  \n>“The government should implement strict control over prices of construction materials to prevent cartels and monopolies taking advantage of these,” it said.  \n>  \n>It further suggested that it be made mandatory for a price variation clause to be included in all contracts to account for fluctuations in material costs.\n\n**US steel buyers continue to struggle to find materials. Some folks think the price is going to correct in May, some folks don’t. Lack of supply is opening door for imports.** [Link](https://www.metalbulletin.com/Article/3971961/Carbon-steel/US-hot-rolled-coil-index-edges-lower-tightness-continues.html)\n\n>Sources reported that there was still a shortage of spot material, with some distributors and consumers able to purchase only a fraction of the material they need. The surge in prices and lack of supply are opening the door for imports, some respondents said.  \n>  \n>Split between those projecting that the rally is coming to an end and others expecting prices to climb further. Respondents who think the rally has run its course pointed to weakness in the ferrous scrap market and a decline in Chinese flat-rolled prices. Sources who anticipate additional price increases were focused on tight supply, and did not see any indications that the situation will change during the first quarter.\n\n**China iron ore edges higher on supply concerns. Buyers trying to anticipate improved steel demand after Lunar New Year.** [Link](https://www.hellenicshippingnews.com/china-iron-ore-edges-higher-on-supply-concerns-sgx-prices-slip/)\n\n>Moves this week highlighted the lack of conviction in a market worried about weakening steel margins and the COVID-19 outbreak in China, while anticipating improved steel demand after the Lunar New Year holidays next month.", "author_fullname": "t2_8pcuh84g", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Positive Steel News - MT, CLF, VALE, etc.", "link_flair_richtext": [{"e": "text", "t": "News"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "news", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_l3sryc", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.88, "author_flair_background_color": null, "subreddit_type": "public", "ups": 90, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "News", "can_mod_post": false, "score": 90, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1611467922.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1611492691.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>So I&#39;m on the steel train and these past couple of weeks have sucked, but a bunch of news came out today regarding the increases in steel and iron prices and how that&#39;s impacting the market. This news may give us a peek into the kind of shit we might see when the steel players we follow start reporting from next week into February. Sharing this here as a lot of the steel info exists on another subreddit now. So this is for any of the stragglers still here.  In recent days (not covered in this post) we saw <a href=\"https://www.telegraphindia.com/business/tata-arm-show-hints-at-sunny-days-in-steel/cid/1803856\">Tata Steel post awesome results</a> for one of their subsidiaries as well as Jindal Steel &amp; Power report a 29% increase in revenue along with their <a href=\"https://www.msn.com/en-in/news/other/jindal-steel-and-power-q3-results-posts-profit-of-rs-2432-crore-revenue-up-39-25/ar-BB1cXpps\">highest ever steel production volumes</a>.</p>\n\n<p>One of the biggest highlights in the news today for me was that <strong>the world&#39;s fifth-largest steelmaker</strong>, Posco, is estimated to have logged <strong>double digit operating profit growth for the fourth quarter</strong>. This is with them needing to absorb the iron ore costs. Remember that ArcelorMittal (MT), the world&#39;s largest steel manufacturer, doesn&#39;t experience this issue at the same magnitude (they provide 50% of their own iron ore). Nothing is certain, but that tells me to expect better than expected results from MT earnings that will surprise Wall Street.</p>\n\n<p>The iron ore input cost angle continues to bolster the case for integrated players MT, Vale, CLF. As noted, they can widen their margins and even offer competitive pricing if they&#39;d like due to providing a lot of their own raw materials.</p>\n\n<p>Something that I&#39;m mildly concerned about and watching is the push for steel price regulation which is happening in <a href=\"https://timesofindia.indiatimes.com/business/india-business/will-use-alternatives-nitin-gadkari-warns-steel-cartel-on-price-hike/articleshow/80428821.cms\">India</a> and <a href=\"https://www.dailyexpress.com.my/news/165251/after-mco-prices-of-materials-have-gone-sky-high-complain-builders/\">Malaysia</a>. In New Delhi the road transport and highways minister is threatening to use synthetic and composite fiber bars in place of steel for roads and bridges. The argument being that steel industry is inflating prices despite mining their own iron ore and therefor don&#39;t have higher input costs. Curious to see how far that goes.</p>\n\n<p>My positions: MT (Calls June $25-$35, Sept $24-$32 [added this week], Commons), VALE (March $21)</p>\n\n<p>---</p>\n\n<p><strong>Posco, the world&#39;s fifth-largest steelmaker by output, is expected to have logged double-digit operating profit growth in the fourth quarter.</strong> <a href=\"http://www.koreaherald.com/view.php?ud=20210124000086\">Link</a></p>\n\n<blockquote>\n<p>Posco is estimated to have posted an operating profit of 838.3 billion won ($760.1 million) in the fourth quarter, up 50.3 percent from a year earlier, according to a median forecast of market research firm FnGuide.  </p>\n\n<p>The quarterly results reflect a quick recovery of steel demand amid short supplies in the United States and Europe and a hike in steel prices, analysts said.  </p>\n\n<p>Posco&#39;s quarterly results also &quot;got a boost from increased demand for steel in China,&quot; Park Hyun-wook, an analyst at Hyundai Motor Investment &amp; Securities Co., said in a research note.  </p>\n\n<p>Looking ahead, Kim Hyun-wook, an analyst at Shinhan Investment Corp., said Posco could enjoy the effects of a price hike of its steel products, noting a spike in raw material costs could lead to an increase in Posco&#39;s steel prices.  </p>\n\n<p>A spike in raw material costs can weigh on Posco, but the company can increase prices of its steel products amid strong demand, which could help improve the steelmakers&#39; bottom line.</p>\n</blockquote>\n\n<p><strong>Tata Motors is passing on the cost of input costs to their customers placing orders past 1/21/21 calling out steel costs as a major reason. Demand for vehicles continue to rise.</strong> <a href=\"https://www.drivespark.com/four-wheelers/2021/tata-cars-price-hike-announced-for-all-models-new-price-list-effective-date-details/articlecontent-pf134171-033441.html\">Link</a></p>\n\n<blockquote>\n<p>Steel, which is a major component in the process of automotive manufacturing, has increased substantially in pricing over the past few months in the country. This is because of the rising domestic demand and iron ore prices, higher international prices and subdued production and limited imports. As a result, it could be among the key factors for automakers announcing a price hike on its entire model range.  </p>\n\n<p>Despite the current market conditions, Tata Motors has seen a significant increase in its demand for its passenger vehicle range. The sales of its cars grew by 39 per cent in the first three quarters of the current financial year as compared to the same period in the previous fiscal year.</p>\n</blockquote>\n\n<p><strong>JSW Steel’s net profit jumps</strong> <strong><em>14 times</em></strong> <strong>to Rs 2,669 crore backed by a strong recovery in steel demand for the three months of October-December</strong> <a href=\"https://www.msn.com/en-in/money/news/jsw-steel-s-net-profit-jumps-14-times-to-rs-2669-crore/ar-BB1d0CDZ\">Link</a></p>\n\n<blockquote>\n<p>&quot;Various high frequency economic indicators are better than the initial expectations pointing to a robust recovery. Growth in passenger vehicles and motorcycle sales, railway freight traffic, and electricity consumption is also strong,&quot; the company said in a statement.  </p>\n\n<p>The company r<strong>ecorded highest ever quarterly sales</strong> of flat products, propelled by strong demand of coated products. Automotive steel sales increased by 57% y-o-y, while India&#39;s domestic automotive production grew by 16% y-o-y. Consequently, exports were much lower during the quarter. Overall value added and special products sales were up 12% y-o-y, making up 57% of overall sales versus 51% in Q2FY21. This was mainly driven by robust automotive sales and increased off-take from industrial and engineering, solar and appliances segment.</p>\n</blockquote>\n\n<p><strong>Port of Duluth-Superior saw December and January tonnage topping the previous season</strong> <strong><em>significantly</em></strong>** <a href=\"https://www.msn.com/en-us/sports/other/pounded-by-the-pandemic-duluth-shipping-seeks-rebound-in-2021/ar-BB1d0Kdh\">Link</a></p>\n\n<blockquote>\n<p>The season &quot;will be remembered for early promise crushed by coronavirus, but the late-season rally was encouraging,&quot; said Jayson Hron, spokesman for the Duluth Seaway Port Authority. &quot;<strong>December and January tonnage topped the previous season — significantly</strong>, in January&#39;s case — and <strong>with mines reopening, steel demand rising</strong> and COVID vaccinations beginning, it hints at hope for 2021.&quot;</p>\n</blockquote>\n\n<p><strong>Malaysian contractors are asking the government to step in and try to regulate material pricing. Steel prices were called out among others.</strong> <a href=\"https://www.dailyexpress.com.my/news/165251/after-mco-prices-of-materials-have-gone-sky-high-complain-builders/\">Link</a></p>\n\n<blockquote>\n<p>Md Nasir Ibrahim, chairman of the Guild of Bumiputra Contractors Bhd, said that steel in particular had increased in price by nearly 40% in the last six weeks up to nearly RM3,000 a tonne.  </p>\n\n<p>He urged the government to “interfere” by controlling the prices of these products and penalising suppliers who take part in unethical price manipulation.  </p>\n\n<p>This was echoed by the Master Builders Association of Malaysia, who said price increases are particularly damaging to smaller stakeholders, who may not have predicted the cost of adhering to Covid-19 standard operating procedures, like testing workers and operating with a limited workforce.  </p>\n\n<p>“The government should implement strict control over prices of construction materials to prevent cartels and monopolies taking advantage of these,” it said.  </p>\n\n<p>It further suggested that it be made mandatory for a price variation clause to be included in all contracts to account for fluctuations in material costs.</p>\n</blockquote>\n\n<p><strong>US steel buyers continue to struggle to find materials. Some folks think the price is going to correct in May, some folks don’t. Lack of supply is opening door for imports.</strong> <a href=\"https://www.metalbulletin.com/Article/3971961/Carbon-steel/US-hot-rolled-coil-index-edges-lower-tightness-continues.html\">Link</a></p>\n\n<blockquote>\n<p>Sources reported that there was still a shortage of spot material, with some distributors and consumers able to purchase only a fraction of the material they need. The surge in prices and lack of supply are opening the door for imports, some respondents said.  </p>\n\n<p>Split between those projecting that the rally is coming to an end and others expecting prices to climb further. Respondents who think the rally has run its course pointed to weakness in the ferrous scrap market and a decline in Chinese flat-rolled prices. Sources who anticipate additional price increases were focused on tight supply, and did not see any indications that the situation will change during the first quarter.</p>\n</blockquote>\n\n<p><strong>China iron ore edges higher on supply concerns. Buyers trying to anticipate improved steel demand after Lunar New Year.</strong> <a href=\"https://www.hellenicshippingnews.com/china-iron-ore-edges-higher-on-supply-concerns-sgx-prices-slip/\">Link</a></p>\n\n<blockquote>\n<p>Moves this week highlighted the lack of conviction in a market worried about weakening steel margins and the COVID-19 outbreak in China, while anticipating improved steel demand after the Lunar New Year holidays next month.</p>\n</blockquote>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/9w1dvqQLT9pq8PN8dFqlQgXVnWauIoRN6KX7HifMYkw.jpg?auto=webp&s=1f287e1ffdea0fd16cc4e64b3bb2e304725bb669", "width": 900, "height": 500}, "resolutions": [{"url": "https://external-preview.redd.it/9w1dvqQLT9pq8PN8dFqlQgXVnWauIoRN6KX7HifMYkw.jpg?width=108&crop=smart&auto=webp&s=910dba342f970a4d53e43bc73a985f340a6f8bc2", "width": 108, "height": 60}, {"url": "https://external-preview.redd.it/9w1dvqQLT9pq8PN8dFqlQgXVnWauIoRN6KX7HifMYkw.jpg?width=216&crop=smart&auto=webp&s=e6e313e856fe04c7f604f0811bc8d83b639d1709", "width": 216, "height": 120}, {"url": "https://external-preview.redd.it/9w1dvqQLT9pq8PN8dFqlQgXVnWauIoRN6KX7HifMYkw.jpg?width=320&crop=smart&auto=webp&s=056c864caac1381fb57ffc9eeb409ea244de915d", "width": 320, "height": 177}, {"url": "https://external-preview.redd.it/9w1dvqQLT9pq8PN8dFqlQgXVnWauIoRN6KX7HifMYkw.jpg?width=640&crop=smart&auto=webp&s=751e3a8d90f281e5dd3cf8460d7251ed8a8a3902", "width": 640, "height": 355}], "variants": {}, "id": "VQfllsVodRL4p1KURh7bNyM6xyAnVQJd-pP5r9ddjEE"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "519c3d26-4acc-11eb-8ce2-0ec530aa616d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#ffb000", "id": "l3sryc", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "apt-getupdate", "fullname": "t2_8pcuh84g"}, "discussion_type": null, "num_comments": 80, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/", "subreddit_subscribers": 2051520, "created_utc": 1611463891.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 17, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkih4ab", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AaronTheDakotan", "fullname": "t2_14r343"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l3sryc", "score": 17, "author_fullname": "t2_14r343", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Steel Gang brought me into 2021, but I couldn't handle losing more money. I've moved to GME for the short squeeze of a lifetime, but I'm keen on getting back into steel once the 🌈🍋 and Morgan are fucked.\n\nEverything is there for this play to work in steel, but the market is being a genuine bitch towards them these last few weeks. Best of luck steel bro's and fellow Vitards! 🚀🚀🚀", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Steel Gang brought me into 2021, but I couldn&#39;t handle losing more money. I&#39;ve moved to GME for the short squeeze of a lifetime, but I&#39;m keen on getting back into steel once the 🌈🍋 and Morgan are fucked.</p>\n\n<p>Everything is there for this play to work in steel, but the market is being a genuine bitch towards them these last few weeks. Best of luck steel bro&#39;s and fellow Vitards! 🚀🚀🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkih4ab/", "num_reports": null, "locked": false, "name": "t1_gkih4ab", "created": 1611504334.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611475534.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkil53u", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "chugajuicejuice", "fullname": "t2_2qak6pz1"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gkih4ab", "score": 7, "author_fullname": "t2_2qak6pz1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Perfect time to buy cheap calls", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Perfect time to buy cheap calls</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkil53u/", "num_reports": null, "locked": false, "name": "t1_gkil53u", "created": 1611505837.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611477037.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 15, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gki1qpb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "lescoobs", "fullname": "t2_76jzbv0v"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l3sryc", "score": 15, "author_fullname": "t2_76jzbv0v", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Will my MT April $25 calls print", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Will my MT April $25 calls print</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gki1qpb/", "num_reports": null, "locked": false, "name": "t1_gki1qpb", "created": 1611497398.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611468598.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gki4nmj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "YeezyTooBreezy", "fullname": "t2_8up15dkb"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gki1qpb", "score": 6, "author_fullname": "t2_8up15dkb", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Definitely", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Definitely</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gki4nmj/", "num_reports": null, "locked": false, "name": "t1_gki4nmj", "created": 1611498931.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611470131.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkigql5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Fl333r", "fullname": "t2_11skx6"}, "can_mod_post": false, "created_utc": 1611475379.0, "send_replies": true, "parent_id": "t1_gki4nmj", "score": 4, "author_fullname": "t2_11skx6", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Will my march 35 calls print", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Will my march 35 calls print</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkigql5/", "num_reports": null, "locked": false, "name": "t1_gkigql5", "created": 1611504179.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 24, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkikmlz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "seth_is_not_ruski", "fullname": "t2_ut821"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gkigql5", "score": 24, "author_fullname": "t2_ut821", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "theres only 31 days retard", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>theres only 31 days retard</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkikmlz/", "num_reports": null, "locked": false, "name": "t1_gkikmlz", "created": 1611505648.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611476848.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 12, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkilmii", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Fl333r", "fullname": "t2_11skx6"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gkikmlz", "score": 12, "author_fullname": "t2_11skx6", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "o no", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>o no</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkilmii/", "num_reports": null, "locked": false, "name": "t1_gkilmii", "created": 1611506029.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611477229.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 4, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 19, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l3sryc", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gkhv757", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "RanchDubois840", "fullname": "t2_1uzbjc2e"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l3sryc", "score": 19, "author_fullname": "t2_1uzbjc2e", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I sold off a lot of my calls a few weeks ago when things started to downturn, was planning on buying back in before earnings for MT. Definitely going to keep an eye on it.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I sold off a lot of my calls a few weeks ago when things started to downturn, was planning on buying back in before earnings for MT. Definitely going to keep an eye on it.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l3sryc/positive_steel_news_mt_clf_vale_etc/gkhv757/", "num_reports": null, "locked": false, "name": "t1_gkhv757", "created": 1611493129.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611464329.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}