{"approved_at_utc": null, "selftext": "**Industry Overview**\n\nDocebo competes in the learning management system (LMS) market. Sounds complicated but to make it simpler, a learning management system is a software application covering the administration, documentation, tracking, reporting, automation, and delivery of educational courses, training programs, or learning and development programs. Basically, if companies have employees, partners, or customers go through training courses of some kind, they go through the LMS software.\n\nThe corporate learning management system (LMS) market is a subset of the global e-learning market. According to various sources and Docebo’s management team, the global e-learning market is expected to reach $29.9bn by 2025. If true, this will be rapid growth from where the market is today. Management believes that enterprises see a correlation to ongoing learning opportunities to improved productivity, higher retention rates, and overall employee engagement and work satisfaction. Learning while on the job will always be important.\n\nManagement is comparing the LMS market to the early stages of the CRM market because just as the CRM market changed from non-essential to essential, the LMS market will make this transition. Initially, the LMS market was designed to host, deliver, track, and manage learning content. It's changing to new learning functionalities like social learning, learning on the job, and communities of practice/workgroups designed to drive organizational change. One of the potential tailwinds of the learning management system market is how remote work and the COVID-19 pandemic will impact this industry. As more employees work from home, a platform like this to help teach new employees may be critical to the success of a company or division.\n\nDocebo competes in the learning management system market. There are many other competitors that offer a similar product but may focus on different customers or strategies. For example, Docebo competes with [Instructure’s Canvas LMS](https://www.instructure.com/canvas/), [Blackboard’s LMS](https://www.blackboard.com/teaching-learning/learning-management), and a handful of other companies in the LMS market. Some of these competitors focus on different markets such as education.\n\n**Business Overview**\n\nDocebo’s goal is to \"redefine the way enterprises learn by applying new technologies to the traditional corporate learning management system market.” In simple words, Docebo provides a learning platform for customers to train employees, partners, and customers. Docebo allows companies to upload their own courses and material specific to their employees, partners, or customers. This platform also allows companies to segment the population by division, title, or other factors to allow access to specific groups within the company. Docebo also operates a content marketplace where companies can buy courses covering broad subjects like digital marketing, leadership, or sales. Although this marketplace is not a major part of their business, it is an interesting aspect that might become larger as time goes on.\n\nWithin Docebo’s platform, there are a number of tools and modules to help companies utilize courses and training to improve. Don’t let these modules distract you from the main part of the business which is just providing companies with a platform to host courses and other material. The modules are listed below:\n\n* Docebo Learn\n* Docebo Discover, Coach & Share\n* Docebo Extended Enterprise\n* Docebo Virtual Coach\n* Docebo Mobile Pages\n* Docebo Discover\n* Docebo Learning Impact\n\nDocebo focuses on mid-market and enterprise customers. Docebo has a list of solid customers: Thomson Reuters, Pearson, HP, Amazon Web Services, Newcross Healthcare Solutions, Experian, Randstad NV, lastminute.com, L’Oréal, Heineken NV, BRF, BMW AG, and Denny’s. Having Amazon Web Services as a client is a sign that Docebo is doing good things.\n\n**Total Addressable Market**\n\nManagement and other sources believe that this market will be worth \\~$29.9bn by 2025. In 2019, the learning management system market was estimated to be \\~$9.5bn. If the market will be worth \\~$29.9bn by 2025 this will be a market that is growing at a CAGR of \\~21%.\n\nMany sources also believe there are additional market expansion opportunities such as analytics, automation, and content creation. This is an attractive feature that gives Docebo room for future upside. From my understanding, customers have to build and upload a course to their learning management system. In the future, learning management systems may help educators create course content and help edit content due to the feedback from the course’s analytics.\n\n**Competitive Advantages**\n\nFrom this shallow dive, it looks like Docebo may have a number of possible competitive advantages, yet I’m not sure how strong these are and how difficult it would be for competitors to replicate this.\n\n1. **Switching Costs**  \nDocebo sells to mid-market and enterprise customers. Typically these contracts are for multi-year periods and require negotiating and integration. These customers will become accustomed to their learning management system software. They will be familiar with the layout and where everything is located. Manual processes such as uploading courses and inputting employee information will be tedious to change if companies decide to switch platforms. Switching platforms, moving courses, and inputting employee, customer, and partner information will all be tedious work and the opportunity costs may outweigh any potential savings. Docebo’s customers that decide to switch may lose important data associated with course content. Switching to a more affordable or downright better competitor might be more attractive but the headache of these switching costs may deter many customers from switching.\n2. **Economies of Scale**  \nLike many leading companies, Docebo has the potential to be one of the leading companies in this growing industry. If so, it will know what additional offerings to provide for customers. Smaller companies may be priced out of this industry due to the cost of building up the LMS software needed to compete with more established companies like Docebo. Small startups can’t offer the same number of features or the reliability of Docebo. This competitive advantage can be seen by looking at other enterprise SaaS companies like Salesforce, Workday, ServiceNow, and others. Small companies that try to compete broadly with established enterprise SaaS companies often stand no chance. Larger companies can roll out new product features and crush smaller competitors or simply buy up future competitors.\n\n**Financials**\n\nDocebo has seen tremendous growth over the past few years. Revenue has grown due to an increasing customer base and increasing average contract value. Gross margins have also improved due to operating leverage. Docebo is currently in the phase where it’s investing through its income statement and likely will not show a profit for a number of years.\n\n**Through September 2020:**\n\n* Total revenue = \\~$44mn\n* Gross margin = \\~82%\n* Average contract value = \\~$31,900\n\n**2019:**\n\n* Total revenue = \\~$41mn\n* Gross margin = \\~80%\n* Average contract value = \\~$27,400\n\n**2018:**\n\n* Total revenue = \\~$27mn\n* Gross margin = \\~79%\n* Average contract value = \\~$21,000\n\n**2017:**\n\n* Total revenue = \\~$17mn\n* Gross margin = \\~75%\n* Average contract value = \\~$15,500\n\n**2016:**\n\n* Total revenue = \\~$10mn\n* Gross margin = \\~73%\n* Average contract value = \\~$11,500\n\nThese numbers all demonstrate impressive growth and are just the tip of the iceberg for Docebo’s financial profile. Like many other tech companies, Docebo is looking to broaden its market share and focused on capturing long term value instead of short term profits.\n\n**What’s Interesting**\n\nWhat initially attracted me to Docebo was that it was a recent IPO with little to no coverage or big headlines like Airbnb, Uber, DoorDash, and other well-funded VC companies. This company has experienced tremendous growth with revenue growing from $10mn to $41mn in revenue in just three years.\n\nDocebo is a small-cap company that is likely out of reach of larger institutional investors like mutual funds and hedge funds. The CEO is also the founder and likely has skin in the game and wants to make Docebo a success because it’s his prized possession.\n\nAfter doing more research, Docebo looks to be an attractive company but I would need to do more research to initiate a position. Selling to large companies is attractive for a number of reasons listed above in the competitive advantage section, but at the same time so is selling to smaller ones. The fact that Docebo has a company like Amazon Web Services as a client is also attractive and further piqued my interest.\n\nDocebo also stands to benefit from remote learning. As companies make the transition to remote offices, more courses and training will be done virtually and these companies will rely on an LMS platform like Docebo. Prior to this research, I had never heard of the learning management system industry but I believe it may be a crucial component of many companies in the future just like CRM was 15 years ago.\n\nDocebo also has the potential to be a ten-bagger. It has a small market cap with attractive growth and has a realistic shot of being a ten-bagger based solely on its current size and growth. More work is needed to flesh out a valid claim to be a ten-bagger, but this is just a shallow dive on interesting companies.\n\n**Future Questions**\n\n* **How big is the corporate learning market?**  \nAn investment in Docebo comes down to your confidence in the size of the corporate learning market and the learning management system market. The corporate market for LMS software is small when compared to more established markets like customer relationship management (Salesforce), human capital management (Workday), and many others. If the corporate learning market grows to be as big as management says, then this will be an attractive industry. The attractiveness of this investment only grows if Docebo solidifies its position as the leading company in this industry.\n* **How crucial is learning management system software inside companies?**  \nLearning management system software sounds like fluff but it might be a crucial function for many companies. Employees often need to go through compliance training, onboarding, and other required courses to make sure that they are being held to industry regulation or other company-specific rules. This training runs through an LMS platform like Docebo. All employees need to be onboarded and often also go through annual courses. Other crucial content could be how to operate different company-specific software like a Salesforce training course or other tools.\n\n**Conclusion**\n\nDocebo is a good company from this initial review. I’m not sure if I’d initiate a position based solely on this qualitative information, but I’ll be doing more research into the size of the corporate learning market and the differences between Docebo and it’s competitors.\n\nIf Docebo can be placed into the same “Enterprise SaaS” bucket due to LMS software being a necessity in many companies and if Docebo is the leading company in this growing industry, then it stands a chance to benefit greatly.\n\nInvestor Presentation: [Link](https://s24.q4cdn.com/246292444/files/doc_presentation/2020/12/1201120-DCBO-Investor-Presentation-Website.pdf)\n\n**Fun Fact**\n\nDocebo = “I will teach” in Latin.", "author_fullname": "t2_8arezuad", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Docebo Analysis (TSE: DCBO)", "link_flair_richtext": [{"e": "text", "t": "Fundamentals"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "fundamentals", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kltqcr", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.75, "author_flair_background_color": null, "subreddit_type": "public", "ups": 8, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Fundamentals", "can_mod_post": false, "score": 8, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609202203.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Industry Overview</strong></p>\n\n<p>Docebo competes in the learning management system (LMS) market. Sounds complicated but to make it simpler, a learning management system is a software application covering the administration, documentation, tracking, reporting, automation, and delivery of educational courses, training programs, or learning and development programs. Basically, if companies have employees, partners, or customers go through training courses of some kind, they go through the LMS software.</p>\n\n<p>The corporate learning management system (LMS) market is a subset of the global e-learning market. According to various sources and Docebo’s management team, the global e-learning market is expected to reach $29.9bn by 2025. If true, this will be rapid growth from where the market is today. Management believes that enterprises see a correlation to ongoing learning opportunities to improved productivity, higher retention rates, and overall employee engagement and work satisfaction. Learning while on the job will always be important.</p>\n\n<p>Management is comparing the LMS market to the early stages of the CRM market because just as the CRM market changed from non-essential to essential, the LMS market will make this transition. Initially, the LMS market was designed to host, deliver, track, and manage learning content. It&#39;s changing to new learning functionalities like social learning, learning on the job, and communities of practice/workgroups designed to drive organizational change. One of the potential tailwinds of the learning management system market is how remote work and the COVID-19 pandemic will impact this industry. As more employees work from home, a platform like this to help teach new employees may be critical to the success of a company or division.</p>\n\n<p>Docebo competes in the learning management system market. There are many other competitors that offer a similar product but may focus on different customers or strategies. For example, Docebo competes with <a href=\"https://www.instructure.com/canvas/\">Instructure’s Canvas LMS</a>, <a href=\"https://www.blackboard.com/teaching-learning/learning-management\">Blackboard’s LMS</a>, and a handful of other companies in the LMS market. Some of these competitors focus on different markets such as education.</p>\n\n<p><strong>Business Overview</strong></p>\n\n<p>Docebo’s goal is to &quot;redefine the way enterprises learn by applying new technologies to the traditional corporate learning management system market.” In simple words, Docebo provides a learning platform for customers to train employees, partners, and customers. Docebo allows companies to upload their own courses and material specific to their employees, partners, or customers. This platform also allows companies to segment the population by division, title, or other factors to allow access to specific groups within the company. Docebo also operates a content marketplace where companies can buy courses covering broad subjects like digital marketing, leadership, or sales. Although this marketplace is not a major part of their business, it is an interesting aspect that might become larger as time goes on.</p>\n\n<p>Within Docebo’s platform, there are a number of tools and modules to help companies utilize courses and training to improve. Don’t let these modules distract you from the main part of the business which is just providing companies with a platform to host courses and other material. The modules are listed below:</p>\n\n<ul>\n<li>Docebo Learn</li>\n<li>Docebo Discover, Coach &amp; Share</li>\n<li>Docebo Extended Enterprise</li>\n<li>Docebo Virtual Coach</li>\n<li>Docebo Mobile Pages</li>\n<li>Docebo Discover</li>\n<li>Docebo Learning Impact</li>\n</ul>\n\n<p>Docebo focuses on mid-market and enterprise customers. Docebo has a list of solid customers: Thomson Reuters, Pearson, HP, Amazon Web Services, Newcross Healthcare Solutions, Experian, Randstad NV, lastminute.com, L’Oréal, Heineken NV, BRF, BMW AG, and Denny’s. Having Amazon Web Services as a client is a sign that Docebo is doing good things.</p>\n\n<p><strong>Total Addressable Market</strong></p>\n\n<p>Management and other sources believe that this market will be worth ~$29.9bn by 2025. In 2019, the learning management system market was estimated to be ~$9.5bn. If the market will be worth ~$29.9bn by 2025 this will be a market that is growing at a CAGR of ~21%.</p>\n\n<p>Many sources also believe there are additional market expansion opportunities such as analytics, automation, and content creation. This is an attractive feature that gives Docebo room for future upside. From my understanding, customers have to build and upload a course to their learning management system. In the future, learning management systems may help educators create course content and help edit content due to the feedback from the course’s analytics.</p>\n\n<p><strong>Competitive Advantages</strong></p>\n\n<p>From this shallow dive, it looks like Docebo may have a number of possible competitive advantages, yet I’m not sure how strong these are and how difficult it would be for competitors to replicate this.</p>\n\n<ol>\n<li><strong>Switching Costs</strong><br/>\nDocebo sells to mid-market and enterprise customers. Typically these contracts are for multi-year periods and require negotiating and integration. These customers will become accustomed to their learning management system software. They will be familiar with the layout and where everything is located. Manual processes such as uploading courses and inputting employee information will be tedious to change if companies decide to switch platforms. Switching platforms, moving courses, and inputting employee, customer, and partner information will all be tedious work and the opportunity costs may outweigh any potential savings. Docebo’s customers that decide to switch may lose important data associated with course content. Switching to a more affordable or downright better competitor might be more attractive but the headache of these switching costs may deter many customers from switching.</li>\n<li><strong>Economies of Scale</strong><br/>\nLike many leading companies, Docebo has the potential to be one of the leading companies in this growing industry. If so, it will know what additional offerings to provide for customers. Smaller companies may be priced out of this industry due to the cost of building up the LMS software needed to compete with more established companies like Docebo. Small startups can’t offer the same number of features or the reliability of Docebo. This competitive advantage can be seen by looking at other enterprise SaaS companies like Salesforce, Workday, ServiceNow, and others. Small companies that try to compete broadly with established enterprise SaaS companies often stand no chance. Larger companies can roll out new product features and crush smaller competitors or simply buy up future competitors.</li>\n</ol>\n\n<p><strong>Financials</strong></p>\n\n<p>Docebo has seen tremendous growth over the past few years. Revenue has grown due to an increasing customer base and increasing average contract value. Gross margins have also improved due to operating leverage. Docebo is currently in the phase where it’s investing through its income statement and likely will not show a profit for a number of years.</p>\n\n<p><strong>Through September 2020:</strong></p>\n\n<ul>\n<li>Total revenue = ~$44mn</li>\n<li>Gross margin = ~82%</li>\n<li>Average contract value = ~$31,900</li>\n</ul>\n\n<p><strong>2019:</strong></p>\n\n<ul>\n<li>Total revenue = ~$41mn</li>\n<li>Gross margin = ~80%</li>\n<li>Average contract value = ~$27,400</li>\n</ul>\n\n<p><strong>2018:</strong></p>\n\n<ul>\n<li>Total revenue = ~$27mn</li>\n<li>Gross margin = ~79%</li>\n<li>Average contract value = ~$21,000</li>\n</ul>\n\n<p><strong>2017:</strong></p>\n\n<ul>\n<li>Total revenue = ~$17mn</li>\n<li>Gross margin = ~75%</li>\n<li>Average contract value = ~$15,500</li>\n</ul>\n\n<p><strong>2016:</strong></p>\n\n<ul>\n<li>Total revenue = ~$10mn</li>\n<li>Gross margin = ~73%</li>\n<li>Average contract value = ~$11,500</li>\n</ul>\n\n<p>These numbers all demonstrate impressive growth and are just the tip of the iceberg for Docebo’s financial profile. Like many other tech companies, Docebo is looking to broaden its market share and focused on capturing long term value instead of short term profits.</p>\n\n<p><strong>What’s Interesting</strong></p>\n\n<p>What initially attracted me to Docebo was that it was a recent IPO with little to no coverage or big headlines like Airbnb, Uber, DoorDash, and other well-funded VC companies. This company has experienced tremendous growth with revenue growing from $10mn to $41mn in revenue in just three years.</p>\n\n<p>Docebo is a small-cap company that is likely out of reach of larger institutional investors like mutual funds and hedge funds. The CEO is also the founder and likely has skin in the game and wants to make Docebo a success because it’s his prized possession.</p>\n\n<p>After doing more research, Docebo looks to be an attractive company but I would need to do more research to initiate a position. Selling to large companies is attractive for a number of reasons listed above in the competitive advantage section, but at the same time so is selling to smaller ones. The fact that Docebo has a company like Amazon Web Services as a client is also attractive and further piqued my interest.</p>\n\n<p>Docebo also stands to benefit from remote learning. As companies make the transition to remote offices, more courses and training will be done virtually and these companies will rely on an LMS platform like Docebo. Prior to this research, I had never heard of the learning management system industry but I believe it may be a crucial component of many companies in the future just like CRM was 15 years ago.</p>\n\n<p>Docebo also has the potential to be a ten-bagger. It has a small market cap with attractive growth and has a realistic shot of being a ten-bagger based solely on its current size and growth. More work is needed to flesh out a valid claim to be a ten-bagger, but this is just a shallow dive on interesting companies.</p>\n\n<p><strong>Future Questions</strong></p>\n\n<ul>\n<li><strong>How big is the corporate learning market?</strong><br/>\nAn investment in Docebo comes down to your confidence in the size of the corporate learning market and the learning management system market. The corporate market for LMS software is small when compared to more established markets like customer relationship management (Salesforce), human capital management (Workday), and many others. If the corporate learning market grows to be as big as management says, then this will be an attractive industry. The attractiveness of this investment only grows if Docebo solidifies its position as the leading company in this industry.</li>\n<li><strong>How crucial is learning management system software inside companies?</strong><br/>\nLearning management system software sounds like fluff but it might be a crucial function for many companies. Employees often need to go through compliance training, onboarding, and other required courses to make sure that they are being held to industry regulation or other company-specific rules. This training runs through an LMS platform like Docebo. All employees need to be onboarded and often also go through annual courses. Other crucial content could be how to operate different company-specific software like a Salesforce training course or other tools.</li>\n</ul>\n\n<p><strong>Conclusion</strong></p>\n\n<p>Docebo is a good company from this initial review. I’m not sure if I’d initiate a position based solely on this qualitative information, but I’ll be doing more research into the size of the corporate learning market and the differences between Docebo and it’s competitors.</p>\n\n<p>If Docebo can be placed into the same “Enterprise SaaS” bucket due to LMS software being a necessity in many companies and if Docebo is the leading company in this growing industry, then it stands a chance to benefit greatly.</p>\n\n<p>Investor Presentation: <a href=\"https://s24.q4cdn.com/246292444/files/doc_presentation/2020/12/1201120-DCBO-Investor-Presentation-Website.pdf\">Link</a></p>\n\n<p><strong>Fun Fact</strong></p>\n\n<p>Docebo = “I will teach” in Latin.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?auto=webp&s=94c4e92c0c3415752e28b59b2f3579ee956d7a52", "width": 1920, "height": 1080}, "resolutions": [{"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=108&crop=smart&auto=webp&s=985e8a5380f7767243712238fcc74efea6c3ccf5", "width": 108, "height": 60}, {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=216&crop=smart&auto=webp&s=ad3affc7a075b42c072d18c1b527d52c9bfc9526", "width": 216, "height": 121}, {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=320&crop=smart&auto=webp&s=9fa4b39af2ff3348112bf77f1a72a8029b66c8c0", "width": 320, "height": 180}, {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=640&crop=smart&auto=webp&s=6f4567fae69a79badf065a027cebcd8b668371c9", "width": 640, "height": 360}, {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=960&crop=smart&auto=webp&s=2cd657359856a43886562ccc999486a19ce3fb30", "width": 960, "height": 540}, {"url": "https://external-preview.redd.it/_QjaIZFNhhr_1GXLRPKpD9uncy5dSflTVZ8_lniIB1E.jpg?width=1080&crop=smart&auto=webp&s=7d5e8140191c27cb08728777f45f3cfe19da15d6", "width": 1080, "height": 607}], "variants": {}, "id": "lUaHg0HdR4yjYyYARcvEkxfVhZEHwTL2wXrQToXIpic"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "54d23d26-ad54-11e5-9728-0ed6ac91013f", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#854406", "id": "kltqcr", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "Career_Regular", "fullname": "t2_8arezuad"}, "discussion_type": null, "num_comments": 9, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kltqcr/docebo_analysis_tse_dcbo/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kltqcr/docebo_analysis_tse_dcbo/", "subreddit_subscribers": 1749511, "created_utc": 1609173403.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kltqcr", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghb2aga", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Only-Tells-The-Truth", "fullname": "t2_17flbxbd"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kltqcr", "score": 4, "author_fullname": "t2_17flbxbd", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "> $44m revenue\n\n> $2.4b Market cap", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><blockquote>\n<p>$44m revenue</p>\n\n<p>$2.4b Market cap</p>\n</blockquote>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kltqcr/docebo_analysis_tse_dcbo/ghb2aga/", "num_reports": null, "locked": false, "name": "t1_ghb2aga", "created": 1609206757.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609177957.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kltqcr", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghawoo8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Leebertsk", "fullname": "t2_5xlnqt3s"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kltqcr", "score": 2, "author_fullname": "t2_5xlnqt3s", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Solid DD", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Solid DD</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kltqcr/docebo_analysis_tse_dcbo/ghawoo8/", "num_reports": null, "locked": false, "name": "t1_ghawoo8", "created": 1609203913.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609175113.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kltqcr", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "ghateiv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_kltqcr", "score": 1, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kltqcr/docebo_analysis_tse_dcbo/ghateiv/", "num_reports": null, "locked": false, "name": "t1_ghateiv", "created": 1609202204.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1609173404.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}]}