{"approved_at_utc": null, "selftext": "[How I went from $35K to $1.75M \\(50X\\) in less than a year](https://preview.redd.it/fsabjzo13c761.jpg?width=1242&format=pjpg&auto=webp&s=3562fc1720f4a9dc5dffd7e215595078dd01d6b5)\n\n# [Introduction](https://pbs.twimg.com/media/EMpQn-QWoAI309S.jpg)\n\nGather 'round retards and autists. Grab a mug of [eggnog](https://pics.me.me/mmmmm-eggnog-when-you-drink-it-try-not-to-think-about-49090075.png), find a cozy corner in your mom's basement, and enjoy the tale of SIR JACK A LOT.\n\nIn this post: I'll go over my trading history, my strategy, my philosophy, and also systematically destroy every accusation and idiotic question made against me in the last week WITH RECEIPTS. No one doubts motherfuckin SIR JACK A LOT.\n\n**Disclaimers**\n\nPrivacy is important to me. I wish to stay anonymous. This is not financial advice, just my story.\n\n# Ghosts of Christmas Past\n\n**Chapter 1: Crypto (2017-18)**\n\nHow it all started... I threw every last dollar I had in ETH at $12 and swing traded a ton of shit coins and ICOs until it all came crashing down.\n\nIn short: turned $8K into $300K and back to $30k but owed the IRS \\~$120K since all the gains were calculated at 2017-year-end. I royally fucked myself because I didn't set any money aside for taxes. Ended up in debt to some very bad people and things were very dark, I don't like to talk about this time in my life that much.\n\n**Chapter 2: WSB Tuition (2018)**\n\nFirst learned about WSB in 2018 from the infamous FB [ER put play](https://www.reddit.com/r/wallstreetbets/comments/922gtp/facebooks_put_play_from_yesterday_im_20_time_to/) by /u/YungBillionaire turning \\~$28K into $451K overnight. That sounded fun.\n\nQuickly learned about options but most importantly about FDs, tendies, and the power of memes.\n\nBack then it was all about trade wars and hanging at the whim of commander cheeto's supple tweets.\n\nI have fond memories of:\n\n* Apparently the first stock I ever bought on Robinhood was [HMNY](https://imgur.com/a/2AsrVQB)... thanks Robinhood Recap for the reminder of my retarded-ness\n* Grew my first set of winkles on my smooth brain with AMC calls. The thesis was that their Stubs A-List subscription was doing pretty well according to /r/AMCsAList back then\n* Went all-in MTCH weekly puts with $12K clenching my stomach in the fetal position when all of a sudden there was a [lawsuit](https://www.bizjournals.com/dallas/news/2018/08/14/match-group-faces-2b-lawsuit-from-tinder-co.html) and I tripled my account in minutes, pure luck\n\nStill ended up losing $30K and swore off options forever... until 2020 where I lost another $10k in options. Fucking weeklies man, they're like if cocaine and blackjack made a dopamine-infused baby\n\n[WTF is up with the snowflakes Robinhood? So gay, instant short when it IPOs](https://preview.redd.it/cm95k7f43c761.jpg?width=1242&format=pjpg&auto=webp&s=806ab5dc60f841ab326aec4ae3f5f39ee8312847)\n\n# Ghosts of Christmas Present\n\n**Chapter 3: Road to $1M+ (2020)**\n\nLet's start with the receipts since that's what everyone's interested in:\n\n[Proof that I started Feb 2020 with only $35K](https://preview.redd.it/lka2ez963c761.png?width=906&format=png&auto=webp&s=f0fd2facab8f700e2f65c813a5dbaf02215a8f98)\n\nVanguard is my 401k provider and their self-directed brokerage is provided by TD Ameritrade which is why you see screenshots from two different apps. Started the year with $11K in 401k, deposited $26K more in Jan and then started trading in Feb with $35K. The $49K withdrawal in June was for a 401k loan to buy a Tesla.\n\n[Looking at this all-time graph gets me so hard](https://preview.redd.it/vufh3f4b3c761.jpg?width=1242&format=pjpg&auto=webp&s=0f708f141f1c9177f212aa271e443eab5be3fd18)\n\nIn my first run up to June, turned $35k into $850K (APT, CODX, NCLH, CHWY) and decided my luck was too good and needed to \"cool down\". Decided to withdraw $50k for a Tesla and stayed away from the markets for a good 3 months thinking the market was going to go back down again...\n\nBut it didn't, the market kept rallying and I got the tendie tingles. My first move in Sept was to go all-in on WORK and bought at the high of $35 and was immediately down -30% thanks to their shit ER. They recovered a bit in the weeks afterwards and then jumped into CRSR which made me a millionaire and then GME. GME also shit the bed with a -20% ER but recovered swiftly thanks to Lord Cohen and recently jumped into STIC for that final spike up.\n\n**Chapter 4: Explaining every trade**\n\n[Proof of every gain\\/loss I've ever traded \\(except APT history which was in Vanguard\\)](https://preview.redd.it/mheen4rd3c761.png?width=906&format=png&auto=webp&s=504af2cd40b63d276fb42bb83c11bc85c6c1e18f)\n\nMy strategy is going all-in on a single stock all-shares. The idea is to have a thesis and conviction with that trade. I stay in the trade until the thesis is invalidated or another opportunity arises, it's a simple strategy and it's worked for me so far. My account does not allow options or margin trading.\n\nHere's a few theses and history I remember in hopes folks can learn something:\n\n* **APT/CODX** \\- It was obvious to me in Jan/Feb that this coronavirus was the real deal. The trick was to look at the facts and not the noise. There was a fake [viral video](https://timesofindia.indiatimes.com/times-fact-check/news/fact-check-are-these-wuhan-residents-screaming-and-begging-for-their-lives/articleshow/74062839.cms) of blood-curdling screams from Wuhan apartments that was so obviously fake but western media loved it. On the other hand, Wuhan built a makeshift hospital in just [10 days](https://www.youtube.com/watch?v=3Sh7hghljuQ), that's real action the government took and showed me how seriously dangerous this new virus was going to be. So I loaded up on APT, a mask stock, and rode it up and then switched to CODX, a testing stock, and rode that up from $11 to $24 selling right before their botched ER (conf call with no queue and everyone talking over each other lol)\n* **NCLH** \\- Saw a curious spike in volume on May 14 with a move upward, piqued my tendie tingles again. Decided it was worth an all-in at $10.57 as the support of $10 was pretty strong. The mood at the time was that coronavirus was waning (I knew it was wrong but the market was emotionally optimistic) and fortunately it caused NCLH to moon and I sold at $19.75 on June 4 even though it kept mooning to $26 over the next 2 days\n* **CHWY** \\- Got a dog, it's cute. Pets + E-Commerce during a pandemic, easy money. Bought at $41 and sold at $46 only because I thought it was moving kind of slowly. Well I was pretty wrong, now it's at $104\n* **SQQQ/TVIX** \\- I tried being a gay bear for an hour and lost money. Don't ever be a gay bear\n* **CRSR** \\- Been watching a ton of tech review and PC building YouTube channels and subreddits and the \"enthusiast\" crowd is definitely larger and has bigger wallets than people think. There is fucking [keyboard typing ASMR](https://www.youtube.com/watch?v=P6gW18XE6EM) now and ebay reviewers THANKING scalpers for charging them 2-3x MRSP. Biggest generational jump in GPU and CPU in a while and recently IPO-ed Corsair was definitely gonna benefit from this new generation of gamers was my thesis. Went all-in at $24 and sold at $36 after a non-stop run even though it kept running all the way to $51. No regrets, profit is profit.\n* **WORK** \\- It was the only \"WFH\" stock that didn't moon yet, thought it deserved a chance was my thesis. Went all-in at the tippy top of $35 on Sept 2 and it immediately kept crashing all the way to $24 in 5 days. Fortunately it recovered a bit and sold at $32 for a loss since I gave up hope and it seemed to be running out of steam\n\n**Chapter 5: GME Gang Confession**\n\nNow: I have a confession to make. My conviction for the Gamestop MOASS is insane. Had 88,233 shares at $13.04 buy-in with a $120 stop limit. Listening to this [90-min podcast](https://anchor.fm/modernguilt/episodes/EP27--NEXT-STOP--GAMESTOP-MOON-BASE-ensdq6) of /u/Uberkikz11 going on about how he knows more about this company than any mortal human should gets me so friken hard every time.\n\nBut. That -20% ER drop hurt me on a spiritual level. Watching my account go from $1.5M to $1.1M at one point gave me Taco Bell-levels of stomach cramps.\n\nSo when it bounced back to $15-16 on no news on Fri, Dec 18, I felt like I needed to \"cool down\" again. It was going into the holidays with a British virus mutation on the way and hedge funds [manipulating](https://www.youtube.com/watch?v=gMShFx5rThI) to get their holiday bonuses, it felt kind of dangerous. And no way Ryan Cohen would be working with his lawyers on something that fast over the holidays, right?\n\nSo I sold all my GME at $15.50.\n\nThen on Mon, Dec 21 morning, Lord Cohen drops his new 13D/A... but the stock price stayed flat all day. The Lord gave me a chance. A whole day to get back in. Unfortunately I didn't take it.\n\nAnd then Tue, Dec 22 all tendies broke loose, the squeezening. +25% gain. /u/deepfuckingvalue dropping his massive dong in another update. I waddled back and forth in my fetal position. Missed out on \\~$300K gain while watching everyone freak out. Felt exactly like this:\n\n[Can't feel my dick at all...](https://preview.redd.it/gn74i1yg3c761.jpg?width=460&format=pjpg&auto=webp&s=4c1a7031f8528f949a6d409f045ca727298e7312)\n\n**Chapter 6: Barking on a STIC**\n\nWhile waddling and scrolling on my phone, I happened to stumble across [this post](https://removeddit.com/r/wallstreetbets/comments/kih8z3/the_next_meme_hot_pick_for_all_the_good_boy/) about STIC and BarkBox. Not sure why /u/pound_salt_ deleted the original post but at the time, it was the only post about it on WSB\n\nI was pretty familiar with BarkBox and started researching, it seemed super un-discovered. I liked what I saw: Pets. E-commerce. Subscription. SPAC. Basic white bitches spoiling dogs. This might be worth an all-in.\n\nSo on Wed, Dec 23 morning I decided to make a move. All-in at $14.42.\n\nThen I started writing everything I had learned and posted it all in my DD post at 1:46PM ET because I thought it was worth sharing what I found [https://www.reddit.com/r/wallstreetbets/comments/kiypqq/sir\\_jack\\_a\\_lots\\_next\\_move\\_all\\_in\\_stic\\_bark\\_merger/](https://www.reddit.com/r/wallstreetbets/comments/kiypqq/sir_jack_a_lots_next_move_all_in_stic_bark_merger/)\n\nThe price was $14.25 at the time of posting and frankly, price was oddly flat at $14.25 pretty much all day. Lots of people got to buy in at this price. Why did it take me so long to write it? I had actual work meetings all morning and wrote it during my lunch break\n\nThen by the luck of the gods, apparently the CEO of BarkBox, Matt Meeker, went onto [CNBC](https://www.cnbc.com/video/2020/12/23/bark-to-go-public.html) at 3:20PM ET and it started mooning. On Thurs, Dec 24 I awoke to a 20% pop and shared my gains for ya'll to salivate over. Complete. Luck.\n\n# Ghost of Christmas Future\n\n**Chapter 7: What's next?**\n\nLet me be clear. I stand by every word of conviction I mentioned in all my GME and STIC posts, those are still my favorite H1 2021 plays. Holding STIC until merger would most definitely get you some massive gains.\n\nBut I'm a swing momentum trader. If I feel like something is running out of steam, has a risk of a rug pull, or another stock has potential to pick up steam with lesser downside, that's when I usually jump around.\n\nI'm not happy with just a +25% in 3 months. I want a +25% compounded on +25% compounded on another +25% in the same 3 month time period.\n\nOn Monday, Dec 28 I will probably sell STIC and move all into CRSR again. From technical charting perspective, I'm loving the setup and the [magical crayons](https://imgur.com/a/PxlN2em) are telling me we're at the support again and this should bounce in anticipation of strong Q4 earnings.\n\nNow: this is not a ding on STIC or GME, I stand by my 2x-10x claims at some point in H1 2021. It will eventually get there but it might also dip and rise again and I want to swing that dip and rise.\n\nLet me spell it out for some retards: because STIC moon-ed so fast, I want to sell to capture profits and hopefully buy back in on a dip. If STIC had not mooned yet, I would still be holding STIC for a more gradual moon-ing to let my thesis play out. If STIC does not dip but keeps mooning, then I will not chase and happily watch other diamond hands enjoy their tendies.\n\n# Q&A / AMAA\n\nI'm fucking tired of answering the same repeated idiotic questions. Let this Q&A serve as an artifact and please link it to new retards. I will also proceed to debunk every single fucking false claim I've read in my last few posts. Also feel free to AMAA in the comments, I'll be replying all day.\n\n1. **How often do you jack off?** At least 2 times a day and always before I make a trade for that post-nut clarity\n2. **Haha you're going to owe so much in taxes** \\- Nope, this is all in my 401k which in the US means I don't owe taxes until I withdraw. Fucking compounding gains for years bitch\n3. **Why are you making such risky trades?** My goal is 8 digits or bust, that's my /r/fatfire number so I can finally quit this wageslave game. It's so obviously stacked against us and requires a lottery moment to reach escape velocity to play on New Game+ where I can live on $400k 4% SWR on $10M. This is my lottery moment and I'm leaning all the fucking way in. That's why I'm chad-ing it up and trying to TIME the market, meaning riding shit up and then jumping back into shit for another ride up. Fuck you Warren Buffet and your 90 y/o \"time in the market\" boomer bullshit. The next pandemic in 2025 might wipe us all out anyways, I ain't got time to wait for retirement. Gotta will it into existence. YOLO\n4. **How are you so good at this?** I study everything. Technicals. Charts. Support levels. Volume spikes. Short interest. Executive teams. Rumors. Customer sentiment. Employee morale. Insider trading. MSM manipulation. Comparable market caps. ER reports. Upgrade reports. SEC filings. Meme potential. I literally watch and study every facet I can about a company, and do so quickly.\n5. **What's your trading strategy?** All-in on a single stock all-shares. The idea is to have a thesis and conviction with that trade. I stay in the trade until the thesis is invalidated or another opportunity arises, it's a simple strategy and it's worked for me so far.\n6. **Why do you post on WSB?** Internet points is fucking fun. I was banned for like 30 minutes  yesterday (on \"accident\" apparently) and having $200k+ gains without the ability to share was just not the same\n7. **How do I follow your next move?** Oh just follow my discord/newslett -- no fuck that shit. I don't do discord or newsletters or twitter or anything else. I'll keep posting on WSB until 8 digits or bust (or ban), you can guarantee that.\n8. **Why do you remove the time on your screenshots?** I'm cropping shit on my iPhone and my username is between the portfolio number and the top bar. Otherwise I'd love to friken show off my perpetual 69% battery level\n9. **15% isn't a real YOLO** \\- I am literally shoving my entire net worth into a single stock every single time. Correct it's not the same as blackjack or FDs where if I got it wrong, I could lose everything but it's still fucking riskier than any ETF or financial advisor with their cuckold MBA would ever advise. One 15% play may not be impressive but compounded together is how you get this 50X in less than a year\n10. **Where's PLTR or TSLA?** Notice I never once touched PLTR, TSLA, NIO, XBEV, MVIS, etc or any of the other meme stocks WSB loves. That's because I hate being a sheep and following after the curve. I try to find shit *right* before the curve starts (usually indicated by a volume spike) and most WSB meme stocks are up way too high for my risk tolerance. Too much at stake to lose to a random rug pull moment.\n11. **Hey I think I'm your cousin, can I get some money?** No you fuck, [stop being poor](https://i.redd.it/eyj4re61ibe21.jpg).\n12. **Hey do you wanna fuck my ex-wife?** Already did, next\n13. **You're just using WSB to pump and dump on us** \\- No you fucking idiot.\n\n* **First:** look at my [post history](https://www.reddit.com/user/SIR_JACK_A_LOT/posts/), I NEVER make a hard recommendation for people to buy a stock. I only share my gains, losses, or DD because it's fucking funny to see how ya'll react. Whether people want to follow my move or not is 100% up to people. Do your own fucking DD and figure out when you want to sell according to your own thesis/risk tolerance.\n* **Second**: You folks keep asking me for my next move. Well how and when the fuck should I share it? If I post something in the morning, it's stuck in /new for a while until it gets enough upvotes to hit the front page and by then it's already afternoon or market close and the stock might have already done who knows what. That's not pump and dumping, that's just a delayed effect of how Reddit's algorithm works. Anything on the front page is essentially 5-15 hours old news and you need to determine if the state of the world is still the same or be a sheep and chase. It's the same thing once you hear Aunt Cathie or Boomer Cramer mention a stock and it trickles down to you, you're chasing after others have already gotten in\n* **Third:** My $1.5M is not enough to move any real-volume stock. I don't touch OTC or low-volume shit. For STIC: I have 97K shares and on average 2-4M shares are traded every day for STIC so my account is a like a drop of whale cum in the ocean\n* **Fourth:** Real pump and dumpers are the shitty scum on the earth. Spend any time in /r/pennystocks or some Discord or Stocktwits and holy shit, these scum run fucking operations. I've even seen paid newsletters where the highest tier gets the tip \"early\" to buy in and then the lower/free tiers get the tip which causes the pump for the early buyers to literally dump on and create bag holders on non-existant volume too\n* **Fifth:** Listen to what /u/DoubleKillGG and his big brain figured out the rest of you retards could not:\n\n>The fact is that SIR\\_JACK\\_A\\_LOT is a swing trader. Yes he pumps his stocks and closes relatively quickly but he doesn't pump shit stocks. If you bought any of his positions when he posted you'd be up on everything. A pump and dump requires the dump part where investors are left holding a stock that is worth less than when they bought it. He did, however, break wsb's rule #4; STIC's market cap is below $1B.  \n>  \n>His positions closed and what they're worth currently  \n>  \n>NCLH: Exit at 17.95. Current share price is 24.51  \n>  \n>CHWY: Exit at 44.35. Current share price is 104.10  \n>  \n>NCLH (again): Exit at 19.16. Current share price is 24.51  \n>  \n>CRSR: Exit at 35.57. Current share price is 36.70  \n>  \n>PTON: Exit at 109.46. Current share price is 163.60  \n>  \n>GME: Exit at 15.96. Current share price is 20.26  \n>  \n>\\*\\\\\\*Exits are estimations from his posts\\*  \n>  \n>STIC: Posted DD when share price was around 14.25. Current share price is 17.85\n\n**Shout-outs**\n\nSome of ya'll are real gems. Major props to:\n\n* My GME gang /u/Uberkikz11, /u/Ackilles, and of course the king /u/deepfuckingvalue along with a few others like /u/CPTHubbard, /u/OutrageousDesk, /u/Tomatotowers, /u/Stonksflyingup, /u/sneakersourcerer, /u/Midaswhale30, /u/Jeffamazon, /u/DrZaius0 for the amazing DD, memes, and brotherhood\n* /u/alifeofataraxia for his YouTube videos chronicling the tale of SIR JACK A LOT - [Part 1](https://www.youtube.com/watch?v=yW4Fr39n_uM), [Part 2](https://www.youtube.com/watch?v=MKfjMHmqkzo), [Part 3](https://www.youtube.com/watch?v=UP8fRTEIFpI)\n* /u/GrowerNotAShower11 for his erotic fan-fiction. I need one written about Cramer succumbing ahegao-style to the awe of my portfolio gains and massive dong STAT\n* Many other loyal fans who helped me get unbanned yesterday, thank you\n\n**Fuck You Haters**\n\nLast week we got /u/durado so cucked he deleted his account and now /u/kingobama123 is all up on my ass. First, read this magnum dong opus and if you have more questions, ask it in the comments, I'll cum all over you.\n\n**POLL**\n\nTo really drive home the value I bring to WSB, let's see how many peoples' lives I've changed and for the better or worse. Take this poll regarding whether I helped make you gain or lose money if you've been following.\n\n[https://www.strawpoll.me/42341589](https://www.strawpoll.me/42341589)\n\n**🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄**\n\n**🎄🚀🎄🚀Merry Fucking Christmas 🚀🎄🚀**\n\n**🚀🎄Jerome Powell bless us, every one!🚀🎄**\n\n**🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀**\n\n[My usual order is the 13-piece tenders - whopping 1780 calories in a single sitting](https://preview.redd.it/ykuygl8i3c761.jpg?width=2048&format=pjpg&auto=webp&s=a2f40d1186b3c99c15cf1a0584ff41428326cb84)", "author_fullname": "t2_7ff3c", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "A SIR_JACK_A_LOT Christmas Carol - My magnum dong opus on turning $35K to $1.75M (50X) in less than a year", "link_flair_richtext": [{"e": "text", "t": "Storytime"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "storytime", "downs": 0, "thumbnail_height": 140, "top_awarded_type": null, "hide_score": true, "media_metadata": {"ykuygl8i3c761": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 108, "x": 108, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=108&crop=smart&auto=webp&s=977390a8684ab96314ad7b907b760476744ac660"}, {"y": 216, "x": 216, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=216&crop=smart&auto=webp&s=bcc89c14c3f5a5000322c52b4cd4eee2ebcaaefb"}, {"y": 320, "x": 320, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=320&crop=smart&auto=webp&s=b8fa7be6b5b6d42ecd24e992ba801e5a467b80de"}, {"y": 640, "x": 640, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=640&crop=smart&auto=webp&s=d943d42c42b8a640d55650337669cd928e401e81"}, {"y": 960, "x": 960, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=960&crop=smart&auto=webp&s=9c797688c784c8390726c74536074b4365c5f3f9"}, {"y": 1080, "x": 1080, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=1080&crop=smart&auto=webp&s=f1a90adfcf3e640e83808725ccb2b5352be74cdf"}], "s": {"y": 2048, "x": 2048, "u": "https://preview.redd.it/ykuygl8i3c761.jpg?width=2048&format=pjpg&auto=webp&s=a2f40d1186b3c99c15cf1a0584ff41428326cb84"}, "id": "ykuygl8i3c761"}, "vufh3f4b3c761": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 117, "x": 108, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=108&crop=smart&auto=webp&s=68add0acfa14df9afd20eeba7a4426d6d428010e"}, {"y": 235, "x": 216, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=216&crop=smart&auto=webp&s=67207f6671b83394b2b87cb95583819efb4cad2d"}, {"y": 349, "x": 320, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=320&crop=smart&auto=webp&s=3b2f9423fdf855ada8f30f365ac30c308506650a"}, {"y": 698, "x": 640, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=640&crop=smart&auto=webp&s=1180e53a300be4d5daf51031ff5af3e258461340"}, {"y": 1047, "x": 960, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=960&crop=smart&auto=webp&s=55978c328c46b87ea384daca6149e4a1b4aa08fe"}, {"y": 1178, "x": 1080, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=1080&crop=smart&auto=webp&s=7dd2f188a7d19f46eaed8dd5e1c0260b4a0798e3"}], "s": {"y": 1355, "x": 1242, "u": "https://preview.redd.it/vufh3f4b3c761.jpg?width=1242&format=pjpg&auto=webp&s=0f708f141f1c9177f212aa271e443eab5be3fd18"}, "id": "vufh3f4b3c761"}, "cm95k7f43c761": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 85, "x": 108, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=108&crop=smart&auto=webp&s=eb8d019859889c36005017bed4180f061ad255e9"}, {"y": 170, "x": 216, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=216&crop=smart&auto=webp&s=f48389641c9a0f33b66a9032a241d6553ee1cf38"}, {"y": 252, "x": 320, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=320&crop=smart&auto=webp&s=347bfa2b60dfe78930ac471517875cff983b9ca0"}, {"y": 504, "x": 640, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=640&crop=smart&auto=webp&s=c7fe7621d3bacd372db52f1c7ab73051f6d69dd5"}, {"y": 757, "x": 960, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=960&crop=smart&auto=webp&s=ec332f4619f1913de21fe1294ab7d7ce9de9e441"}, {"y": 852, "x": 1080, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=1080&crop=smart&auto=webp&s=13f14e111ca00366ea70a0631fa521d45afda398"}], "s": {"y": 980, "x": 1242, "u": "https://preview.redd.it/cm95k7f43c761.jpg?width=1242&format=pjpg&auto=webp&s=806ab5dc60f841ab326aec4ae3f5f39ee8312847"}, "id": "cm95k7f43c761"}, "mheen4rd3c761": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 96, "x": 108, "u": "https://preview.redd.it/mheen4rd3c761.png?width=108&crop=smart&auto=webp&s=f85122b0847730342e4a6c9df56a204df1eadfe0"}, {"y": 193, "x": 216, "u": "https://preview.redd.it/mheen4rd3c761.png?width=216&crop=smart&auto=webp&s=2d1b670a9a0de9befa74890ecc1614134637d83d"}, {"y": 286, "x": 320, "u": "https://preview.redd.it/mheen4rd3c761.png?width=320&crop=smart&auto=webp&s=a6df383ddf0b9e1d23c1dc426cd236a0e5bdd4e5"}, {"y": 572, "x": 640, "u": "https://preview.redd.it/mheen4rd3c761.png?width=640&crop=smart&auto=webp&s=0a6b862e382fb0c0fd6fa3d5c26fdc40e150c7d4"}], "s": {"y": 810, "x": 906, "u": "https://preview.redd.it/mheen4rd3c761.png?width=906&format=png&auto=webp&s=504af2cd40b63d276fb42bb83c11bc85c6c1e18f"}, "id": "mheen4rd3c761"}, "gn74i1yg3c761": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 54, "x": 108, "u": "https://preview.redd.it/gn74i1yg3c761.jpg?width=108&crop=smart&auto=webp&s=2effdd1d02232bc06a9bb7f376b972ce7c100508"}, {"y": 109, "x": 216, "u": "https://preview.redd.it/gn74i1yg3c761.jpg?width=216&crop=smart&auto=webp&s=f7cf8085e7c1d1d2bc11807861100ebfcb6d21f2"}, {"y": 162, "x": 320, "u": "https://preview.redd.it/gn74i1yg3c761.jpg?width=320&crop=smart&auto=webp&s=322dd033a09a9aff23201ffe1574f440491d0bb6"}], "s": {"y": 233, "x": 460, "u": "https://preview.redd.it/gn74i1yg3c761.jpg?width=460&format=pjpg&auto=webp&s=4c1a7031f8528f949a6d409f045ca727298e7312"}, "id": "gn74i1yg3c761"}, "fsabjzo13c761": {"status": "valid", "e": "Image", "m": "image/jpg", "p": [{"y": 117, "x": 108, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=108&crop=smart&auto=webp&s=773029de884882461da98e1b93acbca12404cbf0"}, {"y": 235, "x": 216, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=216&crop=smart&auto=webp&s=f0430036a0cb79eb864ad554120c9f8e176c566b"}, {"y": 349, "x": 320, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=320&crop=smart&auto=webp&s=f9bcce492c7c475d3565c09d33986588271d61f4"}, {"y": 698, "x": 640, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=640&crop=smart&auto=webp&s=c15600830d57dce1cddbc91186fab0ac6f28108f"}, {"y": 1047, "x": 960, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=960&crop=smart&auto=webp&s=48a88770f99829509042138b759e646586f0e1c6"}, {"y": 1178, "x": 1080, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=1080&crop=smart&auto=webp&s=80e2415d74158a0045df50edcfe72dca5ce3db0d"}], "s": {"y": 1355, "x": 1242, "u": "https://preview.redd.it/fsabjzo13c761.jpg?width=1242&format=pjpg&auto=webp&s=3562fc1720f4a9dc5dffd7e215595078dd01d6b5"}, "id": "fsabjzo13c761"}, "lka2ez963c761": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 96, "x": 108, "u": "https://preview.redd.it/lka2ez963c761.png?width=108&crop=smart&auto=webp&s=ff9feea1e0229c18246a8f5856b808e2aa3f0463"}, {"y": 193, "x": 216, "u": "https://preview.redd.it/lka2ez963c761.png?width=216&crop=smart&auto=webp&s=02808a42886a0e27611263f79f237532aef5eba6"}, {"y": 286, "x": 320, "u": "https://preview.redd.it/lka2ez963c761.png?width=320&crop=smart&auto=webp&s=6bdc13f7b5635a0af33ba3e00a513f9a2adacb5e"}, {"y": 572, "x": 640, "u": "https://preview.redd.it/lka2ez963c761.png?width=640&crop=smart&auto=webp&s=cb663a6b2b7a0a49784976db6023c080d2eacac3"}], "s": {"y": 810, "x": 906, "u": "https://preview.redd.it/lka2ez963c761.png?width=906&format=png&auto=webp&s=f0fd2facab8f700e2f65c813a5dbaf02215a8f98"}, "id": "lka2ez963c761"}}, "name": "t3_kjyzh7", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.95, "author_flair_background_color": "", "subreddit_type": "public", "ups": 268, "total_awards_received": 3, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": true, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Storytime", "can_mod_post": false, "score": 268, "approved_by": null, "author_premium": true, "thumbnail": "https://b.thumbs.redditmedia.com/W4O7vy-S-wz15Gjlic1To-eztnCZGcspYfMQY1wIXrA.jpg", "edited": 1608904024.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {"gid_1": 1}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1608931532.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><a href=\"https://preview.redd.it/fsabjzo13c761.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=3562fc1720f4a9dc5dffd7e215595078dd01d6b5\">How I went from $35K to $1.75M (50X) in less than a year</a></p>\n\n<h1><a href=\"https://pbs.twimg.com/media/EMpQn-QWoAI309S.jpg\">Introduction</a></h1>\n\n<p>Gather &#39;round retards and autists. Grab a mug of <a href=\"https://pics.me.me/mmmmm-eggnog-when-you-drink-it-try-not-to-think-about-49090075.png\">eggnog</a>, find a cozy corner in your mom&#39;s basement, and enjoy the tale of SIR JACK A LOT.</p>\n\n<p>In this post: I&#39;ll go over my trading history, my strategy, my philosophy, and also systematically destroy every accusation and idiotic question made against me in the last week WITH RECEIPTS. No one doubts motherfuckin SIR JACK A LOT.</p>\n\n<p><strong>Disclaimers</strong></p>\n\n<p>Privacy is important to me. I wish to stay anonymous. This is not financial advice, just my story.</p>\n\n<h1>Ghosts of Christmas Past</h1>\n\n<p><strong>Chapter 1: Crypto (2017-18)</strong></p>\n\n<p>How it all started... I threw every last dollar I had in ETH at $12 and swing traded a ton of shit coins and ICOs until it all came crashing down.</p>\n\n<p>In short: turned $8K into $300K and back to $30k but owed the IRS ~$120K since all the gains were calculated at 2017-year-end. I royally fucked myself because I didn&#39;t set any money aside for taxes. Ended up in debt to some very bad people and things were very dark, I don&#39;t like to talk about this time in my life that much.</p>\n\n<p><strong>Chapter 2: WSB Tuition (2018)</strong></p>\n\n<p>First learned about WSB in 2018 from the infamous FB <a href=\"https://www.reddit.com/r/wallstreetbets/comments/922gtp/facebooks_put_play_from_yesterday_im_20_time_to/\">ER put play</a> by <a href=\"/u/YungBillionaire\">/u/YungBillionaire</a> turning ~$28K into $451K overnight. That sounded fun.</p>\n\n<p>Quickly learned about options but most importantly about FDs, tendies, and the power of memes.</p>\n\n<p>Back then it was all about trade wars and hanging at the whim of commander cheeto&#39;s supple tweets.</p>\n\n<p>I have fond memories of:</p>\n\n<ul>\n<li>Apparently the first stock I ever bought on Robinhood was <a href=\"https://imgur.com/a/2AsrVQB\">HMNY</a>... thanks Robinhood Recap for the reminder of my retarded-ness</li>\n<li>Grew my first set of winkles on my smooth brain with AMC calls. The thesis was that their Stubs A-List subscription was doing pretty well according to <a href=\"/r/AMCsAList\">/r/AMCsAList</a> back then</li>\n<li>Went all-in MTCH weekly puts with $12K clenching my stomach in the fetal position when all of a sudden there was a <a href=\"https://www.bizjournals.com/dallas/news/2018/08/14/match-group-faces-2b-lawsuit-from-tinder-co.html\">lawsuit</a> and I tripled my account in minutes, pure luck</li>\n</ul>\n\n<p>Still ended up losing $30K and swore off options forever... until 2020 where I lost another $10k in options. Fucking weeklies man, they&#39;re like if cocaine and blackjack made a dopamine-infused baby</p>\n\n<p><a href=\"https://preview.redd.it/cm95k7f43c761.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=806ab5dc60f841ab326aec4ae3f5f39ee8312847\">WTF is up with the snowflakes Robinhood? So gay, instant short when it IPOs</a></p>\n\n<h1>Ghosts of Christmas Present</h1>\n\n<p><strong>Chapter 3: Road to $1M+ (2020)</strong></p>\n\n<p>Let&#39;s start with the receipts since that&#39;s what everyone&#39;s interested in:</p>\n\n<p><a href=\"https://preview.redd.it/lka2ez963c761.png?width=906&amp;format=png&amp;auto=webp&amp;s=f0fd2facab8f700e2f65c813a5dbaf02215a8f98\">Proof that I started Feb 2020 with only $35K</a></p>\n\n<p>Vanguard is my 401k provider and their self-directed brokerage is provided by TD Ameritrade which is why you see screenshots from two different apps. Started the year with $11K in 401k, deposited $26K more in Jan and then started trading in Feb with $35K. The $49K withdrawal in June was for a 401k loan to buy a Tesla.</p>\n\n<p><a href=\"https://preview.redd.it/vufh3f4b3c761.jpg?width=1242&amp;format=pjpg&amp;auto=webp&amp;s=0f708f141f1c9177f212aa271e443eab5be3fd18\">Looking at this all-time graph gets me so hard</a></p>\n\n<p>In my first run up to June, turned $35k into $850K (APT, CODX, NCLH, CHWY) and decided my luck was too good and needed to &quot;cool down&quot;. Decided to withdraw $50k for a Tesla and stayed away from the markets for a good 3 months thinking the market was going to go back down again...</p>\n\n<p>But it didn&#39;t, the market kept rallying and I got the tendie tingles. My first move in Sept was to go all-in on WORK and bought at the high of $35 and was immediately down -30% thanks to their shit ER. They recovered a bit in the weeks afterwards and then jumped into CRSR which made me a millionaire and then GME. GME also shit the bed with a -20% ER but recovered swiftly thanks to Lord Cohen and recently jumped into STIC for that final spike up.</p>\n\n<p><strong>Chapter 4: Explaining every trade</strong></p>\n\n<p><a href=\"https://preview.redd.it/mheen4rd3c761.png?width=906&amp;format=png&amp;auto=webp&amp;s=504af2cd40b63d276fb42bb83c11bc85c6c1e18f\">Proof of every gain/loss I&#39;ve ever traded (except APT history which was in Vanguard)</a></p>\n\n<p>My strategy is going all-in on a single stock all-shares. The idea is to have a thesis and conviction with that trade. I stay in the trade until the thesis is invalidated or another opportunity arises, it&#39;s a simple strategy and it&#39;s worked for me so far. My account does not allow options or margin trading.</p>\n\n<p>Here&#39;s a few theses and history I remember in hopes folks can learn something:</p>\n\n<ul>\n<li><strong>APT/CODX</strong> - It was obvious to me in Jan/Feb that this coronavirus was the real deal. The trick was to look at the facts and not the noise. There was a fake <a href=\"https://timesofindia.indiatimes.com/times-fact-check/news/fact-check-are-these-wuhan-residents-screaming-and-begging-for-their-lives/articleshow/74062839.cms\">viral video</a> of blood-curdling screams from Wuhan apartments that was so obviously fake but western media loved it. On the other hand, Wuhan built a makeshift hospital in just <a href=\"https://www.youtube.com/watch?v=3Sh7hghljuQ\">10 days</a>, that&#39;s real action the government took and showed me how seriously dangerous this new virus was going to be. So I loaded up on APT, a mask stock, and rode it up and then switched to CODX, a testing stock, and rode that up from $11 to $24 selling right before their botched ER (conf call with no queue and everyone talking over each other lol)</li>\n<li><strong>NCLH</strong> - Saw a curious spike in volume on May 14 with a move upward, piqued my tendie tingles again. Decided it was worth an all-in at $10.57 as the support of $10 was pretty strong. The mood at the time was that coronavirus was waning (I knew it was wrong but the market was emotionally optimistic) and fortunately it caused NCLH to moon and I sold at $19.75 on June 4 even though it kept mooning to $26 over the next 2 days</li>\n<li><strong>CHWY</strong> - Got a dog, it&#39;s cute. Pets + E-Commerce during a pandemic, easy money. Bought at $41 and sold at $46 only because I thought it was moving kind of slowly. Well I was pretty wrong, now it&#39;s at $104</li>\n<li><strong>SQQQ/TVIX</strong> - I tried being a gay bear for an hour and lost money. Don&#39;t ever be a gay bear</li>\n<li><strong>CRSR</strong> - Been watching a ton of tech review and PC building YouTube channels and subreddits and the &quot;enthusiast&quot; crowd is definitely larger and has bigger wallets than people think. There is fucking <a href=\"https://www.youtube.com/watch?v=P6gW18XE6EM\">keyboard typing ASMR</a> now and ebay reviewers THANKING scalpers for charging them 2-3x MRSP. Biggest generational jump in GPU and CPU in a while and recently IPO-ed Corsair was definitely gonna benefit from this new generation of gamers was my thesis. Went all-in at $24 and sold at $36 after a non-stop run even though it kept running all the way to $51. No regrets, profit is profit.</li>\n<li><strong>WORK</strong> - It was the only &quot;WFH&quot; stock that didn&#39;t moon yet, thought it deserved a chance was my thesis. Went all-in at the tippy top of $35 on Sept 2 and it immediately kept crashing all the way to $24 in 5 days. Fortunately it recovered a bit and sold at $32 for a loss since I gave up hope and it seemed to be running out of steam</li>\n</ul>\n\n<p><strong>Chapter 5: GME Gang Confession</strong></p>\n\n<p>Now: I have a confession to make. My conviction for the Gamestop MOASS is insane. Had 88,233 shares at $13.04 buy-in with a $120 stop limit. Listening to this <a href=\"https://anchor.fm/modernguilt/episodes/EP27--NEXT-STOP--GAMESTOP-MOON-BASE-ensdq6\">90-min podcast</a> of <a href=\"/u/Uberkikz11\">/u/Uberkikz11</a> going on about how he knows more about this company than any mortal human should gets me so friken hard every time.</p>\n\n<p>But. That -20% ER drop hurt me on a spiritual level. Watching my account go from $1.5M to $1.1M at one point gave me Taco Bell-levels of stomach cramps.</p>\n\n<p>So when it bounced back to $15-16 on no news on Fri, Dec 18, I felt like I needed to &quot;cool down&quot; again. It was going into the holidays with a British virus mutation on the way and hedge funds <a href=\"https://www.youtube.com/watch?v=gMShFx5rThI\">manipulating</a> to get their holiday bonuses, it felt kind of dangerous. And no way Ryan Cohen would be working with his lawyers on something that fast over the holidays, right?</p>\n\n<p>So I sold all my GME at $15.50.</p>\n\n<p>Then on Mon, Dec 21 morning, Lord Cohen drops his new 13D/A... but the stock price stayed flat all day. The Lord gave me a chance. A whole day to get back in. Unfortunately I didn&#39;t take it.</p>\n\n<p>And then Tue, Dec 22 all tendies broke loose, the squeezening. +25% gain. <a href=\"/u/deepfuckingvalue\">/u/deepfuckingvalue</a> dropping his massive dong in another update. I waddled back and forth in my fetal position. Missed out on ~$300K gain while watching everyone freak out. Felt exactly like this:</p>\n\n<p><a href=\"https://preview.redd.it/gn74i1yg3c761.jpg?width=460&amp;format=pjpg&amp;auto=webp&amp;s=4c1a7031f8528f949a6d409f045ca727298e7312\">Can&#39;t feel my dick at all...</a></p>\n\n<p><strong>Chapter 6: Barking on a STIC</strong></p>\n\n<p>While waddling and scrolling on my phone, I happened to stumble across <a href=\"https://removeddit.com/r/wallstreetbets/comments/kih8z3/the_next_meme_hot_pick_for_all_the_good_boy/\">this post</a> about STIC and BarkBox. Not sure why <a href=\"/u/pound_salt_\">/u/pound_salt_</a> deleted the original post but at the time, it was the only post about it on WSB</p>\n\n<p>I was pretty familiar with BarkBox and started researching, it seemed super un-discovered. I liked what I saw: Pets. E-commerce. Subscription. SPAC. Basic white bitches spoiling dogs. This might be worth an all-in.</p>\n\n<p>So on Wed, Dec 23 morning I decided to make a move. All-in at $14.42.</p>\n\n<p>Then I started writing everything I had learned and posted it all in my DD post at 1:46PM ET because I thought it was worth sharing what I found <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kiypqq/sir_jack_a_lots_next_move_all_in_stic_bark_merger/\">https://www.reddit.com/r/wallstreetbets/comments/kiypqq/sir_jack_a_lots_next_move_all_in_stic_bark_merger/</a></p>\n\n<p>The price was $14.25 at the time of posting and frankly, price was oddly flat at $14.25 pretty much all day. Lots of people got to buy in at this price. Why did it take me so long to write it? I had actual work meetings all morning and wrote it during my lunch break</p>\n\n<p>Then by the luck of the gods, apparently the CEO of BarkBox, Matt Meeker, went onto <a href=\"https://www.cnbc.com/video/2020/12/23/bark-to-go-public.html\">CNBC</a> at 3:20PM ET and it started mooning. On Thurs, Dec 24 I awoke to a 20% pop and shared my gains for ya&#39;ll to salivate over. Complete. Luck.</p>\n\n<h1>Ghost of Christmas Future</h1>\n\n<p><strong>Chapter 7: What&#39;s next?</strong></p>\n\n<p>Let me be clear. I stand by every word of conviction I mentioned in all my GME and STIC posts, those are still my favorite H1 2021 plays. Holding STIC until merger would most definitely get you some massive gains.</p>\n\n<p>But I&#39;m a swing momentum trader. If I feel like something is running out of steam, has a risk of a rug pull, or another stock has potential to pick up steam with lesser downside, that&#39;s when I usually jump around.</p>\n\n<p>I&#39;m not happy with just a +25% in 3 months. I want a +25% compounded on +25% compounded on another +25% in the same 3 month time period.</p>\n\n<p>On Monday, Dec 28 I will probably sell STIC and move all into CRSR again. From technical charting perspective, I&#39;m loving the setup and the <a href=\"https://imgur.com/a/PxlN2em\">magical crayons</a> are telling me we&#39;re at the support again and this should bounce in anticipation of strong Q4 earnings.</p>\n\n<p>Now: this is not a ding on STIC or GME, I stand by my 2x-10x claims at some point in H1 2021. It will eventually get there but it might also dip and rise again and I want to swing that dip and rise.</p>\n\n<p>Let me spell it out for some retards: because STIC moon-ed so fast, I want to sell to capture profits and hopefully buy back in on a dip. If STIC had not mooned yet, I would still be holding STIC for a more gradual moon-ing to let my thesis play out. If STIC does not dip but keeps mooning, then I will not chase and happily watch other diamond hands enjoy their tendies.</p>\n\n<h1>Q&amp;A / AMAA</h1>\n\n<p>I&#39;m fucking tired of answering the same repeated idiotic questions. Let this Q&amp;A serve as an artifact and please link it to new retards. I will also proceed to debunk every single fucking false claim I&#39;ve read in my last few posts. Also feel free to AMAA in the comments, I&#39;ll be replying all day.</p>\n\n<ol>\n<li><strong>How often do you jack off?</strong> At least 2 times a day and always before I make a trade for that post-nut clarity</li>\n<li><strong>Haha you&#39;re going to owe so much in taxes</strong> - Nope, this is all in my 401k which in the US means I don&#39;t owe taxes until I withdraw. Fucking compounding gains for years bitch</li>\n<li><strong>Why are you making such risky trades?</strong> My goal is 8 digits or bust, that&#39;s my <a href=\"/r/fatfire\">/r/fatfire</a> number so I can finally quit this wageslave game. It&#39;s so obviously stacked against us and requires a lottery moment to reach escape velocity to play on New Game+ where I can live on $400k 4% SWR on $10M. This is my lottery moment and I&#39;m leaning all the fucking way in. That&#39;s why I&#39;m chad-ing it up and trying to TIME the market, meaning riding shit up and then jumping back into shit for another ride up. Fuck you Warren Buffet and your 90 y/o &quot;time in the market&quot; boomer bullshit. The next pandemic in 2025 might wipe us all out anyways, I ain&#39;t got time to wait for retirement. Gotta will it into existence. YOLO</li>\n<li><strong>How are you so good at this?</strong> I study everything. Technicals. Charts. Support levels. Volume spikes. Short interest. Executive teams. Rumors. Customer sentiment. Employee morale. Insider trading. MSM manipulation. Comparable market caps. ER reports. Upgrade reports. SEC filings. Meme potential. I literally watch and study every facet I can about a company, and do so quickly.</li>\n<li><strong>What&#39;s your trading strategy?</strong> All-in on a single stock all-shares. The idea is to have a thesis and conviction with that trade. I stay in the trade until the thesis is invalidated or another opportunity arises, it&#39;s a simple strategy and it&#39;s worked for me so far.</li>\n<li><strong>Why do you post on WSB?</strong> Internet points is fucking fun. I was banned for like 30 minutes  yesterday (on &quot;accident&quot; apparently) and having $200k+ gains without the ability to share was just not the same</li>\n<li><strong>How do I follow your next move?</strong> Oh just follow my discord/newslett -- no fuck that shit. I don&#39;t do discord or newsletters or twitter or anything else. I&#39;ll keep posting on WSB until 8 digits or bust (or ban), you can guarantee that.</li>\n<li><strong>Why do you remove the time on your screenshots?</strong> I&#39;m cropping shit on my iPhone and my username is between the portfolio number and the top bar. Otherwise I&#39;d love to friken show off my perpetual 69% battery level</li>\n<li><strong>15% isn&#39;t a real YOLO</strong> - I am literally shoving my entire net worth into a single stock every single time. Correct it&#39;s not the same as blackjack or FDs where if I got it wrong, I could lose everything but it&#39;s still fucking riskier than any ETF or financial advisor with their cuckold MBA would ever advise. One 15% play may not be impressive but compounded together is how you get this 50X in less than a year</li>\n<li><strong>Where&#39;s PLTR or TSLA?</strong> Notice I never once touched PLTR, TSLA, NIO, XBEV, MVIS, etc or any of the other meme stocks WSB loves. That&#39;s because I hate being a sheep and following after the curve. I try to find shit <em>right</em> before the curve starts (usually indicated by a volume spike) and most WSB meme stocks are up way too high for my risk tolerance. Too much at stake to lose to a random rug pull moment.</li>\n<li><strong>Hey I think I&#39;m your cousin, can I get some money?</strong> No you fuck, <a href=\"https://i.redd.it/eyj4re61ibe21.jpg\">stop being poor</a>.</li>\n<li><strong>Hey do you wanna fuck my ex-wife?</strong> Already did, next</li>\n<li><strong>You&#39;re just using WSB to pump and dump on us</strong> - No you fucking idiot.</li>\n</ol>\n\n<ul>\n<li><strong>First:</strong> look at my <a href=\"https://www.reddit.com/user/SIR_JACK_A_LOT/posts/\">post history</a>, I NEVER make a hard recommendation for people to buy a stock. I only share my gains, losses, or DD because it&#39;s fucking funny to see how ya&#39;ll react. Whether people want to follow my move or not is 100% up to people. Do your own fucking DD and figure out when you want to sell according to your own thesis/risk tolerance.</li>\n<li><strong>Second</strong>: You folks keep asking me for my next move. Well how and when the fuck should I share it? If I post something in the morning, it&#39;s stuck in /new for a while until it gets enough upvotes to hit the front page and by then it&#39;s already afternoon or market close and the stock might have already done who knows what. That&#39;s not pump and dumping, that&#39;s just a delayed effect of how Reddit&#39;s algorithm works. Anything on the front page is essentially 5-15 hours old news and you need to determine if the state of the world is still the same or be a sheep and chase. It&#39;s the same thing once you hear Aunt Cathie or Boomer Cramer mention a stock and it trickles down to you, you&#39;re chasing after others have already gotten in</li>\n<li><strong>Third:</strong> My $1.5M is not enough to move any real-volume stock. I don&#39;t touch OTC or low-volume shit. For STIC: I have 97K shares and on average 2-4M shares are traded every day for STIC so my account is a like a drop of whale cum in the ocean</li>\n<li><strong>Fourth:</strong> Real pump and dumpers are the shitty scum on the earth. Spend any time in <a href=\"/r/pennystocks\">/r/pennystocks</a> or some Discord or Stocktwits and holy shit, these scum run fucking operations. I&#39;ve even seen paid newsletters where the highest tier gets the tip &quot;early&quot; to buy in and then the lower/free tiers get the tip which causes the pump for the early buyers to literally dump on and create bag holders on non-existant volume too</li>\n<li><strong>Fifth:</strong> Listen to what <a href=\"/u/DoubleKillGG\">/u/DoubleKillGG</a> and his big brain figured out the rest of you retards could not:</li>\n</ul>\n\n<blockquote>\n<p>The fact is that SIR_JACK_A_LOT is a swing trader. Yes he pumps his stocks and closes relatively quickly but he doesn&#39;t pump shit stocks. If you bought any of his positions when he posted you&#39;d be up on everything. A pump and dump requires the dump part where investors are left holding a stock that is worth less than when they bought it. He did, however, break wsb&#39;s rule #4; STIC&#39;s market cap is below $1B.  </p>\n\n<p>His positions closed and what they&#39;re worth currently  </p>\n\n<p>NCLH: Exit at 17.95. Current share price is 24.51  </p>\n\n<p>CHWY: Exit at 44.35. Current share price is 104.10  </p>\n\n<p>NCLH (again): Exit at 19.16. Current share price is 24.51  </p>\n\n<p>CRSR: Exit at 35.57. Current share price is 36.70  </p>\n\n<p>PTON: Exit at 109.46. Current share price is 163.60  </p>\n\n<p>GME: Exit at 15.96. Current share price is 20.26  </p>\n\n<p>*\\*Exits are estimations from his posts*  </p>\n\n<p>STIC: Posted DD when share price was around 14.25. Current share price is 17.85</p>\n</blockquote>\n\n<p><strong>Shout-outs</strong></p>\n\n<p>Some of ya&#39;ll are real gems. Major props to:</p>\n\n<ul>\n<li>My GME gang <a href=\"/u/Uberkikz11\">/u/Uberkikz11</a>, <a href=\"/u/Ackilles\">/u/Ackilles</a>, and of course the king <a href=\"/u/deepfuckingvalue\">/u/deepfuckingvalue</a> along with a few others like <a href=\"/u/CPTHubbard\">/u/CPTHubbard</a>, <a href=\"/u/OutrageousDesk\">/u/OutrageousDesk</a>, <a href=\"/u/Tomatotowers\">/u/Tomatotowers</a>, <a href=\"/u/Stonksflyingup\">/u/Stonksflyingup</a>, <a href=\"/u/sneakersourcerer\">/u/sneakersourcerer</a>, <a href=\"/u/Midaswhale30\">/u/Midaswhale30</a>, <a href=\"/u/Jeffamazon\">/u/Jeffamazon</a>, <a href=\"/u/DrZaius0\">/u/DrZaius0</a> for the amazing DD, memes, and brotherhood</li>\n<li><a href=\"/u/alifeofataraxia\">/u/alifeofataraxia</a> for his YouTube videos chronicling the tale of SIR JACK A LOT - <a href=\"https://www.youtube.com/watch?v=yW4Fr39n_uM\">Part 1</a>, <a href=\"https://www.youtube.com/watch?v=MKfjMHmqkzo\">Part 2</a>, <a href=\"https://www.youtube.com/watch?v=UP8fRTEIFpI\">Part 3</a></li>\n<li><a href=\"/u/GrowerNotAShower11\">/u/GrowerNotAShower11</a> for his erotic fan-fiction. I need one written about Cramer succumbing ahegao-style to the awe of my portfolio gains and massive dong STAT</li>\n<li>Many other loyal fans who helped me get unbanned yesterday, thank you</li>\n</ul>\n\n<p><strong>Fuck You Haters</strong></p>\n\n<p>Last week we got <a href=\"/u/durado\">/u/durado</a> so cucked he deleted his account and now <a href=\"/u/kingobama123\">/u/kingobama123</a> is all up on my ass. First, read this magnum dong opus and if you have more questions, ask it in the comments, I&#39;ll cum all over you.</p>\n\n<p><strong>POLL</strong></p>\n\n<p>To really drive home the value I bring to WSB, let&#39;s see how many peoples&#39; lives I&#39;ve changed and for the better or worse. Take this poll regarding whether I helped make you gain or lose money if you&#39;ve been following.</p>\n\n<p><a href=\"https://www.strawpoll.me/42341589\">https://www.strawpoll.me/42341589</a></p>\n\n<p><strong>🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄</strong></p>\n\n<p><strong>🎄🚀🎄🚀Merry Fucking Christmas 🚀🎄🚀</strong></p>\n\n<p><strong>🚀🎄Jerome Powell bless us, every one!🚀🎄</strong></p>\n\n<p><strong>🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀🎄🚀</strong></p>\n\n<p><a href=\"https://preview.redd.it/ykuygl8i3c761.jpg?width=2048&amp;format=pjpg&amp;auto=webp&amp;s=a2f40d1186b3c99c15cf1a0584ff41428326cb84\">My usual order is the 13-piece tenders - whopping 1780 calories in a single sitting</a></p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?auto=webp&s=4c76d0beedd0e4216ecff41f5466b6ef13374066", "width": 1200, "height": 1200}, "resolutions": [{"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=108&crop=smart&auto=webp&s=369a24a41c6c70abe00d31d52af4a879e45ab627", "width": 108, "height": 108}, {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=216&crop=smart&auto=webp&s=cb9ff949b8b81d9aca698970cd95ac7fe2ae516c", "width": 216, "height": 216}, {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=320&crop=smart&auto=webp&s=70e5fa2a58c49ceaad60bbc6d37a694c5c84e7dd", "width": 320, "height": 320}, {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=640&crop=smart&auto=webp&s=4fcdb1997b397f852727866ccc096f7b97993887", "width": 640, "height": 640}, {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=960&crop=smart&auto=webp&s=f548f8e7fc95f90aadf15bb61f5f7c589f9e0125", "width": 960, "height": 960}, {"url": "https://external-preview.redd.it/_MuOfS8wAAiMcFOBXrtD7tMKPJZBLQrQoWYMgGh_szQ.jpg?width=1080&crop=smart&auto=webp&s=8b79930ffee36df5a7cc5d4f8a440c50c403f7df", "width": 1080, "height": 1080}], "variants": {}, "id": "RhKj0Dn0cfeZmsQ-03M_2DiQPDk0DIoqAhOwMu1vVHE"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 75, "id": "award_92cb6518-a71a-4217-9f8f-7ecbd7ab12ba", "penny_donate": 0, "award_sub_type": "PREMIUM", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/Christmas_tme_animated_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Add my power to yours.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Take My Power", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png?width=16&height=16&auto=webp&s=14d5429e1f630eaba283d73cb4890c861859b645", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png?width=32&height=32&auto=webp&s=397444282c113a335f31da0c1d38a1e8cec75f05", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png?width=48&height=48&auto=webp&s=9897e3f134eb759aba6b7afecb5fb2c75bbf9dc9", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png?width=64&height=64&auto=webp&s=2de1c239b9226cfebdfbee28fba56bc534dc87b6", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png?width=128&height=128&auto=webp&s=7e08340ce7c4bc4b865820ed418734396b32b814", "width": 128, "height": 128}], "icon_format": "APNG", "icon_height": 512, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/qpi61q5o98361_TakeMyPowerElf.png"}, {"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 30, "id": "award_b4ff447e-05a5-42dc-9002-63568807cfe6", "penny_donate": null, "award_sub_type": "PREMIUM", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "A glowing commendation for all to see", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "All-Seeing Upvote", "resized_static_icons": [{"url": "https://external-preview.redd.it?width=16&height=16&auto=webp&s=d88c9a453f8ac38850b7a8241cfe5804b7b4905d", "width": 16, "height": 16}, {"url": "https://external-preview.redd.it?width=32&height=32&auto=webp&s=96a25019eb75878bdec4f6c012540f3baffbb1b2", "width": 32, "height": 32}, {"url": "https://external-preview.redd.it?width=48&height=48&auto=webp&s=1a51d27d75afde3fbde8bba84f9338f511211461", "width": 48, "height": 48}, {"url": "https://external-preview.redd.it?width=64&height=64&auto=webp&s=96af5ec460b05669ed60224cb0619bb8884abe27", "width": 64, "height": 64}, {"url": "https://external-preview.redd.it?width=128&height=128&auto=webp&s=2d3e648ed2302e6258673051ca5291f57beb29d4", "width": 128, "height": 128}], "icon_format": "APNG", "icon_height": 2048, "penny_price": null, "award_type": "global", "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/Illuminati_512.png"}, {"giver_coin_reward": null, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 100, "id": "gid_1", "penny_donate": null, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Shows the Silver Award... and that's it.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Silver", "resized_static_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/silver_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/silver_128.png", "width": 128, "height": 128}], "icon_format": null, "icon_height": 512, "penny_price": null, "award_type": "global", "static_icon_url": "https://www.redditstatic.com/gold/awards/icon/silver_512.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "f86d7f4a-4e9b-11e9-a6f9-0e03190c749e", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": "", "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#9e8d49", "id": "kjyzh7", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "SIR_JACK_A_LOT", "fullname": "t2_7ff3c"}, "discussion_type": null, "num_comments": 98, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": "", "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/", "subreddit_subscribers": 1741249, "created_utc": 1608902732.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 38, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzke8l", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "2019wassolastyear", "fullname": "t2_49gixwok"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kjyzh7", "score": 38, "author_fullname": "t2_49gixwok", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "So all in on PLTR?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>So all in on PLTR?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzke8l/", "num_reports": null, "locked": false, "name": "t1_ggzke8l", "created": 1608933180.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608904380.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzmein", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ADoIDo", "fullname": "t2_4ul03gp0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggzke8l", "score": 3, "author_fullname": "t2_4ul03gp0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "He's doing a re run on C R S R. One stonk at a time.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>He&#39;s doing a re run on C R S R. One stonk at a time.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzmein/", "num_reports": null, "locked": false, "name": "t1_ggzmein", "created": 1608935004.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608906204.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 21, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzkr0v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "WillingCommittee", "fullname": "t2_27xtsa"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kjyzh7", "score": 21, "author_fullname": "t2_27xtsa", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "This post really is making me change my trading philosophy. I make small option plays over a variety of stocks, and that is retarded. I will probably find 3 stocks that I really love and put 25k in each as that’s all I can afford. Easier to capitalize on big moves that way", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This post really is making me change my trading philosophy. I make small option plays over a variety of stocks, and that is retarded. I will probably find 3 stocks that I really love and put 25k in each as that’s all I can afford. Easier to capitalize on big moves that way</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzkr0v/", "num_reports": null, "locked": false, "name": "t1_ggzkr0v", "created": 1608933513.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608904713.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzlsxu", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Machin_Shins", "fullname": "t2_5szd1qba"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggzkr0v", "score": 7, "author_fullname": "t2_5szd1qba", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Sounds like the way. All in on a couple stocks that are researched to hell", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sounds like the way. All in on a couple stocks that are researched to hell</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzlsxu/", "num_reports": null, "locked": false, "name": "t1_ggzlsxu", "created": 1608934476.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608905676.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzmhjb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ADoIDo", "fullname": "t2_4ul03gp0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggzkr0v", "score": 4, "author_fullname": "t2_4ul03gp0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Much easier to track/trade 3-5 than it is to track 20. Would suggest looking at their charts as well and seeing if you like the way it moves.\n\nPersonally I'm trying to remove the gappers from my arsenal. Quite annoying when you missed a run that happened in the first 10 minutes since the market opened.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Much easier to track/trade 3-5 than it is to track 20. Would suggest looking at their charts as well and seeing if you like the way it moves.</p>\n\n<p>Personally I&#39;m trying to remove the gappers from my arsenal. Quite annoying when you missed a run that happened in the first 10 minutes since the market opened.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzmhjb/", "num_reports": null, "locked": false, "name": "t1_ggzmhjb", "created": 1608935077.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608906277.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 18, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzljms", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "slooots", "fullname": "t2_aqw9j"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kjyzh7", "score": 18, "author_fullname": "t2_aqw9j", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "why use lot word when few word do trick", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>why use lot word when few word do trick</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzljms/", "num_reports": null, "locked": false, "name": "t1_ggzljms", "created": 1608934242.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608905442.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kjyzh7", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggzlmsz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "SIR_JACK_A_LOT", "fullname": "t2_7ff3c"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggzljms", "score": 7, "author_fullname": "t2_7ff3c", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "🚀", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kjyzh7/a_sir_jack_a_lot_christmas_carol_my_magnum_dong/ggzlmsz/", "num_reports": null, "locked": false, "name": "t1_ggzlmsz", "created": 1608934321.0, "author_flair_text": "", "treatment_tags": [], "created_utc": 1608905521.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}