{"approved_at_utc": null, "selftext": "The ticker is **C.F.II**, merging with View Inc, a sleeping giant for close to 2 months. Many people do not realise this company is riding on the green energy wave which has rallied significantly over the past weeks. Now here's a deep dive into this company *(detailed DD but if you are lazy to read the research, I don't blame you, just head to the potential plays at the bottom).*\n\nSince merger was announced on 30 Nov 2020, and now that we are in Q1 of 2021 and approaching the merger date in roughly 2 months time, the share price has been steadily advancing. I think that the current share price of $12.6 still presents a rather good risk-return profile in the short term to enter, mainly riding on the green energy wave. I have presented 2 plays for this at the bottom of this DD.\n\nMost have downplayed this company due to its high valuation of $1.6B for just being a window company (non-EV) especially in a period where commercial real estate is taking a hit due to the pandemic. But I think precisely this is a good time to invest for the long term before the next boom. We might also have overlooked certain secular trends in motion that can provide some serious tailwind for this company. Now taking a deep dive into the company:\n\nThe Product\n\n>\"View is the market leader in next-generation smart windows that use artificial intelligence and machine learning which will tint the glass to optimize natural light while controlling heat and glare, effectively eliminating the need for blinds/shades in the room. The smart glass enhances mental and physical well-being for occupants, creating smart connected buildings which reduce energy consumption and greenhouse gas (GHG) emissions.\"\n\nBasically, they are the next-era windows maker for smart buildings. Think of your standard run-of-the-mill window glass panes. If you live in a tropical climate or countries with high sunlight hours, you would know that having a window seat in the noon is extremely uncomfortable and glaring. Even if the the blinds/shades were drawn down, the air-conditioning will still have to work extra hard to maintain the same room temp. By doing so, the building's energy consumption is higher = higher green house emission.\n\n[AI-enabled Window Glass Tinting \\(Tracking Sun's trajectory\\)](https://preview.redd.it/t7oy4nncrqa61.png?width=672&format=png&auto=webp&s=cfc229aaa0f6adb9e7570cb39b7f0eeda8d2c62c)\n\nWhat if you had a smart dynamic glass installed which will automatically tint the windows by tracking the Sun's trajectory? Aside from the glare protection from the tinting, the temperature in the room is also effectively maintained by blocking out solar heat, so the HVAC does not have to work overtime. What if this glass panel can also act as a transparent HD display for a suite of immersive work experiences?\n\nThe building window glass market is huge, having a $120 billion TAM in North America alone, and $1.2 trillion TAM in global glass consumption. Smart buildings are perhaps the key to the future of urban planning, due to the push for green innovation in smart cities that has gained momentum and will continue to do so under Biden's administration.\n\n**E.S.G/Green Wave**\n\nBiden administration clean energy plan to tackle climate change resulted in the rally of green/energy stocks recently. Tailwind can be expected from the green wave for View Inc. since their dynamic glass will help buildings attain **LEED certification** to become more energy efficient with the growing requirements from regulators in US and rising importance of E.S.G globally. View Inc. can help buildings reduce overall energy consumption and green house emission through **20% reduction in HVAC & lighting consumption, with 10% overall peak energy reduction**.\n\nAnalysis of Product\n\n**1) Suite of Services -** They are not just a smart windows maker, but essentially a tech play as well. They have launched their suite of services in 2020 to complement the Smart Glass, comprising:\n\n1. *View Net* \\- Provides bandwidth power and data network that is the backbone to an intelligent building platform\n2. *View Immersive Experience* \\- Transparent see-through HD display on the window that is fully interactive with touchscreen capabilities.\n3. *View Sense* \\- Modules that provide the ability to measure and optimise light, humidity, temperature, air quality that cater to the well-being of occupants inside the building.\n\n[Transparent HD Display with 5G Network](https://preview.redd.it/6j7ts22erqa61.png?width=1256&format=png&auto=webp&s=954bb8d49c7d1df39a9739f05f4c2211d05bdf39)\n\nWhat I like about the product is that its very modular and customisable. For the basic package you can just have the dynamic smart glass installed, with just the tinting capabilities. However, the infrastructure for other capabilities is already installed after the initial set up, which customers can choose to add on different modules (e.g. sensors/displays) and customise it based on their needs. This effectively sets up for repeat businesses.\n\n**2) Longevity** \\-You may be wondering about the longevity of their smart windows, since functionality will never be given due consideration if the product is shitty and fails to withstand the weather/time/pressure. If the smart windows are treated like consumables with the need to replace/maintain every few years, it will never be scalable. You may hear it from the CEO himself on how their team initially conceptualise the product and build it around a fundamental principle in mind - longevity. Therefore, the lifespan is similar to standard window glass with over **40-50 years of lifespan**.\n\nVideo: [https://www.youtube.com/watch?v=9MaF21GtUcg&ab\\_channel=GreenBiz](https://www.youtube.com/watch?v=9MaF21GtUcg&ab_channel=GreenBiz) (watch from 12:30 onwards)\n\n**3) Durability -** Another point about why View Inc. glass is more durable than than other dynamic smart windows is because they are using an **inorganic ceramic material** as the nano-coating layer instead of organic material, which is the current industry norm. Even though organic material is cheaper to engineer, resulting in a cheaper product for their end clients, but the coating will be degraded by the heat from the sun which will make it less durable over time.\n\n**4) Market share** \\- Currently, they are leading the market with over 80% market share. In terms of economic moat, they have over **1k patents** (600+ currently, 300+ filed). This is a proprietary tech and after 12 years of R&D, I think that they will be able to fairly sustain a huge competitive advantage over many other competitors, and effectively creating a high barrier to entry for new entrants due to the sheer amount of patents they possess.\n\n**5) Pricing & Revenue** \\- Current revenue as of 2020 stands at around $31m with over $560m in backlog orders (LOI signed). Although their dynamic window glasses cost upward of 50% more than standard window glasses, I think it's a highly differentiated product in which building owners can eventually charge a premium on rental leases = resulting in higher leasing revenues for them. One success case story is Civica Cherry Creek, an office building in Denver has managed to achieve the highest weighted average rental rates out of any office buildings in Denver city after switching to View's glass.\n\nOf course, I anticipate a huge inertia in the beginning where the mass market will put up resistance to adopt this product. However, overtime, combining the economies of scale in their factories to bring down production costs (higher gross margins) and rising demand globally arising from a proven track record, I can foresee exponential growth for this company in the long term. They are expecting revenue growths to be around 127% CAGR over the next 5 years, which I personally think it's possible but the exponential growth will not happen till 2023 onwards, since they need the initial two years for market entry into more markets/sectors.\n\n6) **Investors** \\- Early prominent VC funding include Corning and Softbank. However, I wish to point out that in recent SEC filings, **GIC Investment** (*Singapore state-owned sovereign fund, owned by the Government of Singapore*) initiated a 10% stake of $50 million in C.F.II last week, and an **additional $200 million PIPE investment today**. Let me tell you why I'm so bullish about this. Singapore is a highly developed and urbanised country located in South-east Asia with a myriad of high-rise buildings/skyscrapers, tropical climate with plenty of sun activity all year round. Although N.A market is huge, but usually buildings in states with most sunlight activity e.g. California/Arizona will constitute the main bulk of customers. Let's imagine if the product is able to break into the Asia market, or even into South-east Asia with tropical climate zones, the revenues would be insane. GIC obviously conducted their DD as they won't screw around with state-owned money. They know the growth potential of this proprietary tech once this hits the market big time, and perhaps even a business arrangement to bring this product into Singapore? Other players will likely not stand a chance, with the exception of China.\n\n7) **Ability to scale**:\n\n* Current projects are only in the commercial space which has taken a huge hit due to the pandemic. With the ongoing trend in WFH, the residential market is essentially a cash cow for milking, especially against the backdrop of demand for healthy home working environment. In light of this, the CEO said in an interview that he has **already completed 50 residential projects**(this wasn't published as it's still in the works) and he is developing a product for residential market **this year** to target contemporary homes. LINK: [https://lookingbeyondwithmichaelsikand.fireside.fm/view](https://lookingbeyondwithmichaelsikand.fireside.fm/view) (from 10:45 onwards). The convergence of WFH trend and smart homes will definitely be a huge play, even more so than commercial. Does it reminds you of Netflix's Black Mirror? Transparent displays are certainly a sight to behold.\n\n[Touchscreen Capabilities](https://preview.redd.it/8hpryx7frqa61.png?width=1240&format=png&auto=webp&s=14ba9afda332f5311a24744efd9376d8d5291043)\n\n* Given the ubiquitous applications with glass, possibilities are not limited to just smart buildings. In fact, one really strong partnership with great potential would be to license the proprietary tech to EV car makers. **Incredible synergy can be found in the future of electric vehicle glass display**, where car window panels can function as a smart display with vehicle integration + auto tinting capabilities. In fact, the **entire transportation industry** could be disrupted by this tech, think of your Buses/Rails/Subway/Cruises and how smart glass display could reinvent the future of Advertisements in commercial transportation, and how fast would they jump on this bandwagon if they are able to monetise this new piece of glass.\n* Other uses across different sectors include the **hospitality industry** (airports, hotels, resorts) and **healthcare sector**, like hospital wards windows.\n\nFYI, they have piloted their product in 3 different US airports, namely SFO, Dallas/Fort Worth, and Boston airports. After retrofitting their Smart Glass in the airports, results were rather stellar with an actual increase in concessionary sales, energy cost savings, as well as longer dwell time in such areas.\n\nCase study for DFO airport: [https://view.com/sites/default/files/documents/dfw-airport-dynamic-glass-pilot-research-study\\_0.pdf](https://view.com/sites/default/files/documents/dfw-airport-dynamic-glass-pilot-research-study_0.pdf)\n\n**Bear Case/Downsides**\n\n* Glassdoor rating of company seems poor with management woes at the executive level, and there were reports of View Inc laying off their staff sometime in April 2020. I think that internal turmoil would be detrimental and could impede their growth in the future.\n* Current earnings of $31m in 2020 does not really justify the valuation of $1.6b (much speculation is on future growth potential).\n* They have a current minimum order of $1M, which will not sit well with smaller commercial buildings or residential market. This will result in them losing market share gradually to their smaller competitors who can cater to such clientele.\n* The biggest risk to their Intellectual Property is that it is not universal i.e. it does not have an international protection. Patents are territory rights, so even though their tech is protected in US, I expect proliferation of copy cats in other countries like \\*coughs\\* China. They may register for IP in China as well, but let's face it, its not exactly fool-proof and Chinese companies operate differently in China. Although there will be imitations, but I believe that View's level of R&D is extremely strong after 12 years in operation. Other copy-cat Smart Glass companies would unlikely be able to achieve the same level of product as View, thus ensuring levels of product differentiation.\n\n**The Play**\n\nWith the merger expected to complete by Q1 of 2021 (2 months time), I expect C.F.II to pop closer to merger date during March, perhaps in the $15-$16 range. But once it reaches ATH right before merger, it will probably be a good time to sell, as once post-merger happens and downside cap is removed, it will most likely fall below $10 or even lower as the industry is very CAPEX- intensive. In addition, I think that the commercial space is likely to remain sluggish in the near term, which will push the price further down. It will also likely burn more cash in the process, since you have to bear in mind that any new futuristic tech adoption is an extremely long and arduous process.\n\nRevolutionary tech like iPhones/Tesla did not pick up from the get-go after it was introduced to the market, and it took several years before they saw some real results. This is probably a good time to accumulate your positions while its being massively hated on, and believe in the conviction that 1) they are the market leader with a wide economic moat, >1k patents and ability to scale up while bringing down costs. 2) secular E.S.G trend with Biden's green plan will provide good tailwind for the sector at least for the next 4+ years, in which their policies will likely benefit the industry. 3) multiple uses applications are HUGE with amazing potential for licensing/partnership plays in EV/hospitality/healthcare sectors. I have strong conviction in the long term that it is going to be a multi-bagger if you keep accumulating the dips post-merger.\n\n**TLDR**: In short, buy now for the pre-merger pop and sell right before merger. Following a post-merger sell-off, accumulate on the dip and ride on for the long term in the next few years.\n\n*Positions: Warrants @ $2.4*\n\nLink to investor presentation: [https://view.com/sites/default/files/documents/View-Investor-Presentation-High.pdf](https://view.com/sites/default/files/documents/View-Investor-Presentation-High.pdf)", "author_fullname": "t2_8semodhu", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Futuristic Smart Glass Company DD - View Inc 🚀🚀🚀 (Black Mirror Potential)", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 105, "top_awarded_type": null, "hide_score": true, "media_metadata": {"8hpryx7frqa61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 56, "x": 108, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=108&crop=smart&auto=webp&s=bb4ab1f3847bd3190e1b3117928e980dcaf6d384"}, {"y": 113, "x": 216, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=216&crop=smart&auto=webp&s=16baaaf8eda79ea3ef2de26746689dcb10b6a605"}, {"y": 168, "x": 320, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=320&crop=smart&auto=webp&s=26b41563dc8962b3b5dadaf6a549fe00e67d7586"}, {"y": 336, "x": 640, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=640&crop=smart&auto=webp&s=a801b0299a4026c0bc3486d0e947c813ba4dc64b"}, {"y": 504, "x": 960, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=960&crop=smart&auto=webp&s=6498cf4b3be54b0a048f0741a344158a6f09bb5b"}, {"y": 567, "x": 1080, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=1080&crop=smart&auto=webp&s=782f415f39a1777f5a702b7e4960ad65e5b860ed"}], "s": {"y": 652, "x": 1240, "u": "https://preview.redd.it/8hpryx7frqa61.png?width=1240&format=png&auto=webp&s=14ba9afda332f5311a24744efd9376d8d5291043"}, "id": "8hpryx7frqa61"}, "6j7ts22erqa61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 56, "x": 108, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=108&crop=smart&auto=webp&s=e3dc5f60e6a09b471fed59421e8218922cf5ee4a"}, {"y": 112, "x": 216, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=216&crop=smart&auto=webp&s=292aaa27ab9bab80ac63ffc43c24d48d35324d19"}, {"y": 166, "x": 320, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=320&crop=smart&auto=webp&s=3d7c63d47c177a2a4f158f1250a8c214e5c87bab"}, {"y": 332, "x": 640, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=640&crop=smart&auto=webp&s=376bf5d50fa9e9e4c983b6d5088b302fdf7a2df9"}, {"y": 499, "x": 960, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=960&crop=smart&auto=webp&s=d6a85b9c1ffafea86b8861a004cb7ece15d55f2a"}, {"y": 561, "x": 1080, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=1080&crop=smart&auto=webp&s=26cfe7aacf5cd01089eb47bb46f329bec47f59b6"}], "s": {"y": 653, "x": 1256, "u": "https://preview.redd.it/6j7ts22erqa61.png?width=1256&format=png&auto=webp&s=954bb8d49c7d1df39a9739f05f4c2211d05bdf39"}, "id": "6j7ts22erqa61"}, "t7oy4nncrqa61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 69, "x": 108, "u": "https://preview.redd.it/t7oy4nncrqa61.png?width=108&crop=smart&auto=webp&s=1035644d9f935521af518e96968f93808594b997"}, {"y": 138, "x": 216, "u": "https://preview.redd.it/t7oy4nncrqa61.png?width=216&crop=smart&auto=webp&s=73b7755b05957c984f291e2507bd99182a1cd8b3"}, {"y": 204, "x": 320, "u": "https://preview.redd.it/t7oy4nncrqa61.png?width=320&crop=smart&auto=webp&s=b80c4d56673cb3c509bc8197c25094488bba21c3"}, {"y": 409, "x": 640, "u": "https://preview.redd.it/t7oy4nncrqa61.png?width=640&crop=smart&auto=webp&s=8eabc9331f4f3f97bcb81c2c2e744a177fa44beb"}], "s": {"y": 430, "x": 672, "u": "https://preview.redd.it/t7oy4nncrqa61.png?width=672&format=png&auto=webp&s=cfc229aaa0f6adb9e7570cb39b7f0eeda8d2c62c"}, "id": "t7oy4nncrqa61"}}, "name": "t3_kv7w9p", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 5, "total_awards_received": 0, "media_embed": {"content": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9MaF21GtUcg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "width": 356, "scrolling": false, "height": 200}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "VERGE Talk: How Do You Build a \"Complete\" Product? Rao Mulpuri, CEO, View | Dynamic Glass", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9MaF21GtUcg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "author_name": "GreenBiz", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/9MaF21GtUcg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/greenbiz"}}, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {"content": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9MaF21GtUcg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "width": 356, "scrolling": false, "media_domain_url": "https://www.redditmedia.com/mediaembed/kv7w9p", "height": 200}, "link_flair_text": "DD", "can_mod_post": false, "score": 5, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/WI7bzrvNg7PFlVp-nuM2o--zGM3t5YLJQKiIhPzonJQ.jpg", "edited": 1610387823.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1610416411.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>The ticker is <strong>C.F.II</strong>, merging with View Inc, a sleeping giant for close to 2 months. Many people do not realise this company is riding on the green energy wave which has rallied significantly over the past weeks. Now here&#39;s a deep dive into this company <em>(detailed DD but if you are lazy to read the research, I don&#39;t blame you, just head to the potential plays at the bottom).</em></p>\n\n<p>Since merger was announced on 30 Nov 2020, and now that we are in Q1 of 2021 and approaching the merger date in roughly 2 months time, the share price has been steadily advancing. I think that the current share price of $12.6 still presents a rather good risk-return profile in the short term to enter, mainly riding on the green energy wave. I have presented 2 plays for this at the bottom of this DD.</p>\n\n<p>Most have downplayed this company due to its high valuation of $1.6B for just being a window company (non-EV) especially in a period where commercial real estate is taking a hit due to the pandemic. But I think precisely this is a good time to invest for the long term before the next boom. We might also have overlooked certain secular trends in motion that can provide some serious tailwind for this company. Now taking a deep dive into the company:</p>\n\n<p>The Product</p>\n\n<blockquote>\n<p>&quot;View is the market leader in next-generation smart windows that use artificial intelligence and machine learning which will tint the glass to optimize natural light while controlling heat and glare, effectively eliminating the need for blinds/shades in the room. The smart glass enhances mental and physical well-being for occupants, creating smart connected buildings which reduce energy consumption and greenhouse gas (GHG) emissions.&quot;</p>\n</blockquote>\n\n<p>Basically, they are the next-era windows maker for smart buildings. Think of your standard run-of-the-mill window glass panes. If you live in a tropical climate or countries with high sunlight hours, you would know that having a window seat in the noon is extremely uncomfortable and glaring. Even if the the blinds/shades were drawn down, the air-conditioning will still have to work extra hard to maintain the same room temp. By doing so, the building&#39;s energy consumption is higher = higher green house emission.</p>\n\n<p><a href=\"https://preview.redd.it/t7oy4nncrqa61.png?width=672&amp;format=png&amp;auto=webp&amp;s=cfc229aaa0f6adb9e7570cb39b7f0eeda8d2c62c\">AI-enabled Window Glass Tinting (Tracking Sun&#39;s trajectory)</a></p>\n\n<p>What if you had a smart dynamic glass installed which will automatically tint the windows by tracking the Sun&#39;s trajectory? Aside from the glare protection from the tinting, the temperature in the room is also effectively maintained by blocking out solar heat, so the HVAC does not have to work overtime. What if this glass panel can also act as a transparent HD display for a suite of immersive work experiences?</p>\n\n<p>The building window glass market is huge, having a $120 billion TAM in North America alone, and $1.2 trillion TAM in global glass consumption. Smart buildings are perhaps the key to the future of urban planning, due to the push for green innovation in smart cities that has gained momentum and will continue to do so under Biden&#39;s administration.</p>\n\n<p><strong>E.S.G/Green Wave</strong></p>\n\n<p>Biden administration clean energy plan to tackle climate change resulted in the rally of green/energy stocks recently. Tailwind can be expected from the green wave for View Inc. since their dynamic glass will help buildings attain <strong>LEED certification</strong> to become more energy efficient with the growing requirements from regulators in US and rising importance of E.S.G globally. View Inc. can help buildings reduce overall energy consumption and green house emission through <strong>20% reduction in HVAC &amp; lighting consumption, with 10% overall peak energy reduction</strong>.</p>\n\n<p>Analysis of Product</p>\n\n<p><strong>1) Suite of Services -</strong> They are not just a smart windows maker, but essentially a tech play as well. They have launched their suite of services in 2020 to complement the Smart Glass, comprising:</p>\n\n<ol>\n<li><em>View Net</em> - Provides bandwidth power and data network that is the backbone to an intelligent building platform</li>\n<li><em>View Immersive Experience</em> - Transparent see-through HD display on the window that is fully interactive with touchscreen capabilities.</li>\n<li><em>View Sense</em> - Modules that provide the ability to measure and optimise light, humidity, temperature, air quality that cater to the well-being of occupants inside the building.</li>\n</ol>\n\n<p><a href=\"https://preview.redd.it/6j7ts22erqa61.png?width=1256&amp;format=png&amp;auto=webp&amp;s=954bb8d49c7d1df39a9739f05f4c2211d05bdf39\">Transparent HD Display with 5G Network</a></p>\n\n<p>What I like about the product is that its very modular and customisable. For the basic package you can just have the dynamic smart glass installed, with just the tinting capabilities. However, the infrastructure for other capabilities is already installed after the initial set up, which customers can choose to add on different modules (e.g. sensors/displays) and customise it based on their needs. This effectively sets up for repeat businesses.</p>\n\n<p><strong>2) Longevity</strong> -You may be wondering about the longevity of their smart windows, since functionality will never be given due consideration if the product is shitty and fails to withstand the weather/time/pressure. If the smart windows are treated like consumables with the need to replace/maintain every few years, it will never be scalable. You may hear it from the CEO himself on how their team initially conceptualise the product and build it around a fundamental principle in mind - longevity. Therefore, the lifespan is similar to standard window glass with over <strong>40-50 years of lifespan</strong>.</p>\n\n<p>Video: <a href=\"https://www.youtube.com/watch?v=9MaF21GtUcg&amp;ab_channel=GreenBiz\">https://www.youtube.com/watch?v=9MaF21GtUcg&amp;ab_channel=GreenBiz</a> (watch from 12:30 onwards)</p>\n\n<p><strong>3) Durability -</strong> Another point about why View Inc. glass is more durable than than other dynamic smart windows is because they are using an <strong>inorganic ceramic material</strong> as the nano-coating layer instead of organic material, which is the current industry norm. Even though organic material is cheaper to engineer, resulting in a cheaper product for their end clients, but the coating will be degraded by the heat from the sun which will make it less durable over time.</p>\n\n<p><strong>4) Market share</strong> - Currently, they are leading the market with over 80% market share. In terms of economic moat, they have over <strong>1k patents</strong> (600+ currently, 300+ filed). This is a proprietary tech and after 12 years of R&amp;D, I think that they will be able to fairly sustain a huge competitive advantage over many other competitors, and effectively creating a high barrier to entry for new entrants due to the sheer amount of patents they possess.</p>\n\n<p><strong>5) Pricing &amp; Revenue</strong> - Current revenue as of 2020 stands at around $31m with over $560m in backlog orders (LOI signed). Although their dynamic window glasses cost upward of 50% more than standard window glasses, I think it&#39;s a highly differentiated product in which building owners can eventually charge a premium on rental leases = resulting in higher leasing revenues for them. One success case story is Civica Cherry Creek, an office building in Denver has managed to achieve the highest weighted average rental rates out of any office buildings in Denver city after switching to View&#39;s glass.</p>\n\n<p>Of course, I anticipate a huge inertia in the beginning where the mass market will put up resistance to adopt this product. However, overtime, combining the economies of scale in their factories to bring down production costs (higher gross margins) and rising demand globally arising from a proven track record, I can foresee exponential growth for this company in the long term. They are expecting revenue growths to be around 127% CAGR over the next 5 years, which I personally think it&#39;s possible but the exponential growth will not happen till 2023 onwards, since they need the initial two years for market entry into more markets/sectors.</p>\n\n<p>6) <strong>Investors</strong> - Early prominent VC funding include Corning and Softbank. However, I wish to point out that in recent SEC filings, <strong>GIC Investment</strong> (<em>Singapore state-owned sovereign fund, owned by the Government of Singapore</em>) initiated a 10% stake of $50 million in C.F.II last week, and an <strong>additional $200 million PIPE investment today</strong>. Let me tell you why I&#39;m so bullish about this. Singapore is a highly developed and urbanised country located in South-east Asia with a myriad of high-rise buildings/skyscrapers, tropical climate with plenty of sun activity all year round. Although N.A market is huge, but usually buildings in states with most sunlight activity e.g. California/Arizona will constitute the main bulk of customers. Let&#39;s imagine if the product is able to break into the Asia market, or even into South-east Asia with tropical climate zones, the revenues would be insane. GIC obviously conducted their DD as they won&#39;t screw around with state-owned money. They know the growth potential of this proprietary tech once this hits the market big time, and perhaps even a business arrangement to bring this product into Singapore? Other players will likely not stand a chance, with the exception of China.</p>\n\n<p>7) <strong>Ability to scale</strong>:</p>\n\n<ul>\n<li>Current projects are only in the commercial space which has taken a huge hit due to the pandemic. With the ongoing trend in WFH, the residential market is essentially a cash cow for milking, especially against the backdrop of demand for healthy home working environment. In light of this, the CEO said in an interview that he has <strong>already completed 50 residential projects</strong>(this wasn&#39;t published as it&#39;s still in the works) and he is developing a product for residential market <strong>this year</strong> to target contemporary homes. LINK: <a href=\"https://lookingbeyondwithmichaelsikand.fireside.fm/view\">https://lookingbeyondwithmichaelsikand.fireside.fm/view</a> (from 10:45 onwards). The convergence of WFH trend and smart homes will definitely be a huge play, even more so than commercial. Does it reminds you of Netflix&#39;s Black Mirror? Transparent displays are certainly a sight to behold.</li>\n</ul>\n\n<p><a href=\"https://preview.redd.it/8hpryx7frqa61.png?width=1240&amp;format=png&amp;auto=webp&amp;s=14ba9afda332f5311a24744efd9376d8d5291043\">Touchscreen Capabilities</a></p>\n\n<ul>\n<li>Given the ubiquitous applications with glass, possibilities are not limited to just smart buildings. In fact, one really strong partnership with great potential would be to license the proprietary tech to EV car makers. <strong>Incredible synergy can be found in the future of electric vehicle glass display</strong>, where car window panels can function as a smart display with vehicle integration + auto tinting capabilities. In fact, the <strong>entire transportation industry</strong> could be disrupted by this tech, think of your Buses/Rails/Subway/Cruises and how smart glass display could reinvent the future of Advertisements in commercial transportation, and how fast would they jump on this bandwagon if they are able to monetise this new piece of glass.</li>\n<li>Other uses across different sectors include the <strong>hospitality industry</strong> (airports, hotels, resorts) and <strong>healthcare sector</strong>, like hospital wards windows.</li>\n</ul>\n\n<p>FYI, they have piloted their product in 3 different US airports, namely SFO, Dallas/Fort Worth, and Boston airports. After retrofitting their Smart Glass in the airports, results were rather stellar with an actual increase in concessionary sales, energy cost savings, as well as longer dwell time in such areas.</p>\n\n<p>Case study for DFO airport: <a href=\"https://view.com/sites/default/files/documents/dfw-airport-dynamic-glass-pilot-research-study_0.pdf\">https://view.com/sites/default/files/documents/dfw-airport-dynamic-glass-pilot-research-study_0.pdf</a></p>\n\n<p><strong>Bear Case/Downsides</strong></p>\n\n<ul>\n<li>Glassdoor rating of company seems poor with management woes at the executive level, and there were reports of View Inc laying off their staff sometime in April 2020. I think that internal turmoil would be detrimental and could impede their growth in the future.</li>\n<li>Current earnings of $31m in 2020 does not really justify the valuation of $1.6b (much speculation is on future growth potential).</li>\n<li>They have a current minimum order of $1M, which will not sit well with smaller commercial buildings or residential market. This will result in them losing market share gradually to their smaller competitors who can cater to such clientele.</li>\n<li>The biggest risk to their Intellectual Property is that it is not universal i.e. it does not have an international protection. Patents are territory rights, so even though their tech is protected in US, I expect proliferation of copy cats in other countries like *coughs* China. They may register for IP in China as well, but let&#39;s face it, its not exactly fool-proof and Chinese companies operate differently in China. Although there will be imitations, but I believe that View&#39;s level of R&amp;D is extremely strong after 12 years in operation. Other copy-cat Smart Glass companies would unlikely be able to achieve the same level of product as View, thus ensuring levels of product differentiation.</li>\n</ul>\n\n<p><strong>The Play</strong></p>\n\n<p>With the merger expected to complete by Q1 of 2021 (2 months time), I expect C.F.II to pop closer to merger date during March, perhaps in the $15-$16 range. But once it reaches ATH right before merger, it will probably be a good time to sell, as once post-merger happens and downside cap is removed, it will most likely fall below $10 or even lower as the industry is very CAPEX- intensive. In addition, I think that the commercial space is likely to remain sluggish in the near term, which will push the price further down. It will also likely burn more cash in the process, since you have to bear in mind that any new futuristic tech adoption is an extremely long and arduous process.</p>\n\n<p>Revolutionary tech like iPhones/Tesla did not pick up from the get-go after it was introduced to the market, and it took several years before they saw some real results. This is probably a good time to accumulate your positions while its being massively hated on, and believe in the conviction that 1) they are the market leader with a wide economic moat, &gt;1k patents and ability to scale up while bringing down costs. 2) secular E.S.G trend with Biden&#39;s green plan will provide good tailwind for the sector at least for the next 4+ years, in which their policies will likely benefit the industry. 3) multiple uses applications are HUGE with amazing potential for licensing/partnership plays in EV/hospitality/healthcare sectors. I have strong conviction in the long term that it is going to be a multi-bagger if you keep accumulating the dips post-merger.</p>\n\n<p><strong>TLDR</strong>: In short, buy now for the pre-merger pop and sell right before merger. Following a post-merger sell-off, accumulate on the dip and ride on for the long term in the next few years.</p>\n\n<p><em>Positions: Warrants @ $2.4</em></p>\n\n<p>Link to investor presentation: <a href=\"https://view.com/sites/default/files/documents/View-Investor-Presentation-High.pdf\">https://view.com/sites/default/files/documents/View-Investor-Presentation-High.pdf</a></p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/0OfimIeoMpV9mdJMM3q8R2QG-nWjMtmMVXs5YrBO2NQ.jpg?auto=webp&s=6c753792e7916edfe0e18d4bdfbc5861fdf331ef", "width": 480, "height": 360}, "resolutions": [{"url": "https://external-preview.redd.it/0OfimIeoMpV9mdJMM3q8R2QG-nWjMtmMVXs5YrBO2NQ.jpg?width=108&crop=smart&auto=webp&s=7c657cb77a34d04456c27812649b8e9f35ab0dee", "width": 108, "height": 81}, {"url": "https://external-preview.redd.it/0OfimIeoMpV9mdJMM3q8R2QG-nWjMtmMVXs5YrBO2NQ.jpg?width=216&crop=smart&auto=webp&s=4dbed57309037dd03bf27268afdabacc4bc4f7e0", "width": 216, "height": 162}, {"url": "https://external-preview.redd.it/0OfimIeoMpV9mdJMM3q8R2QG-nWjMtmMVXs5YrBO2NQ.jpg?width=320&crop=smart&auto=webp&s=8a58cb9eae2d2ec0b374ecd0b38b3f962792a816", "width": 320, "height": 240}], "variants": {}, "id": "ubxEXIalqyitD6QuCqBKa_ElCEGVCt3DW1Fg5nxe-W8"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kv7w9p", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "Aggressivestonk", "fullname": "t2_8semodhu"}, "discussion_type": null, "num_comments": 1, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kv7w9p/futuristic_smart_glass_company_dd_view_inc_black/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kv7w9p/futuristic_smart_glass_company_dd_view_inc_black/", "subreddit_subscribers": 1803626, "created_utc": 1610387611.0, "num_crossposts": 0, "media": {"type": "youtube.com", "oembed": {"provider_url": "https://www.youtube.com/", "version": "1.0", "title": "VERGE Talk: How Do You Build a \"Complete\" Product? Rao Mulpuri, CEO, View | Dynamic Glass", "type": "video", "thumbnail_width": 480, "height": 200, "width": 356, "html": "<iframe width=\"356\" height=\"200\" src=\"https://www.youtube.com/embed/9MaF21GtUcg?feature=oembed&enablejsapi=1\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>", "author_name": "GreenBiz", "provider_name": "YouTube", "thumbnail_url": "https://i.ytimg.com/vi/9MaF21GtUcg/hqdefault.jpg", "thumbnail_height": 360, "author_url": "https://www.youtube.com/user/greenbiz"}}, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kv7w9p", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "giwodvt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Rocketpod_", "fullname": "t2_69hmurj0"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kv7w9p", "score": 2, "author_fullname": "t2_69hmurj0", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "This is actually so cool I want to buy a window", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This is actually so cool I want to buy a window</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kv7w9p/futuristic_smart_glass_company_dd_view_inc_black/giwodvt/", "num_reports": null, "locked": false, "name": "t1_giwodvt", "created": 1610416649.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610387849.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}