{"approved_at_utc": null, "selftext": ">[Oh and uh short burn of the century comin soon. Flamethrowers should arrive just in time.](https://twitter.com/elonmusk/status/992388944774938626)\n\n-Elon Musk\n\nOh Elon, sorry to steal your thunder. But GME will make TSLA vol look like TLT. Jeff haunting your every accomplishment yet again.\n\n-----\n\nI’m back with the final warning bell. The next time I post in 2021 will be to recap the squeeze’s results and post gain porn along with u/Deep_Fucking_Value, u/SIR_JACK_A_LOT, u/Tomatotowers, and more. *This is the last stop before the moon mission.*\n\nIt’s currently not too late. But after Q3 earnings on Dec 8th, it will be.\n\nHere’s a comprehensive GME overview for all new and returning WSB-monkeys. Sit down and grab some tea. This is a long one unlike the previous posts.\n\n**GME Overview:**\n\nThe GME story can be broken up into 2 main theses. The first is a deep value play which has credibility all on its own. The second is an infinity short squeeze like we’ve never seen before in history, which has credibility all on its own. When combining the two, you get the trade of a lifetime. \n\nIn all my (albeit limited) days, I have never EVER seen a trade set up like this before. I’ve pored over every source of historical finance material I can get my hands on, and still have nothing to reference to. IMO, this will look more like the 2008-MBS bet, or the Ackman 2020-COVID “Hell is coming” bet, than TSLA, OSTK, KBIO, or VW.\n\nJust a fucking face-ripping, out-of-nowhere, legendary-HOF-ticker bet that will bankrupt some funds and get people fired - and of course, with no community other than WSB’s name next to it in the history books (and if I could pencil in our lovely GME discord hosted by u/BadElf21 and u/RoaringKitty’s YT stream).\n\nLet’s begin.\n\n**Act 1 - The Set Up:**\n\nQ: Why is GME so heavily shorted in the first place? Why are we betting the long? Aren’t they going bankrupt ala Blockbuster? If not, are we just trading this short term like a HTZ/CCL meme stonk?\n\nA: NO. This is a fundamentally solid deep value play at its core.\n\nFirst let’s go back a few years. We must give the shorts due credit in order to understand where we are now. GME has been profitably shorted since 2013 when the market correctly bet on the digitization of video games and spread of mobile gaming. Some data here:\n\n* GME sales have plunged from $9.5 billion in fiscal year 2011 to $6.4 billion in fiscal year 2019.\n\n* GME Annual EBITDA has dropped from $839 million in fiscal year 2011 (before the last console cycle) to only $111 million in fiscal year 2019.\n\n* Net income has fallen off a cliff from $339 million in fiscal year 2011 to a staggering loss of $470 million in fiscal year 2019.\n\n* In the two most recent quarters alone, GME lost another $277 million.\n\nThe shorts are betting on $0. \n\nHowever, in the last 12 months, GME has shown that their terminal velocity does not lead to bankruptcy. GME has a strong balance sheet. [Cash on hand is worth over $12 a share. Net cash is worth over $5 a share](https://seekingalpha.com/article/4378623-gamestop-revenue-sharing-agreement-microsoft-shifts-sentiment) and is FCF positive (nixing the bankruptcy thesis). They also paid off $125M in debt last month just to show Moody’s they are healthy due to their incoming console cycle FCF (which may lead to possible bond upgrade, enticing more institutional investors).\n\nSo give the shorts credit. They had a legitimate case until the last 12 months, when George Sherman (CEO), Reggie Fils-Aime (ex-Nintendo, current GME board member), and others have been conducting a phenomenally well executed turnaround.\n\nThat explains why we currently have ~70M shares short out of ~65M shares outstanding - but they’re all now caught on the wrong side of the trade.\n\nIn case the severity of the short interest hasn’t hit you yet, **there is a bigger market for shorting GME than the business of GME itself.** This is not even taking into account the long holders ([Senvest, Ryan Cohen, Burry, Donald Foss, Sherman, Hestia/Permit](https://fintel.io/so/us/gme)) which takes ~25M shares out of circulation. So short interest in reality could be around 180%+ of true float. \n\nA true head-scratcher. \n\nAnd a worthy opponent.\n\nBut they’re wrong.\n\n**Act 2 - Avengers, Assemble:**\n\nQ: Why am I so sure GME is prime to blow? Isn’t this just another meme stonk hunch driven by WSB and Michael Burry hype? How can a few online gamblers and a few activist investors turn a dying business into a trade of a lifetime? \n\nCouldn’t the shorts be right? Also, hasn’t it blown already?\n\nA: NO AGAIN.\n\nLet me show you the ridiculous Avengers team we have. By Avengers team, I mean all the bullish cases:\n\n**1) Ryan Cohen**\n\nIron Man of the bunch, some call him the Dog-Man.\n\nThis guy is a crazy entrepreneur. He took on Bezos with a pet food company (CHWY) and won. Let me repeat - he beat Jeff Amazon without AWS subsidizing his loss leaders.\n\nIn other words, he built Markk I (CHWY) in a tiny cave with scraps all by himself with his dad, and now that he has billions, he wants to build nanotech Markk 50 (GME). Read up on this guy. He’s as crazy and as smart as they come.\n\nHe also wrote a scathing [letter](https://s.wsj.net/public/resources/documents/RC_Ventures_Letter_to_GameStop.pdf) to GME leadership, but if you read between the lines, he’s not addressing the existing board, who had only been there temporarily. He’s setting this letter up in order to potentially offer a takeover bid (rumor mill - unconfirmed). \n\nEither way, GME leadership needs to address this letter in the Q3 earnings call on Dec 8th - which means they need to either post a good quarter, provide good guidance, or add color to existing developments.\n\nOtherwise George Sherman (Cpt America)’s ass is out the door and Cohen takes over as the leader of the Avengers through a vote or buyout. Either of which requires shares to be recalled.\n\nOne more thing to note about RC. There has been no 13D/A filling since his initial purchases. Which means he is STILL IN. He has not sold a single share. \n\n\n**2) GME Leadership and activist investors - Guardians of the Galaxy, Dr. Very Strange Burry, and the old Captain trying to fit in with the youngsters:**\n\n\nDr. Very Strange Burry - AKA Big Short Man. Supreme numbers aspie who might have a screw loose but is unmatched at spotting contrarian trades.\n\n\nHestia/Permit/Senvest - Contrarian, activist investors.\n\n\nCpt George Sherman - Boomer CEO who knows what he’s doing.\n\n\nReggie Fils-Aime - Beloved ex-Nintendo President.\n\n\n**3) Bond repurchase**\n\t\nGME just bought back [$125M](http://news.gamestop.com/node/18286/html) of debt maturing in 2021. Who cares? Yes - normally this is a nothing burger even for a micro-cap, but if the shorts are betting on $0 - this is clear evidence against that bet.\n\nSecondly, rumor mill has it that this debt repurchase plus positive Q3 earnings/guidance will allow Moody’s to upgrade their 2023 debt to A or maybe higher.\n\nThis is HUGE because it allows institutional investors to long GME without further restrictions. In other words, they may not be allowed to long companies with B- debt. Once this is upgraded, more buyers are allowed to come in.\n\nVery underplayed story here.\n\n\n**4) TA - When the stars and crayons align. Here’s an excerpt from our resident astrologist u/JayAreW:**\n\nIgnoring the short squeeze element of GME and just looking at chart action, there are two elements that are important to keep track of. The cup and handle pattern and $15.80. \n\nWhile my trading style is 90% technical analysis, there are certain elements which I shy away from – mainly chart patterns. However, it is important to at least recognize the obvious ones because if you see it, chances are others see it too. The main pattern I keep an eye out for are the massive cup and handle patterns. This is an example from Pring [figure 1](https://media.discordapp.net/attachments/778014693059067934/783103438112030760/cup_and_handle_pring_fig_1.PNG).\n\nThe buy signal is traditionally a breakout above the handle, and a good estimate for price target is the distance from the base of the cup to the handle, added to the breakout point. A recent example of this is $JMIA [(daily - figure 2)](https://media.discordapp.net/attachments/778014693059067934/783103467937988628/jmia_cup_and_handle_fig_2.PNG). Notice not one, but two failures to break the top of the handle and the subsequent parabolic run.\nCompare $JMIA with $GME and you see almost the same pattern [(daily – figure 3)](https://media.discordapp.net/attachments/778014693059067934/783103497926082580/gme_cup_and_handle.PNG). The traditional buy signal would be a breach above the red line (~$15.80). The difference between $JMIA and $GME is that $JMIA was far more condensed; the pattern played out over a period of a few months where $GME’s cup and handle started in late 2019. Playing this pattern exclusively, I would expect a price target of roughly $27, stretched out over a period of weeks/months and not as explosive as it’s African counterpart (assuming a squeeze doesn't happen between now and then). Typically, any chart pattern calls for a retest of the breakout point, so don’t be surprised if $GME retraces to $15.80 and look for a bounce there as confirmation that the breakout is on.\nThe other important element is the $15.80 price. Not only is it the breakout point for the cup and handle pattern, but it coincides to a price point which I believe was a major short-selling entry point [(fig 4)](https://media.discordapp.net/attachments/778014693059067934/783103538602442812/GME_big_short.PNG).  Notice the nearly 20% gap down on 33 million of volume. This type of action doesn’t just happen with selling alone and I believe massive short positions were opened on that day. \n\nThis $15.80 then represents a breaking even point for those shorts if they have not closed their positions (and we have no real reason to believe they have). Breaking even is a huge psychological barrier for people when a trade isn’t going their way and often times represents an exit point for crowded positions. Most of the shorts were already underwater - above $15.80 and that water begins to boil. I believe this position is becoming borderline untenable for existing short positions and is a crowded and disastrous trade.\nSo to recap, $15.80 not only serves as an important chart pattern breakout point, but the proverbial “line in the sand” for existing short positions.\n\nJeffAmazon here again: Note Jay and I don’t agree on a few major points, but are nevertheless both seeing bullish action to come very very soon.\n\n\n\n**5) Product Mix**\n\nGameStop is expanding their product mix to include monitors, PC parts, and [more](https://gamerant.com/gamestop-vizio-tvs/). GME is no longer a Disc-Drive only store (which is fine itself), but an all-things-tech e-commerce growth start up. Or you can at least bet that’s the narrative.\n\nGIVE ME THAT F-ING CHWY SALES MULTIPLE.\n\n**6) Three signs of a bubble: leverage, lack of liquidity, and consensus.**\n\nThis is an inverse bubble - it will rise as quickly as other bubbles drop. KBIO and VW are often quoted as short squeeze examples. Those are wrong comparisons. The only similarity is the fact that shorts were involved.\n\nInstead, think of any other market bubble. It’s simply about leverage, lack of liquidity, and consensus. We have all 3 in GME. Everyone thinks GME will go like BlockBuster to $0 and is using leverage to short (by definition and current SI).\n\nSo instead, think of Burry’s 2008 MBS trade, Ackman’s 2020 COVID trade, PTJ’s Black Monday Trade, or Chanos’ Enron trade. \n\nSame thing, different direction. Will go up as fast as the others went down.\n\nAnd oh boy do we lack liquidity. Crowded party, one exit.\n\n\n**7) Phenomenal numbers due to current console cycle.**\n\n$GME bull Rod Alzmann has great breakdowns on Q4 EPS/order count due to console cycle. He tracks orders by order number among a slew of other information [here](https://twitter.com/RodAlzmann).\n\nCheck out his models. In short, we expect over $5 EPS in Q4 base case. Which is bananas.\n\n\n**8) MSFT Partnership gross margin**\n\nGME is getting free money from Satya Nadella.\n\n[Conservative estimate $180M, 100% margin for 2 years](https://seekingalpha.com/article/4378623-gamestop-revenue-sharing-agreement-microsoft-shifts-sentiment).\n\n\n**9) January and April option OI**\n\nOI in option calls for Jan and April are almost 4X that of Decembers. Is GME going to exercise the ITM calls for a squeeze? Why are they so insanely large? Who are these buyers? WTF are they doing?\n\nNo clue. But something is about to go down.\n\nNote put call skew isn’t that low, so no infinity gamma squeeze yet, but it will come as GME obtains meme status.\n\n\n**10) Most importantly, YOU.**\n\nCNBC and other misled, egoistic mass media companies and institutional investors continue, time and time again, to look down upon the new generation of traders and laugh at WSB.\n\nTell me, which one of them has read all of Moody’s credit reports on GME? Which one of them live streams collaborative GME DD 20+ hours a week for 6+ months straight? Which one of them tracks order flows by the f-ing second based on skimmed CC data? Who scours r/GameStop to see how leadership is treating their employees and customers at a testimonial level? Do they even know about the bond repurchase?\n\nThey don’t know jack s-.\n\n\n**Act 3 - The Trade**\n\nWhat more evidence do you want? Time for action.\n\nFirst, the PT. u/ronoron summed it up well:\n\n> A 3 billion market cap (not even 0.5x of their revenues) would already leave GME at $46/share.Going back to their 2013 peak at around 6 billion market cap would leave them at almost $100/share already, not the $56 peak/share. The algos trading still can't appreciate the fact that GME halved its number of outstanding shares a while ago.\n\n> For comparison. Bestbuy is trading at almost ~0.7x of revenues with lower gross margins. Nordstrom is almost at 0.4x of revenues despite the bigger liability their department stores are having through corona (never mind their uglier balance sheet). GME is still hovering just above 0.2x revenues because stinky shorts overestimated how bad corona would be for GME (e.g. delayed console cycle, digital consoles becoming widely popular).”\n\nPT can easily be over $100. The JeffAmazon target is $420 which gives them about ~$25B market cap at a P/S ratio of 5, maybe 4 with console cycle revenue. That wouldn’t even be considered an euphoric price with today’s growth stocks. For comparison, NVDA is 22, TSLA is 20, and CHWY is 5.\n\nTiming:\nThis all hinges on Dec 8 earnings. If GME misses (it historically has), Cohen will use this opportunity to attack leadership and take over as CEO. Therefore, GME leadership needs to provide a great earnings report or else Sherman will lose his job.\n\nHere’s my responsible trade (do whatever you want): All in calls and shares now. If IV and $GME is sky-high before earnings, sell half to secure profit. If GME misses and tanks, bet your bottom dollar a takeover bid will be announced shortly.\n\nIn all honesty, I'm going to probably hold everything through earnings WSB style.\n\nMy positions:\n1/15/21 $30Cs, shares\n\n(I would buy April $30Cs too, but I'm all tapped out of cash).\n\nShorts and longs both have their cases. All the cards are on the table. Which side are you on?\n\n-------\n\nIf I missed anything, comment and I will update above. I’m aiming to make this the final stop for all high-level GME DD.", "author_fullname": "t2_5b3w4u5p", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "The REAL Greatest Short Burn of the Century Part III: GME Infinity War", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k4csaa", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.91, "author_flair_background_color": null, "subreddit_type": "public", "ups": 19, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 19, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1606794838.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1606822722.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><blockquote>\n<p><a href=\"https://twitter.com/elonmusk/status/992388944774938626\">Oh and uh short burn of the century comin soon. Flamethrowers should arrive just in time.</a></p>\n</blockquote>\n\n<p>-Elon Musk</p>\n\n<p>Oh Elon, sorry to steal your thunder. But GME will make TSLA vol look like TLT. Jeff haunting your every accomplishment yet again.</p>\n\n<hr/>\n\n<p>I’m back with the final warning bell. The next time I post in 2021 will be to recap the squeeze’s results and post gain porn along with <a href=\"/u/Deep_Fucking_Value\">u/Deep_Fucking_Value</a>, <a href=\"/u/SIR_JACK_A_LOT\">u/SIR_JACK_A_LOT</a>, <a href=\"/u/Tomatotowers\">u/Tomatotowers</a>, and more. <em>This is the last stop before the moon mission.</em></p>\n\n<p>It’s currently not too late. But after Q3 earnings on Dec 8th, it will be.</p>\n\n<p>Here’s a comprehensive GME overview for all new and returning WSB-monkeys. Sit down and grab some tea. This is a long one unlike the previous posts.</p>\n\n<p><strong>GME Overview:</strong></p>\n\n<p>The GME story can be broken up into 2 main theses. The first is a deep value play which has credibility all on its own. The second is an infinity short squeeze like we’ve never seen before in history, which has credibility all on its own. When combining the two, you get the trade of a lifetime. </p>\n\n<p>In all my (albeit limited) days, I have never EVER seen a trade set up like this before. I’ve pored over every source of historical finance material I can get my hands on, and still have nothing to reference to. IMO, this will look more like the 2008-MBS bet, or the Ackman 2020-COVID “Hell is coming” bet, than TSLA, OSTK, KBIO, or VW.</p>\n\n<p>Just a fucking face-ripping, out-of-nowhere, legendary-HOF-ticker bet that will bankrupt some funds and get people fired - and of course, with no community other than WSB’s name next to it in the history books (and if I could pencil in our lovely GME discord hosted by <a href=\"/u/BadElf21\">u/BadElf21</a> and <a href=\"/u/RoaringKitty\">u/RoaringKitty</a>’s YT stream).</p>\n\n<p>Let’s begin.</p>\n\n<p><strong>Act 1 - The Set Up:</strong></p>\n\n<p>Q: Why is GME so heavily shorted in the first place? Why are we betting the long? Aren’t they going bankrupt ala Blockbuster? If not, are we just trading this short term like a HTZ/CCL meme stonk?</p>\n\n<p>A: NO. This is a fundamentally solid deep value play at its core.</p>\n\n<p>First let’s go back a few years. We must give the shorts due credit in order to understand where we are now. GME has been profitably shorted since 2013 when the market correctly bet on the digitization of video games and spread of mobile gaming. Some data here:</p>\n\n<ul>\n<li><p>GME sales have plunged from $9.5 billion in fiscal year 2011 to $6.4 billion in fiscal year 2019.</p></li>\n<li><p>GME Annual EBITDA has dropped from $839 million in fiscal year 2011 (before the last console cycle) to only $111 million in fiscal year 2019.</p></li>\n<li><p>Net income has fallen off a cliff from $339 million in fiscal year 2011 to a staggering loss of $470 million in fiscal year 2019.</p></li>\n<li><p>In the two most recent quarters alone, GME lost another $277 million.</p></li>\n</ul>\n\n<p>The shorts are betting on $0. </p>\n\n<p>However, in the last 12 months, GME has shown that their terminal velocity does not lead to bankruptcy. GME has a strong balance sheet. <a href=\"https://seekingalpha.com/article/4378623-gamestop-revenue-sharing-agreement-microsoft-shifts-sentiment\">Cash on hand is worth over $12 a share. Net cash is worth over $5 a share</a> and is FCF positive (nixing the bankruptcy thesis). They also paid off $125M in debt last month just to show Moody’s they are healthy due to their incoming console cycle FCF (which may lead to possible bond upgrade, enticing more institutional investors).</p>\n\n<p>So give the shorts credit. They had a legitimate case until the last 12 months, when George Sherman (CEO), Reggie Fils-Aime (ex-Nintendo, current GME board member), and others have been conducting a phenomenally well executed turnaround.</p>\n\n<p>That explains why we currently have ~70M shares short out of ~65M shares outstanding - but they’re all now caught on the wrong side of the trade.</p>\n\n<p>In case the severity of the short interest hasn’t hit you yet, <strong>there is a bigger market for shorting GME than the business of GME itself.</strong> This is not even taking into account the long holders (<a href=\"https://fintel.io/so/us/gme\">Senvest, Ryan Cohen, Burry, Donald Foss, Sherman, Hestia/Permit</a>) which takes ~25M shares out of circulation. So short interest in reality could be around 180%+ of true float. </p>\n\n<p>A true head-scratcher. </p>\n\n<p>And a worthy opponent.</p>\n\n<p>But they’re wrong.</p>\n\n<p><strong>Act 2 - Avengers, Assemble:</strong></p>\n\n<p>Q: Why am I so sure GME is prime to blow? Isn’t this just another meme stonk hunch driven by WSB and Michael Burry hype? How can a few online gamblers and a few activist investors turn a dying business into a trade of a lifetime? </p>\n\n<p>Couldn’t the shorts be right? Also, hasn’t it blown already?</p>\n\n<p>A: NO AGAIN.</p>\n\n<p>Let me show you the ridiculous Avengers team we have. By Avengers team, I mean all the bullish cases:</p>\n\n<p><strong>1) Ryan Cohen</strong></p>\n\n<p>Iron Man of the bunch, some call him the Dog-Man.</p>\n\n<p>This guy is a crazy entrepreneur. He took on Bezos with a pet food company (CHWY) and won. Let me repeat - he beat Jeff Amazon without AWS subsidizing his loss leaders.</p>\n\n<p>In other words, he built Markk I (CHWY) in a tiny cave with scraps all by himself with his dad, and now that he has billions, he wants to build nanotech Markk 50 (GME). Read up on this guy. He’s as crazy and as smart as they come.</p>\n\n<p>He also wrote a scathing <a href=\"https://s.wsj.net/public/resources/documents/RC_Ventures_Letter_to_GameStop.pdf\">letter</a> to GME leadership, but if you read between the lines, he’s not addressing the existing board, who had only been there temporarily. He’s setting this letter up in order to potentially offer a takeover bid (rumor mill - unconfirmed). </p>\n\n<p>Either way, GME leadership needs to address this letter in the Q3 earnings call on Dec 8th - which means they need to either post a good quarter, provide good guidance, or add color to existing developments.</p>\n\n<p>Otherwise George Sherman (Cpt America)’s ass is out the door and Cohen takes over as the leader of the Avengers through a vote or buyout. Either of which requires shares to be recalled.</p>\n\n<p>One more thing to note about RC. There has been no 13D/A filling since his initial purchases. Which means he is STILL IN. He has not sold a single share. </p>\n\n<p><strong>2) GME Leadership and activist investors - Guardians of the Galaxy, Dr. Very Strange Burry, and the old Captain trying to fit in with the youngsters:</strong></p>\n\n<p>Dr. Very Strange Burry - AKA Big Short Man. Supreme numbers aspie who might have a screw loose but is unmatched at spotting contrarian trades.</p>\n\n<p>Hestia/Permit/Senvest - Contrarian, activist investors.</p>\n\n<p>Cpt George Sherman - Boomer CEO who knows what he’s doing.</p>\n\n<p>Reggie Fils-Aime - Beloved ex-Nintendo President.</p>\n\n<p><strong>3) Bond repurchase</strong></p>\n\n<p>GME just bought back <a href=\"http://news.gamestop.com/node/18286/html\">$125M</a> of debt maturing in 2021. Who cares? Yes - normally this is a nothing burger even for a micro-cap, but if the shorts are betting on $0 - this is clear evidence against that bet.</p>\n\n<p>Secondly, rumor mill has it that this debt repurchase plus positive Q3 earnings/guidance will allow Moody’s to upgrade their 2023 debt to A or maybe higher.</p>\n\n<p>This is HUGE because it allows institutional investors to long GME without further restrictions. In other words, they may not be allowed to long companies with B- debt. Once this is upgraded, more buyers are allowed to come in.</p>\n\n<p>Very underplayed story here.</p>\n\n<p><strong>4) TA - When the stars and crayons align. Here’s an excerpt from our resident astrologist <a href=\"/u/JayAreW\">u/JayAreW</a>:</strong></p>\n\n<p>Ignoring the short squeeze element of GME and just looking at chart action, there are two elements that are important to keep track of. The cup and handle pattern and $15.80. </p>\n\n<p>While my trading style is 90% technical analysis, there are certain elements which I shy away from – mainly chart patterns. However, it is important to at least recognize the obvious ones because if you see it, chances are others see it too. The main pattern I keep an eye out for are the massive cup and handle patterns. This is an example from Pring <a href=\"https://media.discordapp.net/attachments/778014693059067934/783103438112030760/cup_and_handle_pring_fig_1.PNG\">figure 1</a>.</p>\n\n<p>The buy signal is traditionally a breakout above the handle, and a good estimate for price target is the distance from the base of the cup to the handle, added to the breakout point. A recent example of this is $JMIA <a href=\"https://media.discordapp.net/attachments/778014693059067934/783103467937988628/jmia_cup_and_handle_fig_2.PNG\">(daily - figure 2)</a>. Notice not one, but two failures to break the top of the handle and the subsequent parabolic run.\nCompare $JMIA with $GME and you see almost the same pattern <a href=\"https://media.discordapp.net/attachments/778014693059067934/783103497926082580/gme_cup_and_handle.PNG\">(daily – figure 3)</a>. The traditional buy signal would be a breach above the red line (~$15.80). The difference between $JMIA and $GME is that $JMIA was far more condensed; the pattern played out over a period of a few months where $GME’s cup and handle started in late 2019. Playing this pattern exclusively, I would expect a price target of roughly $27, stretched out over a period of weeks/months and not as explosive as it’s African counterpart (assuming a squeeze doesn&#39;t happen between now and then). Typically, any chart pattern calls for a retest of the breakout point, so don’t be surprised if $GME retraces to $15.80 and look for a bounce there as confirmation that the breakout is on.\nThe other important element is the $15.80 price. Not only is it the breakout point for the cup and handle pattern, but it coincides to a price point which I believe was a major short-selling entry point <a href=\"https://media.discordapp.net/attachments/778014693059067934/783103538602442812/GME_big_short.PNG\">(fig 4)</a>.  Notice the nearly 20% gap down on 33 million of volume. This type of action doesn’t just happen with selling alone and I believe massive short positions were opened on that day. </p>\n\n<p>This $15.80 then represents a breaking even point for those shorts if they have not closed their positions (and we have no real reason to believe they have). Breaking even is a huge psychological barrier for people when a trade isn’t going their way and often times represents an exit point for crowded positions. Most of the shorts were already underwater - above $15.80 and that water begins to boil. I believe this position is becoming borderline untenable for existing short positions and is a crowded and disastrous trade.\nSo to recap, $15.80 not only serves as an important chart pattern breakout point, but the proverbial “line in the sand” for existing short positions.</p>\n\n<p>JeffAmazon here again: Note Jay and I don’t agree on a few major points, but are nevertheless both seeing bullish action to come very very soon.</p>\n\n<p><strong>5) Product Mix</strong></p>\n\n<p>GameStop is expanding their product mix to include monitors, PC parts, and <a href=\"https://gamerant.com/gamestop-vizio-tvs/\">more</a>. GME is no longer a Disc-Drive only store (which is fine itself), but an all-things-tech e-commerce growth start up. Or you can at least bet that’s the narrative.</p>\n\n<p>GIVE ME THAT F-ING CHWY SALES MULTIPLE.</p>\n\n<p><strong>6) Three signs of a bubble: leverage, lack of liquidity, and consensus.</strong></p>\n\n<p>This is an inverse bubble - it will rise as quickly as other bubbles drop. KBIO and VW are often quoted as short squeeze examples. Those are wrong comparisons. The only similarity is the fact that shorts were involved.</p>\n\n<p>Instead, think of any other market bubble. It’s simply about leverage, lack of liquidity, and consensus. We have all 3 in GME. Everyone thinks GME will go like BlockBuster to $0 and is using leverage to short (by definition and current SI).</p>\n\n<p>So instead, think of Burry’s 2008 MBS trade, Ackman’s 2020 COVID trade, PTJ’s Black Monday Trade, or Chanos’ Enron trade. </p>\n\n<p>Same thing, different direction. Will go up as fast as the others went down.</p>\n\n<p>And oh boy do we lack liquidity. Crowded party, one exit.</p>\n\n<p><strong>7) Phenomenal numbers due to current console cycle.</strong></p>\n\n<p>$GME bull Rod Alzmann has great breakdowns on Q4 EPS/order count due to console cycle. He tracks orders by order number among a slew of other information <a href=\"https://twitter.com/RodAlzmann\">here</a>.</p>\n\n<p>Check out his models. In short, we expect over $5 EPS in Q4 base case. Which is bananas.</p>\n\n<p><strong>8) MSFT Partnership gross margin</strong></p>\n\n<p>GME is getting free money from Satya Nadella.</p>\n\n<p><a href=\"https://seekingalpha.com/article/4378623-gamestop-revenue-sharing-agreement-microsoft-shifts-sentiment\">Conservative estimate $180M, 100% margin for 2 years</a>.</p>\n\n<p><strong>9) January and April option OI</strong></p>\n\n<p>OI in option calls for Jan and April are almost 4X that of Decembers. Is GME going to exercise the ITM calls for a squeeze? Why are they so insanely large? Who are these buyers? WTF are they doing?</p>\n\n<p>No clue. But something is about to go down.</p>\n\n<p>Note put call skew isn’t that low, so no infinity gamma squeeze yet, but it will come as GME obtains meme status.</p>\n\n<p><strong>10) Most importantly, YOU.</strong></p>\n\n<p>CNBC and other misled, egoistic mass media companies and institutional investors continue, time and time again, to look down upon the new generation of traders and laugh at WSB.</p>\n\n<p>Tell me, which one of them has read all of Moody’s credit reports on GME? Which one of them live streams collaborative GME DD 20+ hours a week for 6+ months straight? Which one of them tracks order flows by the f-ing second based on skimmed CC data? Who scours <a href=\"/r/GameStop\">r/GameStop</a> to see how leadership is treating their employees and customers at a testimonial level? Do they even know about the bond repurchase?</p>\n\n<p>They don’t know jack s-.</p>\n\n<p><strong>Act 3 - The Trade</strong></p>\n\n<p>What more evidence do you want? Time for action.</p>\n\n<p>First, the PT. <a href=\"/u/ronoron\">u/ronoron</a> summed it up well:</p>\n\n<blockquote>\n<p>A 3 billion market cap (not even 0.5x of their revenues) would already leave GME at $46/share.Going back to their 2013 peak at around 6 billion market cap would leave them at almost $100/share already, not the $56 peak/share. The algos trading still can&#39;t appreciate the fact that GME halved its number of outstanding shares a while ago.</p>\n\n<p>For comparison. Bestbuy is trading at almost ~0.7x of revenues with lower gross margins. Nordstrom is almost at 0.4x of revenues despite the bigger liability their department stores are having through corona (never mind their uglier balance sheet). GME is still hovering just above 0.2x revenues because stinky shorts overestimated how bad corona would be for GME (e.g. delayed console cycle, digital consoles becoming widely popular).”</p>\n</blockquote>\n\n<p>PT can easily be over $100. The JeffAmazon target is $420 which gives them about ~$25B market cap at a P/S ratio of 5, maybe 4 with console cycle revenue. That wouldn’t even be considered an euphoric price with today’s growth stocks. For comparison, NVDA is 22, TSLA is 20, and CHWY is 5.</p>\n\n<p>Timing:\nThis all hinges on Dec 8 earnings. If GME misses (it historically has), Cohen will use this opportunity to attack leadership and take over as CEO. Therefore, GME leadership needs to provide a great earnings report or else Sherman will lose his job.</p>\n\n<p>Here’s my responsible trade (do whatever you want): All in calls and shares now. If IV and $GME is sky-high before earnings, sell half to secure profit. If GME misses and tanks, bet your bottom dollar a takeover bid will be announced shortly.</p>\n\n<p>In all honesty, I&#39;m going to probably hold everything through earnings WSB style.</p>\n\n<p>My positions:\n1/15/21 $30Cs, shares</p>\n\n<p>(I would buy April $30Cs too, but I&#39;m all tapped out of cash).</p>\n\n<p>Shorts and longs both have their cases. All the cards are on the table. Which side are you on?</p>\n\n<hr/>\n\n<p>If I missed anything, comment and I will update above. I’m aiming to make this the final stop for all high-level GME DD.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/j6ETh8UBmgdjrYhg9um8IOYJstov78uZOz_tfG5qeUs.png?auto=webp&s=f13fc8aca61d2050aa6924bd469b3d69fc7c6e07", "width": 472, "height": 374}, "resolutions": [{"url": "https://external-preview.redd.it/j6ETh8UBmgdjrYhg9um8IOYJstov78uZOz_tfG5qeUs.png?width=108&crop=smart&auto=webp&s=3ffa602faaf3ef777fbcf202dc8031ea43ddc316", "width": 108, "height": 85}, {"url": "https://external-preview.redd.it/j6ETh8UBmgdjrYhg9um8IOYJstov78uZOz_tfG5qeUs.png?width=216&crop=smart&auto=webp&s=9b4b05941f2d47ff50a54943eaa1f061af3483b1", "width": 216, "height": 171}, {"url": "https://external-preview.redd.it/j6ETh8UBmgdjrYhg9um8IOYJstov78uZOz_tfG5qeUs.png?width=320&crop=smart&auto=webp&s=1e1545d1c54308b037339a08cc9fa68da5b0f7e5", "width": 320, "height": 253}], "variants": {}, "id": "v6_dF8gYyLhDssBU1_BAeGuwGnPz1E_MH6TdN4l36eE"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "k4csaa", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "Jeffamazon", "fullname": "t2_5b3w4u5p"}, "discussion_type": null, "num_comments": 11, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/", "subreddit_subscribers": 1637662, "created_utc": 1606793922.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k4csaa", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "ge84e60", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4csaa", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k4csaa&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k4csaa&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=k4csaa)\n___\n ^comment ^will ^disappear ^--- ^275 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1606795461.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k4csaa&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k4csaa&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=k4csaa\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>275</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/ge84e60/", "num_reports": null, "locked": false, "name": "t1_ge84e60", "created": 1606823316.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1606794516.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4csaa", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge84pxr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "hugh_g_reckshon", "fullname": "t2_j05nu"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4csaa", "score": 8, "author_fullname": "t2_j05nu", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Say less I just bought every share on the market", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Say less I just bought every share on the market</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/ge84pxr/", "num_reports": null, "locked": false, "name": "t1_ge84pxr", "created": 1606823500.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606794700.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4csaa", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge84wqo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "HookEmNation", "fullname": "t2_3tahn5fx"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4csaa", "score": 6, "author_fullname": "t2_3tahn5fx", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "You have my penis stiff as a board right now ... can I touch it?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>You have my penis stiff as a board right now ... can I touch it?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4csaa/the_real_greatest_short_burn_of_the_century_part/ge84wqo/", "num_reports": null, "locked": false, "name": "t1_ge84wqo", "created": 1606823610.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606794810.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}