{"approved_at_utc": null, "selftext": "# While there are many more companies that are discussed much more than TSMC (NYSE:TSM) on here, such as Apple, AMD, Intel, NVIDIA, etc, TSMC is a hidden gem that is getting ready to take off over the next few years. Here's why:\n\nTSMC was founded in 1987 with the intent of bringing Taiwan into the global tech market. Morris Chang, who previously worked at Texas Instruments for over 30 years, is the founder and former CEO of TSMC and widely regarded as the \"godfather of computer chips\". TSMC is currently the world's largest semiconductor producer, with over half of semiconductor revenue from TSMC. Other notable competitors include GlobalFoundries (AMD used them for Zen and Zen+, switching to TSMC for Zen 2 and Zen 3), Intel, and Samsung. TSMC is a pioneer in the pure-play foundry business, meaning that they do not produce any chips for their own products. Instead, they manufacture and sell chips to companies, meaning that those who choose to source chips from TSMC do not have to build expensive silicon fabrication plants to manufacture their own chips. TSMC currently operates 10 different silicon fabs, manufacturing over 10,000 different products using over 250 distinct technologies to cater to 499 different customers in 2019.\n\nNot only is TSMC the largest semiconductor foundry, it is also a pioneer in advancing semiconductor production and performance. Currently, TSMC has 7 customers for its new 5nm chips, including Apple, for A14/X chips and ARM-based chips for Mac products, Qualcomm and MediaTek for 5G smartphone chips, AMD, for next-generation Zen 4 CPUs, Bitmain, Intel, and NVIDIA. TSMC is also currently engineering its N4 chips, built on a 4nm process node, its 3nm chips, and its 2nm chips, which will use new GAAFET (Gate All Around Field Effect Transistor) technology instead of the traditional FinFET technology.\n\n**So who are some of TSMC's biggest and most notable customers?**\n\n# Apple Inc (NASDAQ:AAPL)\n\nApple is the world's largest company in terms of market capitalization (2.17 Trillion), and has become widely popular due to its heavy and cohesive integration between its products and widespread use by many prominent figures. Currently, it offers many products such as laptops, phones, smart watches, smart TV products, fitness products, and more. It also offers many services and software products, which all integrate with each other via iCloud, continuity software such as Handoff, and more. Recently, Apple has confirmed that they are cutting support for Intel CPUs on their Mac products in a few years, meaning they will shift to using entirely Apple Silicon chips for all of their Mac products. This is in addition to Apple using their own chips for all other products that they currently produce - iPhones, iPads, smart watches, etc.\n\nApple is one of TSMC's largest customers, and that is only expected to grow as they ramp up production for their M1 and next generation ARM chips for Macs. Apple's M1 chips are a strong competitor to AMD and Intel CPUs, especially if they can scale well up to 32 and 64 cores. They are extremely efficient and consume drastically less power than x86-based CPUs (Intel and AMD CPUs), meaning that thermal requirements are much lower. Macs have typically been targeted by PC enthusiasts as an overpriced, underperforming lineup, but we may see that change as Apple's new chips perform extremely well.\n\nApple reported a yearly revenue of 274.5 billion US Dollars in 2020, roughly a 5% increase from 2019. Since Apple relies on TSMC for their chips, and Apple's Mac lineup is likely to become more popular, I would expect that TSMC's revenue from Apple will increase more than we've seen in previous years.\n\n# Advanced Micro Devices (NASDAQ:AMD)\n\nAMD has certainly made a huge return since Lisa Su became CEO in 2014 and the production of Ryzen, which was widely popular due to its high core counts and high price to performance compared to Intel. Now, Ryzen has developed into a strong all-around player, sporting high core counts and great single thread performance. Currently, AMD Ryzen 5000 desktop CPUs outperform Intel's current generation Comet Lake CPUs in games, which is the first time that AMD has surpassed Intel in gaming performance.\n\nAMD has slowly been regaining market share, both in the PC enthusiast side and the server side. In the past two years, AMD has doubled their server market share from 4.5% to 8%. This may not seem like much, but considering that server upgrades are not frequent and those who buy Intel server CPUs are more likely to stick with Intel, that is a massive increase. On the PC enthusiast side, AMD CPUs have accounted for 84% of CPUs sold on mindfactory.de, a German PC Retailer. This is a massive increase considering that in 2016, before the release of Ryzen, Intel accounted for roughly 75% of CPU sales on mindfactory.de.\n\nAMD launched their Zen 3 chips in 2020, which was followed by huge demand and a shortage of these CPUs. This was in part due to demand at TSMC not being able to keep up with AMD's orders. Zen 3 CPUs perform extremely well, and next-generation Zen 4 CPUs, which will be on TSMC's 5nm process, point to a shortage of fab space at TSMC.\n\n# Qualcomm (NASDAQ:QCOM)\n\nQualcomm is a semiconductor company that creates wireless technology chips, CPUs, software, and services related to wireless technology. Their most prominent products include their Snapdragon CPUs, used in phones from some of the largest smartphone companies such as Samsung, LG, OnePlus, Xiaomi, Motorola, and more. They also produce application specific processors for things like cameras, IoT devices, kiosks, robots, and a lot more. Additionally, Qualcomm offers desktop CPUs, such as their Snapdragon 8cx. Qualcomm also produces various connectivity chips for things such as WiFi (onboard chips in laptops, desktop Wifi cards, routers, modems, etc), Bluetooth, and internet connectivity chips on smartphones.\n\nCurrently, Qualcomm relies on TSMC for the production of its Snapdragon chips. Although Samsung beat out TSMC for the production of Qualcomm's upcoming 5G chips, mobile chips accounted for 44.8% of Qualcomm's total revenue in 2020, while RF Front End chips (smartphone internet connectivity chips) accounted for just 9.8% of Qualcomm's total revenue.\n\n# NVIDIA (NASDAQ:NVDA)\n\nNVIDIA has been a long time customer of TSMC, dating all the way back to 1998 when NVIDIA switched over to TSMC's 350nm process for the Riva TNT. Since then, TSMC has manufactured nearly every NVIDIA chip up until RTX 3000 series, also known as Ampere. NVIDIA decided to switch to Samsung's 8N 8nm process node, likely due to financial reasons or fab capacity reasons.\n\nHowever, NVIDIA is allegedly moving back to TSMC to manufacture more Ampere GPUs using their 7nm process. There could be a few reasons for this - TSMC might have offered NVIDIA a deal, or capacity for 7nm fabs may have opened up due to large customers such as Apple and AMD shifting more focus towards TSMC's 5nm process.\n\nNVIDIA's RTX 3000 series GPUs, also known as Ampere, are a massive improvement in the GPU space compared to previous generations and just for performance in general. The RTX 3070 performs similarly to an RTX 2080ti, where the former has an MSRP of 499 USD and the latter has an MSRP of 999 USD. In addition to much greater price/performance, Ampere GPUs also heavily increase ray tracing performance so games that can take advantage of ray tracing hardware are actually playable. They are extremely popular, and currently Ampere GPUs are selling anywhere from 200 to upwards of 1500 dollars of their MSRP. NVIDIA is also huge in the AI/Computing space, teaming up with NIO for AI-based self-driving computation, Photoshop, for neural filters, and also  powers some of the fastest supercomputers in the world. In regards to AMD, NVIDIA blows the new RX 6000 series GPUs out of the water for things like streaming performance and workstation performance.\n\n# Intel (NASDAQ:INTC)\n\nWhile Intel has traditionally manufactured most of their products (Internet connectivity products, processors, chipsets, etc), Intel is reportedly shifting a fair amount of their chips to TSMC. Recently, Intel announced they would use TSMC for 7nm Xe graphics chips on their CPUs. In October of 2020, Intel CEO Bob Swan said Intel would decide by January whether it was going to expand its 7nm production, outsource it to a foundry, or both. Intel has severely underperformed in the CPU space compared to AMD, but if they decide to shift some production to TSMC, this could mean that Intel will make a strong return into the CPU space and strong entry into the GPU space.\n\n# Cool, but what does this mean?\n\nAgain, TSMC is the largest foundry, outclassing the likes of Samsung, GlobalFoundries, and other similar companies. There is an insane amount of demand for TSMC's chips, and they are extremely competitive compared to other manufacturers. TSMC has customers such as Apple, AMD, and Qualcomm, which all have great products and are only expected to grow with the release of new technology such as CPUs or 5G networking. Many of its customers are expected to have massive growth over the coming years, meaning that TSMC will reap some of those profits.\n\n# Ok, but why should I buy now?\n\nI mean, TSMC is already up over 100% over the past year, isn't it too late to buy in?\n\nWhen you consider its most important clients, all of them are going to use TSMC for future products that are important to their respective segments. Apple has just begun their venture into producing their own CPUs for Mac products, the release of DDR5 and PCIe 5.0 is right around the corner with AMD's Zen 4 processors, set to release late 2021 or 2022, Qualcomm producing next generation Snapdragon CPUs (and we may see 5G production shifted to TSMC), Intel actually producing competitive CPUs once again (which might be with TSMC), and NVIDIA continuing to dominate in the computing space and the GPU space. Considering that all of these things are happening in the next few years, TSMC is getting ready to take off.  🚀  🚀  🚀  🚀  🚀  🚀\n\nTL;DR: TSMC has a lot of very large customers (Apple, AMD, QualComm to name a few) which are all producing technology that looks very promising. All of these things are coming up in the future, which mean that TSMC is going to the moon. BUY CALLS AND LEAPS LET'S GOOOOOO\n\nPositions: Currently holding 4/21 calls, will definitely roll calls and load up on more once we get closer to expiry", "author_fullname": "t2_15rb3u", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "[Serious DD] TSMC - A Hidden Gem Offering Free Money", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kw8xmn", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.8, "author_flair_background_color": null, "subreddit_type": "public", "ups": 18, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 18, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1610515493.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1610540822.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><h1>While there are many more companies that are discussed much more than TSMC (NYSE:TSM) on here, such as Apple, AMD, Intel, NVIDIA, etc, TSMC is a hidden gem that is getting ready to take off over the next few years. Here&#39;s why:</h1>\n\n<p>TSMC was founded in 1987 with the intent of bringing Taiwan into the global tech market. Morris Chang, who previously worked at Texas Instruments for over 30 years, is the founder and former CEO of TSMC and widely regarded as the &quot;godfather of computer chips&quot;. TSMC is currently the world&#39;s largest semiconductor producer, with over half of semiconductor revenue from TSMC. Other notable competitors include GlobalFoundries (AMD used them for Zen and Zen+, switching to TSMC for Zen 2 and Zen 3), Intel, and Samsung. TSMC is a pioneer in the pure-play foundry business, meaning that they do not produce any chips for their own products. Instead, they manufacture and sell chips to companies, meaning that those who choose to source chips from TSMC do not have to build expensive silicon fabrication plants to manufacture their own chips. TSMC currently operates 10 different silicon fabs, manufacturing over 10,000 different products using over 250 distinct technologies to cater to 499 different customers in 2019.</p>\n\n<p>Not only is TSMC the largest semiconductor foundry, it is also a pioneer in advancing semiconductor production and performance. Currently, TSMC has 7 customers for its new 5nm chips, including Apple, for A14/X chips and ARM-based chips for Mac products, Qualcomm and MediaTek for 5G smartphone chips, AMD, for next-generation Zen 4 CPUs, Bitmain, Intel, and NVIDIA. TSMC is also currently engineering its N4 chips, built on a 4nm process node, its 3nm chips, and its 2nm chips, which will use new GAAFET (Gate All Around Field Effect Transistor) technology instead of the traditional FinFET technology.</p>\n\n<p><strong>So who are some of TSMC&#39;s biggest and most notable customers?</strong></p>\n\n<h1>Apple Inc (NASDAQ:AAPL)</h1>\n\n<p>Apple is the world&#39;s largest company in terms of market capitalization (2.17 Trillion), and has become widely popular due to its heavy and cohesive integration between its products and widespread use by many prominent figures. Currently, it offers many products such as laptops, phones, smart watches, smart TV products, fitness products, and more. It also offers many services and software products, which all integrate with each other via iCloud, continuity software such as Handoff, and more. Recently, Apple has confirmed that they are cutting support for Intel CPUs on their Mac products in a few years, meaning they will shift to using entirely Apple Silicon chips for all of their Mac products. This is in addition to Apple using their own chips for all other products that they currently produce - iPhones, iPads, smart watches, etc.</p>\n\n<p>Apple is one of TSMC&#39;s largest customers, and that is only expected to grow as they ramp up production for their M1 and next generation ARM chips for Macs. Apple&#39;s M1 chips are a strong competitor to AMD and Intel CPUs, especially if they can scale well up to 32 and 64 cores. They are extremely efficient and consume drastically less power than x86-based CPUs (Intel and AMD CPUs), meaning that thermal requirements are much lower. Macs have typically been targeted by PC enthusiasts as an overpriced, underperforming lineup, but we may see that change as Apple&#39;s new chips perform extremely well.</p>\n\n<p>Apple reported a yearly revenue of 274.5 billion US Dollars in 2020, roughly a 5% increase from 2019. Since Apple relies on TSMC for their chips, and Apple&#39;s Mac lineup is likely to become more popular, I would expect that TSMC&#39;s revenue from Apple will increase more than we&#39;ve seen in previous years.</p>\n\n<h1>Advanced Micro Devices (NASDAQ:AMD)</h1>\n\n<p>AMD has certainly made a huge return since Lisa Su became CEO in 2014 and the production of Ryzen, which was widely popular due to its high core counts and high price to performance compared to Intel. Now, Ryzen has developed into a strong all-around player, sporting high core counts and great single thread performance. Currently, AMD Ryzen 5000 desktop CPUs outperform Intel&#39;s current generation Comet Lake CPUs in games, which is the first time that AMD has surpassed Intel in gaming performance.</p>\n\n<p>AMD has slowly been regaining market share, both in the PC enthusiast side and the server side. In the past two years, AMD has doubled their server market share from 4.5% to 8%. This may not seem like much, but considering that server upgrades are not frequent and those who buy Intel server CPUs are more likely to stick with Intel, that is a massive increase. On the PC enthusiast side, AMD CPUs have accounted for 84% of CPUs sold on mindfactory.de, a German PC Retailer. This is a massive increase considering that in 2016, before the release of Ryzen, Intel accounted for roughly 75% of CPU sales on mindfactory.de.</p>\n\n<p>AMD launched their Zen 3 chips in 2020, which was followed by huge demand and a shortage of these CPUs. This was in part due to demand at TSMC not being able to keep up with AMD&#39;s orders. Zen 3 CPUs perform extremely well, and next-generation Zen 4 CPUs, which will be on TSMC&#39;s 5nm process, point to a shortage of fab space at TSMC.</p>\n\n<h1>Qualcomm (NASDAQ:QCOM)</h1>\n\n<p>Qualcomm is a semiconductor company that creates wireless technology chips, CPUs, software, and services related to wireless technology. Their most prominent products include their Snapdragon CPUs, used in phones from some of the largest smartphone companies such as Samsung, LG, OnePlus, Xiaomi, Motorola, and more. They also produce application specific processors for things like cameras, IoT devices, kiosks, robots, and a lot more. Additionally, Qualcomm offers desktop CPUs, such as their Snapdragon 8cx. Qualcomm also produces various connectivity chips for things such as WiFi (onboard chips in laptops, desktop Wifi cards, routers, modems, etc), Bluetooth, and internet connectivity chips on smartphones.</p>\n\n<p>Currently, Qualcomm relies on TSMC for the production of its Snapdragon chips. Although Samsung beat out TSMC for the production of Qualcomm&#39;s upcoming 5G chips, mobile chips accounted for 44.8% of Qualcomm&#39;s total revenue in 2020, while RF Front End chips (smartphone internet connectivity chips) accounted for just 9.8% of Qualcomm&#39;s total revenue.</p>\n\n<h1>NVIDIA (NASDAQ:NVDA)</h1>\n\n<p>NVIDIA has been a long time customer of TSMC, dating all the way back to 1998 when NVIDIA switched over to TSMC&#39;s 350nm process for the Riva TNT. Since then, TSMC has manufactured nearly every NVIDIA chip up until RTX 3000 series, also known as Ampere. NVIDIA decided to switch to Samsung&#39;s 8N 8nm process node, likely due to financial reasons or fab capacity reasons.</p>\n\n<p>However, NVIDIA is allegedly moving back to TSMC to manufacture more Ampere GPUs using their 7nm process. There could be a few reasons for this - TSMC might have offered NVIDIA a deal, or capacity for 7nm fabs may have opened up due to large customers such as Apple and AMD shifting more focus towards TSMC&#39;s 5nm process.</p>\n\n<p>NVIDIA&#39;s RTX 3000 series GPUs, also known as Ampere, are a massive improvement in the GPU space compared to previous generations and just for performance in general. The RTX 3070 performs similarly to an RTX 2080ti, where the former has an MSRP of 499 USD and the latter has an MSRP of 999 USD. In addition to much greater price/performance, Ampere GPUs also heavily increase ray tracing performance so games that can take advantage of ray tracing hardware are actually playable. They are extremely popular, and currently Ampere GPUs are selling anywhere from 200 to upwards of 1500 dollars of their MSRP. NVIDIA is also huge in the AI/Computing space, teaming up with NIO for AI-based self-driving computation, Photoshop, for neural filters, and also  powers some of the fastest supercomputers in the world. In regards to AMD, NVIDIA blows the new RX 6000 series GPUs out of the water for things like streaming performance and workstation performance.</p>\n\n<h1>Intel (NASDAQ:INTC)</h1>\n\n<p>While Intel has traditionally manufactured most of their products (Internet connectivity products, processors, chipsets, etc), Intel is reportedly shifting a fair amount of their chips to TSMC. Recently, Intel announced they would use TSMC for 7nm Xe graphics chips on their CPUs. In October of 2020, Intel CEO Bob Swan said Intel would decide by January whether it was going to expand its 7nm production, outsource it to a foundry, or both. Intel has severely underperformed in the CPU space compared to AMD, but if they decide to shift some production to TSMC, this could mean that Intel will make a strong return into the CPU space and strong entry into the GPU space.</p>\n\n<h1>Cool, but what does this mean?</h1>\n\n<p>Again, TSMC is the largest foundry, outclassing the likes of Samsung, GlobalFoundries, and other similar companies. There is an insane amount of demand for TSMC&#39;s chips, and they are extremely competitive compared to other manufacturers. TSMC has customers such as Apple, AMD, and Qualcomm, which all have great products and are only expected to grow with the release of new technology such as CPUs or 5G networking. Many of its customers are expected to have massive growth over the coming years, meaning that TSMC will reap some of those profits.</p>\n\n<h1>Ok, but why should I buy now?</h1>\n\n<p>I mean, TSMC is already up over 100% over the past year, isn&#39;t it too late to buy in?</p>\n\n<p>When you consider its most important clients, all of them are going to use TSMC for future products that are important to their respective segments. Apple has just begun their venture into producing their own CPUs for Mac products, the release of DDR5 and PCIe 5.0 is right around the corner with AMD&#39;s Zen 4 processors, set to release late 2021 or 2022, Qualcomm producing next generation Snapdragon CPUs (and we may see 5G production shifted to TSMC), Intel actually producing competitive CPUs once again (which might be with TSMC), and NVIDIA continuing to dominate in the computing space and the GPU space. Considering that all of these things are happening in the next few years, TSMC is getting ready to take off.  🚀  🚀  🚀  🚀  🚀  🚀</p>\n\n<p>TL;DR: TSMC has a lot of very large customers (Apple, AMD, QualComm to name a few) which are all producing technology that looks very promising. All of these things are coming up in the future, which mean that TSMC is going to the moon. BUY CALLS AND LEAPS LET&#39;S GOOOOOO</p>\n\n<p>Positions: Currently holding 4/21 calls, will definitely roll calls and load up on more once we get closer to expiry</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kw8xmn", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "BrandinoGames", "fullname": "t2_15rb3u"}, "discussion_type": null, "num_comments": 34, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/", "subreddit_subscribers": 1812474, "created_utc": 1610512022.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kw8xmn", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gj2y9ea", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Koosh_ed", "fullname": "t2_21fy6iqx"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kw8xmn", "score": 6, "author_fullname": "t2_21fy6iqx", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "TSM has made me some nice tendies on short dated options.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>TSM has made me some nice tendies on short dated options.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/gj2y9ea/", "num_reports": null, "locked": false, "name": "t1_gj2y9ea", "created": 1610541671.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610512871.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 9, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kw8xmn", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gj2y0gj", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Noob_Noodles", "fullname": "t2_wlj0i"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kw8xmn", "score": 9, "author_fullname": "t2_wlj0i", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Dude, this is literally one of the most popular tickers on here in the past year.  Not hidden at all.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Dude, this is literally one of the most popular tickers on here in the past year.  Not hidden at all.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/gj2y0gj/", "num_reports": null, "locked": false, "name": "t1_gj2y0gj", "created": 1610541518.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610512718.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kw8xmn", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gj2yhpv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "BrandinoGames", "fullname": "t2_15rb3u"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gj2y0gj", "score": 5, "author_fullname": "t2_15rb3u", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "I see.... one post besides mine in the last month.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I see.... one post besides mine in the last month.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/gj2yhpv/", "num_reports": null, "locked": false, "name": "t1_gj2yhpv", "created": 1610541817.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610513017.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kw8xmn", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gj33oxb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "pussy_orc_tha_god", "fullname": "t2_3qy9cltx"}, "can_mod_post": false, "created_utc": 1610516574.0, "send_replies": true, "parent_id": "t1_gj2yhpv", "score": 3, "author_fullname": "t2_3qy9cltx", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Maybe only one post, but hundreds of comments.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Maybe only one post, but hundreds of comments.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/gj33oxb/", "num_reports": null, "locked": false, "name": "t1_gj33oxb", "created": 1610545374.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kw8xmn", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gj2y0nv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "spreadsTrader", "fullname": "t2_8cluxzk4"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kw8xmn", "score": 3, "author_fullname": "t2_8cluxzk4", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "TSM is fine. I am already balls deep in it.\n\nBut I am afraid Samsung's recent moves and investment will move detrimental to TSM's revenue in the future. Wish I could own Samsung", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>TSM is fine. I am already balls deep in it.</p>\n\n<p>But I am afraid Samsung&#39;s recent moves and investment will move detrimental to TSM&#39;s revenue in the future. Wish I could own Samsung</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kw8xmn/serious_dd_tsmc_a_hidden_gem_offering_free_money/gj2y0nv/", "num_reports": null, "locked": false, "name": "t1_gj2y0nv", "created": 1610541521.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610512721.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}