{"approved_at_utc": null, "selftext": "**Chewy crushes earnings reports, while GameStop disappoints. What is the latest news on Apple and the new AirPods Max? Should we buy AirBNB or DoorDash when they launch tomorrow? Let’s talk about this and more about the stock market**\n\nHey everyone and Good Morning! So, let’s start with the recap of yesterday as we saw the [Nasdaq Composite](https://ibb.co/8zQQ165) leading the way up half a percent, the [SP500](https://ibb.co/9pFmQ0X) up .28%, both of them closing at new record highs with the [Dow Jones](https://ibb.co/bbsbdqM) also up .35% to close Tuesday. The [VIX](https://ibb.co/5MPVyNn) also showed a steady decline through the day as it dropped almost 3%. This moves in the market were caused by the [latest](https://ibb.co/Lnr5Q3X) hopes for a stimulus deal to be agreed on by the end of current session in congress as there seems to be a lot of ground on which parties can agree on. Things have gotten worse in the economy since this hole stimulus talk has been going around, so, if both parties would have been more willing to give up some ground, people would have already gotten more support and we would probably be talking about other bills or measures that would have helped even more. So, maybe this [latest](https://ibb.co/w4LYBk9) Mnuchin proposal with maybe minor tweaks would be the best chance of anything happening by the end of this year.\n\nWe saw more companies advancing [yesterday](https://ibb.co/R9N61kK) as over 3 thousand companies were moving up, continuing the huge bull run started in November as more than 84% of companies are moving above the 50 and 200-day moving averages. The best gaining [sectors](https://ibb.co/hLpbcrx) yesterday were Energy and Health Care while Real Estate and Utilities lagged behind as Large-Cap Growth companies were the only company factor [analysis](https://ibb.co/zbJd6m2) that lost ground yesterday, with small-caps, especially small-cap growth companies largely outperforming the markets.\n\nYou can see in this [HEAT MAP](https://ibb.co/hcMmt7x) that there were gains to be made yesterday in a lot of parts of the stock market, with only a few big red spots on the map.\n\n[Today](https://ibb.co/RgSDj55) we will get some numbers on the November Job [openings](https://ibb.co/VLVz771), MBA mortgage applications and Petroleum inventories. \n\nWhile we got some earnings yesterday from Chewy which dazzled again in [earnings](https://ibb.co/Jd7Scx1) with the only small miss coming in net sales per customer, but as the number of customers keeps increasing, this might continue to go down, as not every pet owner spends the same amount of big money on pets. The company [reported](https://ibb.co/WVndSgJ) an EBITDA of $5.5M vs a loss of over $9M expected with the gross margin increasing to over 25% while also giving great [guidance](https://ibb.co/h8BPK2W) for Q4 of $1.94B to $1.96B vs less than $1.8B expected by analysts.\n\nThe company also turned around to a positive [cash flow](https://ibb.co/ys3NVTc) of over $30M. I really like this company and I expected it to be a good own at least for the next quarter until they reach more hard earnings comps next year.\n\nMeanwhile, as I expected GameStop had another bad [quarter](https://ibb.co/DWP4jZh) despite beating some earnings estimates with a smaller loss than expected, the revenue still continued to drop over 30% on a year over year basis while comps where even worse missing the expectations by quite a margin. \n\nThough e-commerce sales rose by more than 250% in Q3, this did not offset the comparable store sales. Margins also declined with hardware margins being the biggest reasons why. I think this company has a very though challenge on its hands with e-commerce being such a though place to compete in, I think the shift to online has been delayed for this company and I think it will struggle to survive, even though it might see a boost next quarter from the sales of the new gaming consoles that were released last month from both Sony and Microsoft.  [GME EARNINGS HIGHLIGHTS](https://ibb.co/SymxCtK)\n\nI wouldn’t touch this [stock](https://ibb.co/K0cN5ds) as I think there are far better plays out there than betting on this struggling company.\n\nThe only company that I am interested today which will release earnings results is [ADOBE](https://ibb.co/d5SBbyX) which is expected to have the best results ever for the company with an increase of over 12% in both EPS and Revenues. Last go around despite posting great results, the stock fell more than 4% in September and have just recovered to that price point. I expect it this time to go higher and stay that way if they manage to deliver the best quarter on the books.\n\nMeanwhile [DoorDash](https://ibb.co/FgJ5k7z) is pricing its initial public offering at over 100$/share which I believe is ridiculous, and it is an flat out joke of a valuation, this company has benefited a ton from this economy and still, this valuation implies that they will have over 50% of the total addressable market not in the US, but in the WORLD in the next couple of years, I don’t think this is a good investment opportunity, they will have increasing competition that offer the same thing for free or cheaper, this is a very though business to try and take over as one single company. People will also be way more likely to start going to restaurants maybe not in 2021 but for sure starting 2022 or whenever the vaccines are widely available in the entire world. I wouldn’t touch this stock at such high valuations, especially over 110$, even if I was looking for short-term gains which might end up being the case, I think there are better opportunities out there.\n\nIn contrast to DoorDash, I might be interested to buy some AirBNB if the price is right after the [IPO](https://ibb.co/RBDhWW0), I think it will have a much better future, as personally I really like to rent out apartments or homes whenever I go on a vacation rather than a traditional hotel. And even though it might have a tough Q4 and Q1 next year, I expect by Q2 next year more people will be vaccinated, so more people will start and go out and travel, and with especially low comps for next year as bookings are way down in 2020 this might make the company look much more attractive by this time next year. So, between DoorDash and AirBNB, I clearly like AirBNB a whole damn lot more.\n\nIn other IPO news, [RBNHD](https://ibb.co/WyJs5vQ) is expected to go public as soon as Q1 next year as they seek a valuation of over $20B.\n\nSome other [Boeing](https://ibb.co/6rN04h6) came for companies like Boeing which made its first 737 MAX delivery since the ban ended, as it is expected to start rolling out deliveries and upgrades for current planes at a very good rate with more good news coming from the UK which will suspend the tariffs imposed on US Goods.\n\nWhile [PENN](https://ibb.co/qJhKxGY) gaming ran to an all-time high yesterday after news that sports betting may be launched in Michigan as early as six weeks from now, as legalization of gambling is moving faster and faster in the US, this also bolds well for DraftKings and other gambling stocks.\n\nAlso, [ETSY](https://ibb.co/F0vsdmD) keeps getting upgrades from analysts as they are expected to have a great Q4 suggested from the most recent November sales data.\n\nAnd finally let’s talk about Apple, as they just [revealed](https://ibb.co/dKrwT6j) the new AirPods Max headphone yesterday, with a huge price tag of 549$, this seemed to gain a pretty bad reaction from [consumers](https://ibb.co/CJ8DkLR) as [they](https://ibb.co/xz2HDXx) complained about the huge price tag with competitors like Bose and others selling similar headphones for 350$ or less. These headphones, also have a bigger price tag than even the new PS5 videogame console so we will have to wait and see if this is a successful product from Apple, I think they have gone a little overboard with the price, but rich people do tend to pay a premium for brand names. This can also be seen in the [latest](https://ibb.co/By3F6jS) analyst call from JPMorgan as customers appear to favor high end models as delivery times have been increasing for the 12 Pro and 12 PRO MAX. \n\nOn the better side of things for Apple, the [Fitness+](https://ibb.co/Kh3KnQg) service is expected to launch on the 14th of December and it will cost $9.99/month or $79.99$/year. I expect this to be a better success for the company and to drive an even more stable increase of revenues, as subscription-based revenues are better than one-time sales. \n\nSo, I still like this company the most in the long-term and it might see a spike in the near future, especially moving closer to Q4 results and earnings. Apple is still the biggest position in my portfolio and I am not planning on changing that anytime soon.\n\nGood luck to everyone in the stock market as the [futures](https://ibb.co/q7rHvL5) are mixed while writing this post with the DOW and SP500 gaining ground while the Nasdaq futures are just down for the moment.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "AirBNB & DoorDash IPOs | CHEWY & GameStop EARNINGS | APPLE news| STOCK MARKET NEWS [12-09]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k9rweq", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.92, "author_flair_background_color": null, "subreddit_type": "public", "ups": 38, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 38, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607549651.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Chewy crushes earnings reports, while GameStop disappoints. What is the latest news on Apple and the new AirPods Max? Should we buy AirBNB or DoorDash when they launch tomorrow? Let’s talk about this and more about the stock market</strong></p>\n\n<p>Hey everyone and Good Morning! So, let’s start with the recap of yesterday as we saw the <a href=\"https://ibb.co/8zQQ165\">Nasdaq Composite</a> leading the way up half a percent, the <a href=\"https://ibb.co/9pFmQ0X\">SP500</a> up .28%, both of them closing at new record highs with the <a href=\"https://ibb.co/bbsbdqM\">Dow Jones</a> also up .35% to close Tuesday. The <a href=\"https://ibb.co/5MPVyNn\">VIX</a> also showed a steady decline through the day as it dropped almost 3%. This moves in the market were caused by the <a href=\"https://ibb.co/Lnr5Q3X\">latest</a> hopes for a stimulus deal to be agreed on by the end of current session in congress as there seems to be a lot of ground on which parties can agree on. Things have gotten worse in the economy since this hole stimulus talk has been going around, so, if both parties would have been more willing to give up some ground, people would have already gotten more support and we would probably be talking about other bills or measures that would have helped even more. So, maybe this <a href=\"https://ibb.co/w4LYBk9\">latest</a> Mnuchin proposal with maybe minor tweaks would be the best chance of anything happening by the end of this year.</p>\n\n<p>We saw more companies advancing <a href=\"https://ibb.co/R9N61kK\">yesterday</a> as over 3 thousand companies were moving up, continuing the huge bull run started in November as more than 84% of companies are moving above the 50 and 200-day moving averages. The best gaining <a href=\"https://ibb.co/hLpbcrx\">sectors</a> yesterday were Energy and Health Care while Real Estate and Utilities lagged behind as Large-Cap Growth companies were the only company factor <a href=\"https://ibb.co/zbJd6m2\">analysis</a> that lost ground yesterday, with small-caps, especially small-cap growth companies largely outperforming the markets.</p>\n\n<p>You can see in this <a href=\"https://ibb.co/hcMmt7x\">HEAT MAP</a> that there were gains to be made yesterday in a lot of parts of the stock market, with only a few big red spots on the map.</p>\n\n<p><a href=\"https://ibb.co/RgSDj55\">Today</a> we will get some numbers on the November Job <a href=\"https://ibb.co/VLVz771\">openings</a>, MBA mortgage applications and Petroleum inventories. </p>\n\n<p>While we got some earnings yesterday from Chewy which dazzled again in <a href=\"https://ibb.co/Jd7Scx1\">earnings</a> with the only small miss coming in net sales per customer, but as the number of customers keeps increasing, this might continue to go down, as not every pet owner spends the same amount of big money on pets. The company <a href=\"https://ibb.co/WVndSgJ\">reported</a> an EBITDA of $5.5M vs a loss of over $9M expected with the gross margin increasing to over 25% while also giving great <a href=\"https://ibb.co/h8BPK2W\">guidance</a> for Q4 of $1.94B to $1.96B vs less than $1.8B expected by analysts.</p>\n\n<p>The company also turned around to a positive <a href=\"https://ibb.co/ys3NVTc\">cash flow</a> of over $30M. I really like this company and I expected it to be a good own at least for the next quarter until they reach more hard earnings comps next year.</p>\n\n<p>Meanwhile, as I expected GameStop had another bad <a href=\"https://ibb.co/DWP4jZh\">quarter</a> despite beating some earnings estimates with a smaller loss than expected, the revenue still continued to drop over 30% on a year over year basis while comps where even worse missing the expectations by quite a margin. </p>\n\n<p>Though e-commerce sales rose by more than 250% in Q3, this did not offset the comparable store sales. Margins also declined with hardware margins being the biggest reasons why. I think this company has a very though challenge on its hands with e-commerce being such a though place to compete in, I think the shift to online has been delayed for this company and I think it will struggle to survive, even though it might see a boost next quarter from the sales of the new gaming consoles that were released last month from both Sony and Microsoft.  <a href=\"https://ibb.co/SymxCtK\">GME EARNINGS HIGHLIGHTS</a></p>\n\n<p>I wouldn’t touch this <a href=\"https://ibb.co/K0cN5ds\">stock</a> as I think there are far better plays out there than betting on this struggling company.</p>\n\n<p>The only company that I am interested today which will release earnings results is <a href=\"https://ibb.co/d5SBbyX\">ADOBE</a> which is expected to have the best results ever for the company with an increase of over 12% in both EPS and Revenues. Last go around despite posting great results, the stock fell more than 4% in September and have just recovered to that price point. I expect it this time to go higher and stay that way if they manage to deliver the best quarter on the books.</p>\n\n<p>Meanwhile <a href=\"https://ibb.co/FgJ5k7z\">DoorDash</a> is pricing its initial public offering at over 100$/share which I believe is ridiculous, and it is an flat out joke of a valuation, this company has benefited a ton from this economy and still, this valuation implies that they will have over 50% of the total addressable market not in the US, but in the WORLD in the next couple of years, I don’t think this is a good investment opportunity, they will have increasing competition that offer the same thing for free or cheaper, this is a very though business to try and take over as one single company. People will also be way more likely to start going to restaurants maybe not in 2021 but for sure starting 2022 or whenever the vaccines are widely available in the entire world. I wouldn’t touch this stock at such high valuations, especially over 110$, even if I was looking for short-term gains which might end up being the case, I think there are better opportunities out there.</p>\n\n<p>In contrast to DoorDash, I might be interested to buy some AirBNB if the price is right after the <a href=\"https://ibb.co/RBDhWW0\">IPO</a>, I think it will have a much better future, as personally I really like to rent out apartments or homes whenever I go on a vacation rather than a traditional hotel. And even though it might have a tough Q4 and Q1 next year, I expect by Q2 next year more people will be vaccinated, so more people will start and go out and travel, and with especially low comps for next year as bookings are way down in 2020 this might make the company look much more attractive by this time next year. So, between DoorDash and AirBNB, I clearly like AirBNB a whole damn lot more.</p>\n\n<p>In other IPO news, <a href=\"https://ibb.co/WyJs5vQ\">RBNHD</a> is expected to go public as soon as Q1 next year as they seek a valuation of over $20B.</p>\n\n<p>Some other <a href=\"https://ibb.co/6rN04h6\">Boeing</a> came for companies like Boeing which made its first 737 MAX delivery since the ban ended, as it is expected to start rolling out deliveries and upgrades for current planes at a very good rate with more good news coming from the UK which will suspend the tariffs imposed on US Goods.</p>\n\n<p>While <a href=\"https://ibb.co/qJhKxGY\">PENN</a> gaming ran to an all-time high yesterday after news that sports betting may be launched in Michigan as early as six weeks from now, as legalization of gambling is moving faster and faster in the US, this also bolds well for DraftKings and other gambling stocks.</p>\n\n<p>Also, <a href=\"https://ibb.co/F0vsdmD\">ETSY</a> keeps getting upgrades from analysts as they are expected to have a great Q4 suggested from the most recent November sales data.</p>\n\n<p>And finally let’s talk about Apple, as they just <a href=\"https://ibb.co/dKrwT6j\">revealed</a> the new AirPods Max headphone yesterday, with a huge price tag of 549$, this seemed to gain a pretty bad reaction from <a href=\"https://ibb.co/CJ8DkLR\">consumers</a> as <a href=\"https://ibb.co/xz2HDXx\">they</a> complained about the huge price tag with competitors like Bose and others selling similar headphones for 350$ or less. These headphones, also have a bigger price tag than even the new PS5 videogame console so we will have to wait and see if this is a successful product from Apple, I think they have gone a little overboard with the price, but rich people do tend to pay a premium for brand names. This can also be seen in the <a href=\"https://ibb.co/By3F6jS\">latest</a> analyst call from JPMorgan as customers appear to favor high end models as delivery times have been increasing for the 12 Pro and 12 PRO MAX. </p>\n\n<p>On the better side of things for Apple, the <a href=\"https://ibb.co/Kh3KnQg\">Fitness+</a> service is expected to launch on the 14th of December and it will cost $9.99/month or $79.99$/year. I expect this to be a better success for the company and to drive an even more stable increase of revenues, as subscription-based revenues are better than one-time sales. </p>\n\n<p>So, I still like this company the most in the long-term and it might see a spike in the near future, especially moving closer to Q4 results and earnings. Apple is still the biggest position in my portfolio and I am not planning on changing that anytime soon.</p>\n\n<p>Good luck to everyone in the stock market as the <a href=\"https://ibb.co/q7rHvL5\">futures</a> are mixed while writing this post with the DOW and SP500 gaining ground while the Nasdaq futures are just down for the moment.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/E5Ajg6Ge_Bj4fp4A2E8lkOSjzCDVO0jLJDQHqf4mG5U.jpg?auto=webp&s=9669991b2002fa907981791f4ecfec691914b09d", "width": 891, "height": 472}, "resolutions": [{"url": "https://external-preview.redd.it/E5Ajg6Ge_Bj4fp4A2E8lkOSjzCDVO0jLJDQHqf4mG5U.jpg?width=108&crop=smart&auto=webp&s=56b5b609e10a9706d6dcc1c1b999222493880c0b", "width": 108, "height": 57}, {"url": "https://external-preview.redd.it/E5Ajg6Ge_Bj4fp4A2E8lkOSjzCDVO0jLJDQHqf4mG5U.jpg?width=216&crop=smart&auto=webp&s=5321b4ac737b0aa2b49a67e8de49eaadc7b048f0", "width": 216, "height": 114}, {"url": "https://external-preview.redd.it/E5Ajg6Ge_Bj4fp4A2E8lkOSjzCDVO0jLJDQHqf4mG5U.jpg?width=320&crop=smart&auto=webp&s=a4741d2e99b8110263c591a033ff02e24b55879f", "width": 320, "height": 169}, {"url": "https://external-preview.redd.it/E5Ajg6Ge_Bj4fp4A2E8lkOSjzCDVO0jLJDQHqf4mG5U.jpg?width=640&crop=smart&auto=webp&s=72e7b80fe066820053b66ede155187a1209a5bd3", "width": 640, "height": 339}], "variants": {}, "id": "blh7K-o_aDpLadtcDYAGvtAP8s6yQpAg7VM5YNV8qhw"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 50, "id": "award_02d9ab2c-162e-4c01-8438-317a016ed3d9", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=16&height=16&auto=webp&s=045db73f47a9513c44823d132b4c393ab9241b6a", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=32&height=32&auto=webp&s=298a02e0edbb5b5e293087eeede63802cbe1d2c7", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=48&height=48&auto=webp&s=7d06d606eb23dbcd6dbe39ee0e60588c5eb89065", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=64&height=64&auto=webp&s=ecd9854b14104a36a210028c43420f0dababd96b", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=128&height=128&auto=webp&s=0d5d7b92c1d66aff435f2ad32e6330ca2b971f6d", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "I'm in this with you.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Take My Energy", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=16&height=16&auto=webp&s=045db73f47a9513c44823d132b4c393ab9241b6a", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=32&height=32&auto=webp&s=298a02e0edbb5b5e293087eeede63802cbe1d2c7", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=48&height=48&auto=webp&s=7d06d606eb23dbcd6dbe39ee0e60588c5eb89065", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=64&height=64&auto=webp&s=ecd9854b14104a36a210028c43420f0dababd96b", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png?width=128&height=128&auto=webp&s=0d5d7b92c1d66aff435f2ad32e6330ca2b971f6d", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/jtw7x06j68361_TakeMyEnergyElf.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "k9rweq", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 23, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/", "subreddit_subscribers": 1679532, "created_utc": 1607520851.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 23, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k9rweq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf5zcdc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Its_Ya_Boy_Termite", "fullname": "t2_4h8knp7z"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k9rweq", "score": 23, "author_fullname": "t2_4h8knp7z", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Don’t forget to like and subscribe", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Don’t forget to like and subscribe</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/gf5zcdc/", "num_reports": null, "locked": false, "name": "t1_gf5zcdc", "created": 1607550025.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607521225.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k9rweq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf5z0ez", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "leandropoppz", "fullname": "t2_ir2oyen"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k9rweq", "score": 7, "author_fullname": "t2_ir2oyen", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Thank you for your work", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Thank you for your work</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/gf5z0ez/", "num_reports": null, "locked": false, "name": "t1_gf5z0ez", "created": 1607549805.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607521005.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k9rweq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf5z5sx", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gf5z0ez", "score": 6, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "No problem! Now it's time to fly the rocketship! Good Luck!", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>No problem! Now it&#39;s time to fly the rocketship! Good Luck!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/gf5z5sx/", "num_reports": null, "locked": false, "name": "t1_gf5z5sx", "created": 1607549903.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607521103.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k9rweq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf6148t", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "peezy02", "fullname": "t2_lgl26kk"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k9rweq", "score": 4, "author_fullname": "t2_lgl26kk", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Anyone know when puts will likely be available for DASH?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Anyone know when puts will likely be available for DASH?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/gf6148t/", "num_reports": null, "locked": false, "name": "t1_gf6148t", "created": 1607551129.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607522329.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k9rweq", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gf61t5a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "cvera8", "fullname": "t2_9wed1"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gf6148t", "score": 2, "author_fullname": "t2_9wed1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "I think it needs to have traded for 3 trading days, next week at the earliest", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I think it needs to have traded for 3 trading days, next week at the earliest</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k9rweq/airbnb_doordash_ipos_chewy_gamestop_earnings/gf61t5a/", "num_reports": null, "locked": false, "name": "t1_gf61t5a", "created": 1607551551.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607522751.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}