{"approved_at_utc": null, "selftext": "**The stimulus package is finally here. Tesla enters the SP500 while Nike posts blowout earnings. Let’s talk about this and other stock market news**\n\n**\\~Very Long Post\\~**\n\nHello everyone and Good morning! So, let’s start with the recap of Friday, as we saw all 3 big indexes finishing down for the day with the [Dow Jones](https://ibb.co/vh3NzhK) losing more than 0.4% falling as lawmakers continued to [struggle](https://ibb.co/mcHVyNh) on the stimulus bill, but finishing half a percent up for the week, the SP500 losing 0.35% but rising by 1.4% for the week and the [Nasdaq Composite](https://ibb.co/sCNjHGy) only down 0.07% while posting a huge 3% gain for the week. We also saw the [VIX](https://ibb.co/HpF7kz2) dropping again more than 1.6% on Friday and finishing almost 7.5% down for the [week](https://ibb.co/j3CzN3m).\n\nWe saw a massive day of trading on [Friday](https://ibb.co/72Q668L) with almost 80% of the companies trading above average volume, as it was quadruple witching day, and people had to move a lot of stocks to make room for the Tesla SP500 inclusion, but most companies lost ground despite this huge volume with the biggest losers being the Real estate and Energy sectors, losing around 1.7% for the day, while there were only a few [sectors](https://ibb.co/cwsj2b2) that had small gains with Materials leading the way in a late rally, as value plays suffered while growth companies were gaining on [Friday](https://ibb.co/gjvKvP8).\n\nHere is the HEAT MAP from [FRIDAY](https://ibb.co/5nhchr6), mostly RED as you can see, with INTEL losing more than 6% after the Microsoft [news](https://ibb.co/gM5F1kF), while Tesla spiked in the closing moments almost 6% after trading down in the last hours of the day.\n\nFor the week though, this [HEAT MAP](https://ibb.co/y0tPpHR) shows that most companies were gaining significant ground, with the biggest companies in the world Apple, Amazon, and Microsoft being up significantly for the week, while Google which was hit by several outages and a couple of antitrust lawsuits was trading down. We also saw the Energy sector doing pretty bad for the week with most of the companies losing ground, while Tesla was the biggest gainer heading into the SP500 inclusion.\n\nWe also got some economic data, that showed the November leading [INDICATORS](https://ibb.co/Q6dkKVd) up 0.6% to 109.1, better than expected with manufacturing orders, residential construction permits and initial claims for unemployment insurance moving the number higher.\n\nWhile the Q3 account [deficit](https://ibb.co/4mbJCtK) widened by more than $17B but was better than the $24B widening expected by analysts, as the gap was reflected by the increasing goods deficit.\n\n[Here](https://ibb.co/3smh0PD) are the most interesting economic events and data scheduled for the short week of trading with most of the important stuff coming on Wednesday and Thursday.\n\nWe also do not have many [earnings](https://ibb.co/DgC3MX4) reports this week, with the only company that I am watching being CarMax to see how the red-hot second-hand car market is keeping up. These results could also see other names like Carvana move up or down.\n\nSo, Friday was the last day of trading before [Tesla](https://ibb.co/SNkQLpT) will be a part of the SP500 and this saw the stock surge another 6% to a record high, as the company is up 70% since the news came out. The stock was trading lower towards the end of the day on about 80-90M volume, before a late spike pushed by the index buying saw the volume pop to an incredible 222M with 47M in after-hours [trading](https://ibb.co/6ByprLp). Expect the stock to have a slight pullback in the short-term, as profits will start to be taken from this huge run, especially after the year ends, as people may wait out the profit-taking to avoid tax implications until next year. Tesla is currently down 4% in pre-market [trading](https://ibb.co/hyvK6wt) already, as there are not a lot of people left to buy this company now.\n\nWe also received [news](https://ibb.co/CJPVyMS) late on Friday, that the FDA formally approved the Moderna vaccine and that it will start shipping this week. Moderna is expected to deliver around 20M doses by the end of the year in the US, with the European Union also [expected](https://ibb.co/v3tqMsJ) to rollout the Pfizer vaccine starting after Christmas.\n\nMeanwhile, the only big earnings report that came in on Friday was from [Nike](https://ibb.co/yWrnZqX), as the company crushed earnings, with a beat of 16 cents, up 11% and a revenue beat of $730M also up 9%. Gross margins also improved with Nike direct-to-consumer sales better than expected, as Nike brand digital sales jumped 84% in FQ2 more than the 82% increase in FQ1 with the company setting a target of 50% of the total sales to be made online in the foreseeable future. The company also noted that the revenue will likely be better than previously expected, which helped push the stock more than 4% higher in after-hours.\n\nWe also got a [report](https://ibb.co/8XZrT3Z) from a Morgan Stanley analyst who expected the iPhone to outperform expectations in China based on data through November. I also expect this to be true, and expect Apple to continue to have a significant growth as the 5G cycle will pick up steam in the next years.\n\nIn some other stock market news, [Microsoft](https://ibb.co/gM5F1kF) is reported to be working on their in-house chips for its cloud servers and Surface PCs. This would be another hit to Intel who still holds the biggest market share in the server chip sector, after the recent news of Apple working on its in-house chips for the Macs.\n\nWe also saw the whole bank sector trading significantly higher in after-hours, after the [FED](https://ibb.co/SKk85Xf) announced they will allow them to start buying back shares. This news came after the results of the FED’s second bank stress test in 2020, as all firms remained above minimum capital requirements after taking hypothetical losses. With [Citigroup](https://ibb.co/y0dhzfn) planning to restart stock purchases and pay quarterly dividends, [Morgan Stanley](https://ibb.co/pjMFC5R) already authorizing $10B in buybacks and [JP MORGAN](https://ibb.co/0mFZr0m) signing off on a huge $30B buyback program after the FED decision.\n\nLet’s hope for a recovery in the market as the [futures](https://ibb.co/L0yZqwB) seem to be pointing at a very bad open after the most recent [news](https://ibb.co/M5wJcY6) from Europe, which shows a new strain of the virus believed to have a more than 70% increased transmissibility, but we shouldn’t worry at the moment, as there is no evidence that it has worse symptoms, outcomes or that it isn’t affected by the vaccines just approved from Pfizer & Moderna.\n\nMaybe after Congress votes today, as the Congress is [expected](https://ibb.co/x10zj57) to vote on a $900B aid package today, the second biggest in history, with Trump also supporting the bill, which will provide $600 direct payments to individuals and a $300/week in boosted unemployment benefits, with money also included for small businesses, food assistance, vaccine distribution and more. The bill is also expected to extend the moratorium on foreclosures and provide $25B in rental aids while also giving support to the [airlines](https://ibb.co/0ZP1YQV) with more than $15B to reinstate payroll reimbursements. \n\nMy belief is that the market was poised for a healthy correction, but I don’t think this is a long-term problem for the stock market.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Tesla Joins SP500 | Nike Blowout Earnings |Stimulus Deal News| Stock Market News- Crash Today? [12-21]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_khh70q", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.86, "author_flair_background_color": null, "subreddit_type": "public", "ups": 16, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 16, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1608585339.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>The stimulus package is finally here. Tesla enters the SP500 while Nike posts blowout earnings. Let’s talk about this and other stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good morning! So, let’s start with the recap of Friday, as we saw all 3 big indexes finishing down for the day with the <a href=\"https://ibb.co/vh3NzhK\">Dow Jones</a> losing more than 0.4% falling as lawmakers continued to <a href=\"https://ibb.co/mcHVyNh\">struggle</a> on the stimulus bill, but finishing half a percent up for the week, the SP500 losing 0.35% but rising by 1.4% for the week and the <a href=\"https://ibb.co/sCNjHGy\">Nasdaq Composite</a> only down 0.07% while posting a huge 3% gain for the week. We also saw the <a href=\"https://ibb.co/HpF7kz2\">VIX</a> dropping again more than 1.6% on Friday and finishing almost 7.5% down for the <a href=\"https://ibb.co/j3CzN3m\">week</a>.</p>\n\n<p>We saw a massive day of trading on <a href=\"https://ibb.co/72Q668L\">Friday</a> with almost 80% of the companies trading above average volume, as it was quadruple witching day, and people had to move a lot of stocks to make room for the Tesla SP500 inclusion, but most companies lost ground despite this huge volume with the biggest losers being the Real estate and Energy sectors, losing around 1.7% for the day, while there were only a few <a href=\"https://ibb.co/cwsj2b2\">sectors</a> that had small gains with Materials leading the way in a late rally, as value plays suffered while growth companies were gaining on <a href=\"https://ibb.co/gjvKvP8\">Friday</a>.</p>\n\n<p>Here is the HEAT MAP from <a href=\"https://ibb.co/5nhchr6\">FRIDAY</a>, mostly RED as you can see, with INTEL losing more than 6% after the Microsoft <a href=\"https://ibb.co/gM5F1kF\">news</a>, while Tesla spiked in the closing moments almost 6% after trading down in the last hours of the day.</p>\n\n<p>For the week though, this <a href=\"https://ibb.co/y0tPpHR\">HEAT MAP</a> shows that most companies were gaining significant ground, with the biggest companies in the world Apple, Amazon, and Microsoft being up significantly for the week, while Google which was hit by several outages and a couple of antitrust lawsuits was trading down. We also saw the Energy sector doing pretty bad for the week with most of the companies losing ground, while Tesla was the biggest gainer heading into the SP500 inclusion.</p>\n\n<p>We also got some economic data, that showed the November leading <a href=\"https://ibb.co/Q6dkKVd\">INDICATORS</a> up 0.6% to 109.1, better than expected with manufacturing orders, residential construction permits and initial claims for unemployment insurance moving the number higher.</p>\n\n<p>While the Q3 account <a href=\"https://ibb.co/4mbJCtK\">deficit</a> widened by more than $17B but was better than the $24B widening expected by analysts, as the gap was reflected by the increasing goods deficit.</p>\n\n<p><a href=\"https://ibb.co/3smh0PD\">Here</a> are the most interesting economic events and data scheduled for the short week of trading with most of the important stuff coming on Wednesday and Thursday.</p>\n\n<p>We also do not have many <a href=\"https://ibb.co/DgC3MX4\">earnings</a> reports this week, with the only company that I am watching being CarMax to see how the red-hot second-hand car market is keeping up. These results could also see other names like Carvana move up or down.</p>\n\n<p>So, Friday was the last day of trading before <a href=\"https://ibb.co/SNkQLpT\">Tesla</a> will be a part of the SP500 and this saw the stock surge another 6% to a record high, as the company is up 70% since the news came out. The stock was trading lower towards the end of the day on about 80-90M volume, before a late spike pushed by the index buying saw the volume pop to an incredible 222M with 47M in after-hours <a href=\"https://ibb.co/6ByprLp\">trading</a>. Expect the stock to have a slight pullback in the short-term, as profits will start to be taken from this huge run, especially after the year ends, as people may wait out the profit-taking to avoid tax implications until next year. Tesla is currently down 4% in pre-market <a href=\"https://ibb.co/hyvK6wt\">trading</a> already, as there are not a lot of people left to buy this company now.</p>\n\n<p>We also received <a href=\"https://ibb.co/CJPVyMS\">news</a> late on Friday, that the FDA formally approved the Moderna vaccine and that it will start shipping this week. Moderna is expected to deliver around 20M doses by the end of the year in the US, with the European Union also <a href=\"https://ibb.co/v3tqMsJ\">expected</a> to rollout the Pfizer vaccine starting after Christmas.</p>\n\n<p>Meanwhile, the only big earnings report that came in on Friday was from <a href=\"https://ibb.co/yWrnZqX\">Nike</a>, as the company crushed earnings, with a beat of 16 cents, up 11% and a revenue beat of $730M also up 9%. Gross margins also improved with Nike direct-to-consumer sales better than expected, as Nike brand digital sales jumped 84% in FQ2 more than the 82% increase in FQ1 with the company setting a target of 50% of the total sales to be made online in the foreseeable future. The company also noted that the revenue will likely be better than previously expected, which helped push the stock more than 4% higher in after-hours.</p>\n\n<p>We also got a <a href=\"https://ibb.co/8XZrT3Z\">report</a> from a Morgan Stanley analyst who expected the iPhone to outperform expectations in China based on data through November. I also expect this to be true, and expect Apple to continue to have a significant growth as the 5G cycle will pick up steam in the next years.</p>\n\n<p>In some other stock market news, <a href=\"https://ibb.co/gM5F1kF\">Microsoft</a> is reported to be working on their in-house chips for its cloud servers and Surface PCs. This would be another hit to Intel who still holds the biggest market share in the server chip sector, after the recent news of Apple working on its in-house chips for the Macs.</p>\n\n<p>We also saw the whole bank sector trading significantly higher in after-hours, after the <a href=\"https://ibb.co/SKk85Xf\">FED</a> announced they will allow them to start buying back shares. This news came after the results of the FED’s second bank stress test in 2020, as all firms remained above minimum capital requirements after taking hypothetical losses. With <a href=\"https://ibb.co/y0dhzfn\">Citigroup</a> planning to restart stock purchases and pay quarterly dividends, <a href=\"https://ibb.co/pjMFC5R\">Morgan Stanley</a> already authorizing $10B in buybacks and <a href=\"https://ibb.co/0mFZr0m\">JP MORGAN</a> signing off on a huge $30B buyback program after the FED decision.</p>\n\n<p>Let’s hope for a recovery in the market as the <a href=\"https://ibb.co/L0yZqwB\">futures</a> seem to be pointing at a very bad open after the most recent <a href=\"https://ibb.co/M5wJcY6\">news</a> from Europe, which shows a new strain of the virus believed to have a more than 70% increased transmissibility, but we shouldn’t worry at the moment, as there is no evidence that it has worse symptoms, outcomes or that it isn’t affected by the vaccines just approved from Pfizer &amp; Moderna.</p>\n\n<p>Maybe after Congress votes today, as the Congress is <a href=\"https://ibb.co/x10zj57\">expected</a> to vote on a $900B aid package today, the second biggest in history, with Trump also supporting the bill, which will provide $600 direct payments to individuals and a $300/week in boosted unemployment benefits, with money also included for small businesses, food assistance, vaccine distribution and more. The bill is also expected to extend the moratorium on foreclosures and provide $25B in rental aids while also giving support to the <a href=\"https://ibb.co/0ZP1YQV\">airlines</a> with more than $15B to reinstate payroll reimbursements. </p>\n\n<p>My belief is that the market was poised for a healthy correction, but I don’t think this is a long-term problem for the stock market.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/t6clRBMnqaNYwl3Sgos1qz2_bO0YWeiQDr1Tt_qj3zQ.jpg?auto=webp&s=3f3c5f8c7a2730de549153313f01cdef5bc06c27", "width": 896, "height": 473}, "resolutions": [{"url": "https://external-preview.redd.it/t6clRBMnqaNYwl3Sgos1qz2_bO0YWeiQDr1Tt_qj3zQ.jpg?width=108&crop=smart&auto=webp&s=9396a25ad7c8f7a1a8230946a5169ee8c1b137e8", "width": 108, "height": 57}, {"url": "https://external-preview.redd.it/t6clRBMnqaNYwl3Sgos1qz2_bO0YWeiQDr1Tt_qj3zQ.jpg?width=216&crop=smart&auto=webp&s=09009531d136085a85cba91adbfd7d33acdc8530", "width": 216, "height": 114}, {"url": "https://external-preview.redd.it/t6clRBMnqaNYwl3Sgos1qz2_bO0YWeiQDr1Tt_qj3zQ.jpg?width=320&crop=smart&auto=webp&s=485688cfe876ec7a8818d73498224648b1199a91", "width": 320, "height": 168}, {"url": "https://external-preview.redd.it/t6clRBMnqaNYwl3Sgos1qz2_bO0YWeiQDr1Tt_qj3zQ.jpg?width=640&crop=smart&auto=webp&s=1864c032a15e44a6db7d2bae1db2a4ade272af0d", "width": 640, "height": 337}], "variants": {}, "id": "SyvssFARpp-pl1DrYOjY1o2hGXm3CU-BbEG0AMm_XRw"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "khh70q", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 15, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/", "subreddit_subscribers": 1724966, "created_utc": 1608556539.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "ggl0k26", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_khh70q", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=khh70q&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=khh70q&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=khh70q)\n___\n ^comment ^will ^disappear ^--- ^18 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1608559244.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=khh70q&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=khh70q&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=khh70q\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>18</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl0k26/", "num_reports": null, "locked": false, "name": "t1_ggl0k26", "created": 1608585604.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1608556804.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggl0g7v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "mjl1990uk", "fullname": "t2_1lgbb8"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_khh70q", "score": 7, "author_fullname": "t2_1lgbb8", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "What the fuck is this - I was about to break even.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>What the fuck is this - I was about to break even.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl0g7v/", "num_reports": null, "locked": false, "name": "t1_ggl0g7v", "created": 1608585524.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608556724.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggl0lfm", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggl0g7v", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "On what?", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>On what?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl0lfm/", "num_reports": null, "locked": false, "name": "t1_ggl0lfm", "created": 1608585631.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608556831.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggl2vk0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "mjl1990uk", "fullname": "t2_1lgbb8"}, "can_mod_post": false, "created_utc": 1608558470.0, "send_replies": true, "parent_id": "t1_ggl0lfm", "score": 4, "author_fullname": "t2_1lgbb8", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "On my \"since I began investing\"", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>On my &quot;since I began investing&quot;</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl2vk0/", "num_reports": null, "locked": false, "name": "t1_ggl2vk0", "created": 1608587270.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 11, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggl0ni5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Orcanius", "fullname": "t2_3iodev1f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_khh70q", "score": 11, "author_fullname": "t2_3iodev1f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "The stimulus deal is nowhere near enough for many Americans who are struggling with paying rent. New covid strain discovered in Uk dropped SPY like an emo kid from a tree branch. I would expect stocks to drop hella on Monday & Tuesday n maybe rise back up", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201201:7:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>The stimulus deal is nowhere near enough for many Americans who are struggling with paying rent. New covid strain discovered in Uk dropped SPY like an emo kid from a tree branch. I would expect stocks to drop hella on Monday &amp; Tuesday n maybe rise back up</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl0ni5/", "num_reports": null, "locked": false, "name": "t1_ggl0ni5", "created": 1608585674.0, "author_flair_text": "\u001b201201:7:1", "treatment_tags": [], "created_utc": 1608556874.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_khh70q", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ggl0xmb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ggl0ni5", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Hopefully this package is just a start... maybe something can get done after January again, who knows... yeah... i still think it's an overreaction to the news... so a healthy correction before skyrocketing back up... or so I hope & think", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Hopefully this package is just a start... maybe something can get done after January again, who knows... yeah... i still think it&#39;s an overreaction to the news... so a healthy correction before skyrocketing back up... or so I hope &amp; think</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/khh70q/tesla_joins_sp500_nike_blowout_earnings_stimulus/ggl0xmb/", "num_reports": null, "locked": false, "name": "t1_ggl0xmb", "created": 1608585881.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1608557081.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}