{"approved_at_utc": null, "selftext": "**DocuSign crushes earnings and AMC may go bankrupt. Lemonade spiked yesterday over 20% while Pfizer confirmed delivery numbers, let’s talk about this and everything new in the stock market**\n\nHey everyone! So, let’s start with the recap of yesterday as we saw the DOW leading the way up almost 0,3% with the [NASDAQ COMPOSITE](https://ibb.co/G9JLH78) close behind up 0,23% and finishing at a new record high while the broader market [SP500](https://ibb.co/7rMK8RY) finished barely down for the day. All 3 of them were trading a lot higher intraday before the most recent Pfizer [news](https://ibb.co/qCXxh0Q) popped up as they are only expected to ship half of the doses that were initially planned, but people spooked at this to much in my opinion. This thing was already known, when they published the candidate data in November, they also [announced](https://ibb.co/cDtdMCy) this number, but people runed away way to fast before going more into the data. Pfizer did not cut supply, they just explained why this happened in this latest headline. It is way better for companies to under-promise and over-deliver than the other way around.\n\nThe [VIX](https://ibb.co/HYrVJNH) also saw a spike around the Pfizer news and finished higher for the day while 59% of companies were advancing with almost 150 new highs and just 3 new lows on below average volume of 11,5 billion shares compared to 11,7 billion shares in the last 20 trading days. [CHART](https://ibb.co/6PVC7Lr)\n\nThe best gaining [sectors](https://ibb.co/2t3kk7m) yesterday were Energy and Real Estate while Utilities finished more than 1% down for the day with small and mid-cap growth companies [leading](https://ibb.co/sP2rMzd) the way while the large-caps where lagging the market as you can see in this [HEAT MAP](https://ibb.co/d2cJ7hZ) as all the FAANG stocks were down with Microsoft also joining them. While TESLA continued to be red hot and Alibaba has finally regained some momentum.\n\nHere is the most important [ECONOMIC DATA](https://ibb.co/w6b2bxv) that will be released today as we will get nonfarm payrolls and unemployment rates in the early morning alongside the trade deficit, with Factory orders numbers coming in a bit latter. \n\nThe [FUTURES](https://ibb.co/7GrND6j) are largely higher today not only in the US but also Europe is [gaining](https://ibb.co/mXsLDSb) momentum after Germany manufacturing [orders](https://ibb.co/9NVsjQw) rose for the sixth straight month in October and [Asia](https://ibb.co/7zhQnDt) as the global retail sector saw an [increase](https://ibb.co/k4dCN3f) of 30% in transactions with the whole Black Friday to Cyber Monday period doing very well this year.\n\nWhile yesterday we got numbers on the [NOVEMBER ISM](https://ibb.co/hcmvzgg) as it continued to a sixth straight month of expansion with employment being the biggest gainer in the index with even greater numbers coming in from the [PMI COMPOSITE](https://ibb.co/GHcFV4g) with the fastest growth since 2015 as employment rose at the fastest pace in the history of the survey.\n\nAlso, the Jobless [claims](https://ibb.co/7txF4QQ) came in whey lower than expected at 712k more than 60k below estimated with continuing claims dropping for the first time in the last 9 months to under 6 million\n\nMeanwhile we also got some sales number for October in the [SEMI sector](https://ibb.co/VTy4BvP) yesterday, as sales had big increases Y/Y and M/M with all regions ramping up sales on a monthly basis. This is great news for companies like Nvidia, QCOM, AVGO and many more.\n\nMoving on to the auto sector the US light vehicle sales [forecast](https://ibb.co/THKtD9y) has seen an improved outlook for next year, up around 10% from 2020 at around 15.6 million with US [EV SALES](https://ibb.co/Hdk0qqq) increasing over 70% next year, this could be a huge boost to Tesla and other EV ramping up players like GM and FORD.\n\nThis is great news for Tesla after a big bear on the company just [trimmed](https://ibb.co/25tcFhJ) his short position on TESLA\n\n[Lemonade](https://ibb.co/wLqdKCS) had a big jump yesterday after the Motley Fool [published](https://ibb.co/PrJVJ5G) a long pitch for this company. I also own this stock and I believe it can become a very big player in the insurance business in the future. At the moment the company still only has a small market cap but I plan to own this for the long-term(5+years) as I expect great things from them. But don’t just rush today in the stock because it spiked 20%, wait for it to cool off, maybe dollar cost average on it.\n\nWhile I am very interested to see what Disney [announces](https://ibb.co/hZDjxwk) next week as they may give new information on how the streaming business is doing and what the plans for the company are looking forward as 30% of the revenues of the company came from parks in the last years. I don’t think that parks are ever going to be such a big part of the company as streaming and content production will lead the way. But I still like this company very much as it is one of my biggest portfolio holdings and I can see this stock rising to 170$ in the near future.\n\nA couple of companies released earnings yesterday as DocuSign [beat](https://ibb.co/znppzsn) the top and bottom line with billings coming in at $440M way over the consensus of $386M due to many more customers using the electronic signature to close contracts. While they also offered [guidance](https://ibb.co/34Hfnsz) for next quarter of around $404M to $408M also better than consensus at $387M as the stock is up 5% pre-market. \n\nWhile Marvell [missed](https://ibb.co/nCx5nHF) on expectations as the company cited supply issues constraints that are limiting the capability to satisfy demand. \n\nBad [news](https://ibb.co/yWJz3Kg) also came in for AMC with Warner’s decision to send all they’re 2021 movies directly to streaming on the same day as the theatrical release. This combined with the fact that AMC is filling to sell around [200M shares](https://ibb.co/Lkjkt5G), makes me think that this company is going to have the same route as Hertz. The cinema business wasn’t doing so great since 2017, and this might be the final blow for the industry.\n\nAnd one final thought, it might be a good opportunity to get long on Dave & Busters, Chewy, Adobe and Lululemon for next week, as I think they are all poised for good quarterly results. So, I will give all of them a small allocation today as I think there might be some good upside here in a few days, as there is a lot of money still on the sidelines with the most recent AAII asset [survey](https://ibb.co/7SRKkzk) showing that investors have more than 18% in cash on hands that can be pumped in the stock market.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "AMC & PFIZER NEWS | DOCUSIGN EARNINGS | LMND & DISNEY STOCK | STOCK MARKET NEWS [12-04]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k6ku79", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.96, "author_flair_background_color": null, "subreddit_type": "public", "ups": 20, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 20, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607117171.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>DocuSign crushes earnings and AMC may go bankrupt. Lemonade spiked yesterday over 20% while Pfizer confirmed delivery numbers, let’s talk about this and everything new in the stock market</strong></p>\n\n<p>Hey everyone! So, let’s start with the recap of yesterday as we saw the DOW leading the way up almost 0,3% with the <a href=\"https://ibb.co/G9JLH78\">NASDAQ COMPOSITE</a> close behind up 0,23% and finishing at a new record high while the broader market <a href=\"https://ibb.co/7rMK8RY\">SP500</a> finished barely down for the day. All 3 of them were trading a lot higher intraday before the most recent Pfizer <a href=\"https://ibb.co/qCXxh0Q\">news</a> popped up as they are only expected to ship half of the doses that were initially planned, but people spooked at this to much in my opinion. This thing was already known, when they published the candidate data in November, they also <a href=\"https://ibb.co/cDtdMCy\">announced</a> this number, but people runed away way to fast before going more into the data. Pfizer did not cut supply, they just explained why this happened in this latest headline. It is way better for companies to under-promise and over-deliver than the other way around.</p>\n\n<p>The <a href=\"https://ibb.co/HYrVJNH\">VIX</a> also saw a spike around the Pfizer news and finished higher for the day while 59% of companies were advancing with almost 150 new highs and just 3 new lows on below average volume of 11,5 billion shares compared to 11,7 billion shares in the last 20 trading days. <a href=\"https://ibb.co/6PVC7Lr\">CHART</a></p>\n\n<p>The best gaining <a href=\"https://ibb.co/2t3kk7m\">sectors</a> yesterday were Energy and Real Estate while Utilities finished more than 1% down for the day with small and mid-cap growth companies <a href=\"https://ibb.co/sP2rMzd\">leading</a> the way while the large-caps where lagging the market as you can see in this <a href=\"https://ibb.co/d2cJ7hZ\">HEAT MAP</a> as all the FAANG stocks were down with Microsoft also joining them. While TESLA continued to be red hot and Alibaba has finally regained some momentum.</p>\n\n<p>Here is the most important <a href=\"https://ibb.co/w6b2bxv\">ECONOMIC DATA</a> that will be released today as we will get nonfarm payrolls and unemployment rates in the early morning alongside the trade deficit, with Factory orders numbers coming in a bit latter. </p>\n\n<p>The <a href=\"https://ibb.co/7GrND6j\">FUTURES</a> are largely higher today not only in the US but also Europe is <a href=\"https://ibb.co/mXsLDSb\">gaining</a> momentum after Germany manufacturing <a href=\"https://ibb.co/9NVsjQw\">orders</a> rose for the sixth straight month in October and <a href=\"https://ibb.co/7zhQnDt\">Asia</a> as the global retail sector saw an <a href=\"https://ibb.co/k4dCN3f\">increase</a> of 30% in transactions with the whole Black Friday to Cyber Monday period doing very well this year.</p>\n\n<p>While yesterday we got numbers on the <a href=\"https://ibb.co/hcmvzgg\">NOVEMBER ISM</a> as it continued to a sixth straight month of expansion with employment being the biggest gainer in the index with even greater numbers coming in from the <a href=\"https://ibb.co/GHcFV4g\">PMI COMPOSITE</a> with the fastest growth since 2015 as employment rose at the fastest pace in the history of the survey.</p>\n\n<p>Also, the Jobless <a href=\"https://ibb.co/7txF4QQ\">claims</a> came in whey lower than expected at 712k more than 60k below estimated with continuing claims dropping for the first time in the last 9 months to under 6 million</p>\n\n<p>Meanwhile we also got some sales number for October in the <a href=\"https://ibb.co/VTy4BvP\">SEMI sector</a> yesterday, as sales had big increases Y/Y and M/M with all regions ramping up sales on a monthly basis. This is great news for companies like Nvidia, QCOM, AVGO and many more.</p>\n\n<p>Moving on to the auto sector the US light vehicle sales <a href=\"https://ibb.co/THKtD9y\">forecast</a> has seen an improved outlook for next year, up around 10% from 2020 at around 15.6 million with US <a href=\"https://ibb.co/Hdk0qqq\">EV SALES</a> increasing over 70% next year, this could be a huge boost to Tesla and other EV ramping up players like GM and FORD.</p>\n\n<p>This is great news for Tesla after a big bear on the company just <a href=\"https://ibb.co/25tcFhJ\">trimmed</a> his short position on TESLA</p>\n\n<p><a href=\"https://ibb.co/wLqdKCS\">Lemonade</a> had a big jump yesterday after the Motley Fool <a href=\"https://ibb.co/PrJVJ5G\">published</a> a long pitch for this company. I also own this stock and I believe it can become a very big player in the insurance business in the future. At the moment the company still only has a small market cap but I plan to own this for the long-term(5+years) as I expect great things from them. But don’t just rush today in the stock because it spiked 20%, wait for it to cool off, maybe dollar cost average on it.</p>\n\n<p>While I am very interested to see what Disney <a href=\"https://ibb.co/hZDjxwk\">announces</a> next week as they may give new information on how the streaming business is doing and what the plans for the company are looking forward as 30% of the revenues of the company came from parks in the last years. I don’t think that parks are ever going to be such a big part of the company as streaming and content production will lead the way. But I still like this company very much as it is one of my biggest portfolio holdings and I can see this stock rising to 170$ in the near future.</p>\n\n<p>A couple of companies released earnings yesterday as DocuSign <a href=\"https://ibb.co/znppzsn\">beat</a> the top and bottom line with billings coming in at $440M way over the consensus of $386M due to many more customers using the electronic signature to close contracts. While they also offered <a href=\"https://ibb.co/34Hfnsz\">guidance</a> for next quarter of around $404M to $408M also better than consensus at $387M as the stock is up 5% pre-market. </p>\n\n<p>While Marvell <a href=\"https://ibb.co/nCx5nHF\">missed</a> on expectations as the company cited supply issues constraints that are limiting the capability to satisfy demand. </p>\n\n<p>Bad <a href=\"https://ibb.co/yWJz3Kg\">news</a> also came in for AMC with Warner’s decision to send all they’re 2021 movies directly to streaming on the same day as the theatrical release. This combined with the fact that AMC is filling to sell around <a href=\"https://ibb.co/Lkjkt5G\">200M shares</a>, makes me think that this company is going to have the same route as Hertz. The cinema business wasn’t doing so great since 2017, and this might be the final blow for the industry.</p>\n\n<p>And one final thought, it might be a good opportunity to get long on Dave &amp; Busters, Chewy, Adobe and Lululemon for next week, as I think they are all poised for good quarterly results. So, I will give all of them a small allocation today as I think there might be some good upside here in a few days, as there is a lot of money still on the sidelines with the most recent AAII asset <a href=\"https://ibb.co/7SRKkzk\">survey</a> showing that investors have more than 18% in cash on hands that can be pumped in the stock market.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/y9g71MnqLkf03XKsSmxH_i1UGk4sA7wMPKgPIi4Bc3k.jpg?auto=webp&s=6374bb78d8de00fc75e33636a9f7cc9bdaade250", "width": 895, "height": 470}, "resolutions": [{"url": "https://external-preview.redd.it/y9g71MnqLkf03XKsSmxH_i1UGk4sA7wMPKgPIi4Bc3k.jpg?width=108&crop=smart&auto=webp&s=b4e01be465f6e38b48410c58b0250cec98ed95b9", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/y9g71MnqLkf03XKsSmxH_i1UGk4sA7wMPKgPIi4Bc3k.jpg?width=216&crop=smart&auto=webp&s=928598c20250081cb5423b30b6a6b52995bfffc3", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/y9g71MnqLkf03XKsSmxH_i1UGk4sA7wMPKgPIi4Bc3k.jpg?width=320&crop=smart&auto=webp&s=82b07538c305c4ed26848c05e3f4060b95985489", "width": 320, "height": 168}, {"url": "https://external-preview.redd.it/y9g71MnqLkf03XKsSmxH_i1UGk4sA7wMPKgPIi4Bc3k.jpg?width=640&crop=smart&auto=webp&s=58f7a625eb74694812190bbe066180486917a844", "width": 640, "height": 336}], "variants": {}, "id": "Plcx2QV-0s1Ej34VS8GLbaaY613W-tbtdf7If6NavVw"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "k6ku79", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 13, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/", "subreddit_subscribers": 1653658, "created_utc": 1607088371.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geldufy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Sebacuda", "fullname": "t2_5qgpq1e3"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k6ku79", "score": 5, "author_fullname": "t2_5qgpq1e3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "This is why I come here.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This is why I come here.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/geldufy/", "num_reports": null, "locked": false, "name": "t1_geldufy", "created": 1607117704.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607088904.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "geldvz0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_geldufy", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "$$$$$", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>$$$$$</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/geldvz0/", "num_reports": null, "locked": false, "name": "t1_geldvz0", "created": 1607117733.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607088933.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gelej8m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "DoubleKillGG", "fullname": "t2_mwj5y"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k6ku79", "score": 3, "author_fullname": "t2_mwj5y", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Market makers are propping up AMC in pre-market. Regular hours will show us how markets react the day after yesterday's news.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Market makers are propping up AMC in pre-market. Regular hours will show us how markets react the day after yesterday&#39;s news.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/gelej8m/", "num_reports": null, "locked": false, "name": "t1_gelej8m", "created": 1607118121.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607089321.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gelf2ke", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "DataNerdling", "fullname": "t2_45uhdncn"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gelej8m", "score": 2, "author_fullname": "t2_45uhdncn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Happened during trading hours, down 20%", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Happened during trading hours, down 20%</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/gelf2ke/", "num_reports": null, "locked": false, "name": "t1_gelf2ke", "created": 1607118461.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607089661.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gelfer0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "DoubleKillGG", "fullname": "t2_mwj5y"}, "can_mod_post": false, "created_utc": 1607089871.0, "send_replies": true, "parent_id": "t1_gelf2ke", "score": 2, "author_fullname": "t2_mwj5y", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Yes, I know..", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Yes, I know..</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/gelfer0/", "num_reports": null, "locked": false, "name": "t1_gelfer0", "created": 1607118671.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gelfjcd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gelej8m", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Anything can happen in the short term, but i think they will go just like Hertz eventually", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Anything can happen in the short term, but i think they will go just like Hertz eventually</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/gelfjcd/", "num_reports": null, "locked": false, "name": "t1_gelfjcd", "created": 1607118750.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607089950.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k6ku79", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "gelcxm5", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_k6ku79", "score": 2, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k6ku79/amc_pfizer_news_docusign_earnings_lmnd_disney/gelcxm5/", "num_reports": null, "locked": false, "name": "t1_gelcxm5", "created": 1607117172.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1607088372.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}]}