{"approved_at_utc": null, "selftext": "With all the IPO craze weve been seeing right now, its kinda hard to recommend anyone buying into them.( still kinda chocked to see that this opened at 250%.) In fact, ive been recommending more people to move into SPAC plays instead because of the limited downside and room for price discovery especially for the retail investors like us. Investing in a good spac near nav is literally a no brainer and free tendies. That being said, since I have already done the research and a write up for Abcellera, might as well share it with everyone. Please keep in mind that im not recommending people buying into nor do I have a position in this stock. To be quite frankly, no way in hell should this company be trading at such level yet, at least not in another few years to come. But here you go:\n\nWe are talking about a company **backed by Bill Gates and has Peter Thiel as the board of director to bring the table experience in scaling technology companies (Daddy Thiel actually owns a stake of the company)**. Abcellera is a company **that helped Lily with the development of the antibody cocktail for COVID at a record-breaking speed** and is entitled to receive percentage of the proceeds that Lily receives from the sales. Currently US government has secured 300,000 does with the option to secure 70,000 more and Canada has secured 26,000 doses with more to come. **Abcellera has been cash flow positive every year since inception and has shown an annual revenue growth rate of 100% over the past 5 years and is here to print ya’ll motherfuckers some real serious tendies.**\n\nAbout Abcellera\n\nAbcellera is a technology company that searches, decodes, and analyzes natural immune systems to find antibodies that can be developed to prevent and treat disease through artificial intelligence, machine learning and advanced technology platform. **Traditional biotech industries usually take too long, cost too much and fails way too often. Drugs discovery usually takes 5 to 15 years with less than 5% success rate and cost billions of dollars to find approved molecules. Abcellera provides the teams and technologies that work broadly with the biotech industries to put the best science and best innovator in touch with the best technology to get faster drugs to patients.** Abcellera essentially **solves the two fundamental problems that hinder the discovery and the development of next generation antibody- based therapeutics. The first is the technology: because of the limitations of legacy discovery approaches, there are many well validated targets for which suitable antibodies cannot be found. The second is access: most companies are forced to cobble together fragmented solutions and lack the facilities and expertise needed to prosecute their antibody programs. Both problems contribute to the rising cost of drug development and delay brining needed therapies to patients.** With the leverage of Abcellera’s technology, Eli Lily was able to put out COVID-19 antibody cocktail to trials within a record-breaking speed of just 3 months. Abcellera was able screen through 5.5mil + immune cells to see which makes antibodies on Day 4, find 2K+ potential antibodies that could stick to the virus surface on Day 6, sequence through DNA of 500+ antibodies that could stick to virus spike protein on Day 9, select 190 most promising antibodies for potency testing on Day 17, and finally select 24 antibody front runners for Eli Lily to further develop them into antibody cocktail. Within the past 3 years, **Abcellera has already accrued more than 40 deals, engaged in 94 discovery programs, and under contracted with 26 partners.** **With validation from the partnerships with major biotech firms, it signifies the effectiveness and the reliability of the platform setting Abcellera up for a more lucrative terms and deals in the future.** Through the partnership agreements, Abcellera **will collect near-term payment for technology access, research and intellectual property right, and downstream payments in form of clinical and commercial milestones and royalties on net sales. (Three parts income source model)**\n\n🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕\n\nHow big is antibody therapy?\n\nAntibody therapy has already been one of the biggest discoveries and is not a thing of the future rather the thing of the present. In 2019\\*\\*, 7 out of 10 of the best-selling drugs were monoclonal antibodies.\\*\\* **The global therapeutic monoclonal antibody market has been valued at 150bil by the end of 2019 and 300bil by 2025** with many drugs already approved for treating cancers, autoimmune, metabolic and infectious diseases.\n\nCompetitive landscape\n\nAlthough there are a few of companies developing antibody therapy drugs, they are not the direct competitors of Abcellera. **The purpose of Abcellera is to provide the technology for the biotech companies especially the small to medium firms the ability to compete on the same playing field as the big boys or act as a more cost-effective way of developing new drugs.** (Think of it as the biotech version of TSMC where it provides AMD the ability to compete or over taking Intel, or acts as a more cost-effective ways for chip designers like Apple and Qualcomm to push out chips.) **Over 90% of the antibody market is dominated by 8 companies and Abcellera is here to shake the ground.**\n\nNotable highlights and future plans for the past months:\n\n\\- Named on the fierce biotech’s fierce 15 list company of 2020\n\n\\- Partnership with Invetx to develop new antibody therapies to improve the quality of life of animals and to bring next generation veterinary therapeutics to the market\n\n\\- Partnership with Kodiak science to develop eye disease antibodies\n\n\\- Partnership with IGM biosciences\n\n\\- Acquisition of Ttianni ( a company for developing humanized mice that is designed to maximize immune responses, increase antibody diversity, and preserve natural mutation of fully human antibodies in rodents)\n\n\\- Acquisition of OrthMab (a clinically validated platform that uses the most advanced computational and experimental protein engineering methods to create bispecific antibodies from any two antibody sequences.)", "author_fullname": "t2_hs2gc", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "$ABCL opened up 200% - Is it a falling knife or a ticket to moon? 🚀🌕", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_kb7p2u", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.92, "author_flair_background_color": null, "subreddit_type": "public", "ups": 11, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 11, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1607738306.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>With all the IPO craze weve been seeing right now, its kinda hard to recommend anyone buying into them.( still kinda chocked to see that this opened at 250%.) In fact, ive been recommending more people to move into SPAC plays instead because of the limited downside and room for price discovery especially for the retail investors like us. Investing in a good spac near nav is literally a no brainer and free tendies. That being said, since I have already done the research and a write up for Abcellera, might as well share it with everyone. Please keep in mind that im not recommending people buying into nor do I have a position in this stock. To be quite frankly, no way in hell should this company be trading at such level yet, at least not in another few years to come. But here you go:</p>\n\n<p>We are talking about a company <strong>backed by Bill Gates and has Peter Thiel as the board of director to bring the table experience in scaling technology companies (Daddy Thiel actually owns a stake of the company)</strong>. Abcellera is a company <strong>that helped Lily with the development of the antibody cocktail for COVID at a record-breaking speed</strong> and is entitled to receive percentage of the proceeds that Lily receives from the sales. Currently US government has secured 300,000 does with the option to secure 70,000 more and Canada has secured 26,000 doses with more to come. <strong>Abcellera has been cash flow positive every year since inception and has shown an annual revenue growth rate of 100% over the past 5 years and is here to print ya’ll motherfuckers some real serious tendies.</strong></p>\n\n<p>About Abcellera</p>\n\n<p>Abcellera is a technology company that searches, decodes, and analyzes natural immune systems to find antibodies that can be developed to prevent and treat disease through artificial intelligence, machine learning and advanced technology platform. <strong>Traditional biotech industries usually take too long, cost too much and fails way too often. Drugs discovery usually takes 5 to 15 years with less than 5% success rate and cost billions of dollars to find approved molecules. Abcellera provides the teams and technologies that work broadly with the biotech industries to put the best science and best innovator in touch with the best technology to get faster drugs to patients.</strong> Abcellera essentially <strong>solves the two fundamental problems that hinder the discovery and the development of next generation antibody- based therapeutics. The first is the technology: because of the limitations of legacy discovery approaches, there are many well validated targets for which suitable antibodies cannot be found. The second is access: most companies are forced to cobble together fragmented solutions and lack the facilities and expertise needed to prosecute their antibody programs. Both problems contribute to the rising cost of drug development and delay brining needed therapies to patients.</strong> With the leverage of Abcellera’s technology, Eli Lily was able to put out COVID-19 antibody cocktail to trials within a record-breaking speed of just 3 months. Abcellera was able screen through 5.5mil + immune cells to see which makes antibodies on Day 4, find 2K+ potential antibodies that could stick to the virus surface on Day 6, sequence through DNA of 500+ antibodies that could stick to virus spike protein on Day 9, select 190 most promising antibodies for potency testing on Day 17, and finally select 24 antibody front runners for Eli Lily to further develop them into antibody cocktail. Within the past 3 years, <strong>Abcellera has already accrued more than 40 deals, engaged in 94 discovery programs, and under contracted with 26 partners.</strong> <strong>With validation from the partnerships with major biotech firms, it signifies the effectiveness and the reliability of the platform setting Abcellera up for a more lucrative terms and deals in the future.</strong> Through the partnership agreements, Abcellera <strong>will collect near-term payment for technology access, research and intellectual property right, and downstream payments in form of clinical and commercial milestones and royalties on net sales. (Three parts income source model)</strong></p>\n\n<p>🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕🚀🌕</p>\n\n<p>How big is antibody therapy?</p>\n\n<p>Antibody therapy has already been one of the biggest discoveries and is not a thing of the future rather the thing of the present. In 2019**, 7 out of 10 of the best-selling drugs were monoclonal antibodies.** <strong>The global therapeutic monoclonal antibody market has been valued at 150bil by the end of 2019 and 300bil by 2025</strong> with many drugs already approved for treating cancers, autoimmune, metabolic and infectious diseases.</p>\n\n<p>Competitive landscape</p>\n\n<p>Although there are a few of companies developing antibody therapy drugs, they are not the direct competitors of Abcellera. <strong>The purpose of Abcellera is to provide the technology for the biotech companies especially the small to medium firms the ability to compete on the same playing field as the big boys or act as a more cost-effective way of developing new drugs.</strong> (Think of it as the biotech version of TSMC where it provides AMD the ability to compete or over taking Intel, or acts as a more cost-effective ways for chip designers like Apple and Qualcomm to push out chips.) <strong>Over 90% of the antibody market is dominated by 8 companies and Abcellera is here to shake the ground.</strong></p>\n\n<p>Notable highlights and future plans for the past months:</p>\n\n<p>- Named on the fierce biotech’s fierce 15 list company of 2020</p>\n\n<p>- Partnership with Invetx to develop new antibody therapies to improve the quality of life of animals and to bring next generation veterinary therapeutics to the market</p>\n\n<p>- Partnership with Kodiak science to develop eye disease antibodies</p>\n\n<p>- Partnership with IGM biosciences</p>\n\n<p>- Acquisition of Ttianni ( a company for developing humanized mice that is designed to maximize immune responses, increase antibody diversity, and preserve natural mutation of fully human antibodies in rodents)</p>\n\n<p>- Acquisition of OrthMab (a clinically validated platform that uses the most advanced computational and experimental protein engineering methods to create bispecific antibodies from any two antibody sequences.)</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kb7p2u", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "ShutterLeaf", "fullname": "t2_hs2gc"}, "discussion_type": null, "num_comments": 15, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/", "subreddit_subscribers": 1690385, "created_utc": 1607709506.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff0l9p", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "zaiyan_alam", "fullname": "t2_2fja204a"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb7p2u", "score": 10, "author_fullname": "t2_2fja204a", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Huge loss!", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Huge loss!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff0l9p/", "num_reports": null, "locked": false, "name": "t1_gff0l9p", "created": 1607738476.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607709676.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff24de", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "CrazyGlueSniffer", "fullname": "t2_ok070"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gff0l9p", "score": 7, "author_fullname": "t2_ok070", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Taking it square in the pooper right now.  Hoping for a bounce but definitely went full tard at 100 @ 62.54 at the open.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Taking it square in the pooper right now.  Hoping for a bounce but definitely went full tard at 100 @ 62.54 at the open.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff24de/", "num_reports": null, "locked": false, "name": "t1_gff24de", "created": 1607739084.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607710284.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff81n9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ShutterLeaf", "fullname": "t2_hs2gc"}, "can_mod_post": false, "created_utc": 1607712078.0, "send_replies": true, "parent_id": "t1_gff24de", "score": 2, "author_fullname": "t2_hs2gc", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "fomo is not the play here my dood. patience is the play.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>fomo is not the play here my dood. patience is the play.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff81n9/", "num_reports": null, "locked": false, "name": "t1_gff81n9", "created": 1607740878.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gffbgqv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "CrazyGlueSniffer", "fullname": "t2_ok070"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gff81n9", "score": 1, "author_fullname": "t2_ok070", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I’m paying a small price for a valuable reminder.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I’m paying a small price for a valuable reminder.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gffbgqv/", "num_reports": null, "locked": false, "name": "t1_gffbgqv", "created": 1607741938.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607713138.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff13fi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ShutterLeaf", "fullname": "t2_hs2gc"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gff0l9p", "score": 5, "author_fullname": "t2_hs2gc", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "oooof the dip LOL", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>oooof the dip LOL</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff13fi/", "num_reports": null, "locked": false, "name": "t1_gff13fi", "created": 1607738711.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607709911.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 9, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff0srk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Sweet-Zookeepergame", "fullname": "t2_5f5ps304"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb7p2u", "score": 9, "author_fullname": "t2_5f5ps304", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I can’t buy it at my broker so I can just sit and enjoy watching loss porn.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I can’t buy it at my broker so I can just sit and enjoy watching loss porn.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff0srk/", "num_reports": null, "locked": false, "name": "t1_gff0srk", "created": 1607738574.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607709774.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff11sg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ShutterLeaf", "fullname": "t2_hs2gc"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gff0srk", "score": 8, "author_fullname": "t2_hs2gc", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "bruh im glad that saved your ass from yoloing in.  im still sitting here in disbelief that this opened up at 200% and went up as much as 250%. Glad that's its dipping hard though. People should learn how not to fomo in on institutes dumping crap on us while they walk away with double their net worth.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>bruh im glad that saved your ass from yoloing in.  im still sitting here in disbelief that this opened up at 200% and went up as much as 250%. Glad that&#39;s its dipping hard though. People should learn how not to fomo in on institutes dumping crap on us while they walk away with double their net worth.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff11sg/", "num_reports": null, "locked": false, "name": "t1_gff11sg", "created": 1607738690.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607709890.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff3t5v", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "YFPepsi", "fullname": "t2_fr9g1"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb7p2u", "score": 2, "author_fullname": "t2_fr9g1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "What would a good buy in price be?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>What would a good buy in price be?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff3t5v/", "num_reports": null, "locked": false, "name": "t1_gff3t5v", "created": 1607739592.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607710792.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb7p2u", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gff4t05", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "ShutterLeaf", "fullname": "t2_hs2gc"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gff3t5v", "score": 2, "author_fullname": "t2_hs2gc", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "its hard to recommend a good price to get in with the current landscape but i do believe this is a good long term hold. I think it might dip a bit more from the current level once the ipo, thiel and covid cocktail hype fades away. At this point, we just need to wait for more feedback from the existing partners to fairly evaluate this company.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>its hard to recommend a good price to get in with the current landscape but i do believe this is a good long term hold. I think it might dip a bit more from the current level once the ipo, thiel and covid cocktail hype fades away. At this point, we just need to wait for more feedback from the existing partners to fairly evaluate this company.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb7p2u/abcl_opened_up_200_is_it_a_falling_knife_or_a/gff4t05/", "num_reports": null, "locked": false, "name": "t1_gff4t05", "created": 1607739891.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607711091.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}