{"approved_at_utc": null, "selftext": "Greetings fellow retards,\n\nI would like to submit for your consideration the following hypothesis: **a spin-off of a Financial Crime Enforcement division from within Stripe as a publicly owned company through Bill Ackman's SPAC.**\n\nAfter having my mind totally shattered the last few days by watching some of the most insane biopharma pumping and dumping upon the Actual Stupids that inhabit stocktwits.com go down in real time (and getting banned from the platform in the process), I decided to clear my head for a while and then have a good think about the forgotten jewel of my autistic eye, Pershing Square Tontine Holdings.\n\nThis hypothesis should be read as an optimist's case that could possibly tie together a number of disparate threads into a sort of unified field theory about the roles that a SPAC like PSTH specifically and an infrastructure behemoth like Stripe will have in building the economic future of the internet. If you feel like immediately dismissing this post because of [this exchange](https://imgur.com/azcdTT3) or because your brain don't work good for other reasons, please exit the 🚀 immediately.\n\nTo start with [Bill Ackman](https://imgur.com/a/wwofHhU), I mean, just look at the man. You would let this silver fox impregnate your wife if he showed up at the door because you are, like me, A F*gg0t Who Cares Too Much (or if you please, a 🌈🐻). It'd probably make her happy and you'd get a kid way smarter than the wretched spawn you've loosed from your own loins out of the deal, too.\n\nAnyway, for those who somehow still don't know this, Ackman is an activist investor and one of the more unconventional thinkers operating in the cesspool known as Wall Street. He's probably best known for two things: 1) his COVID crash short that was a [literal hundred bagger] (https://www.forbes.com/sites/antoinegara/2020/03/25/billionaire-bill-ackman-100-fold-return-on-coronavirus-hedge-2-billion/?sh=6f49d29e6fcc) and 2) a short position that blew up in his face to the tune of $1 billion, which he took against the very cool and very legal company that is definitely not a pyramid scheme, Herbalife. This dude is so autistic that he 💎👐 a [$300 million gain into a billion dollar loss trying to strangle the company.](https://imgur.com/GjAOQVp)\n\nIf you've been paying attention to Ackman's last few days on Twitter, [he's been busy putting the screws to the big credit card companies](https://imgur.com/ZHsjkAP), with some apparent [success](https://imgur.com/kOq2H8E), for servicing Pornhub, known destination for pedo creeps. As someone who has spent the last year and a half slowly losing sanity while learning as much as I can about one [Jeffrey Edward Epstein](https://en.wikipedia.org/wiki/Jeffrey_Epstein), a network of events and financial institutions that support this hypothesis starts to take shape here.\n\nFamously, Epstein hung around a lot of people at the highest echelons of so-called \"polite\" society, appears to have been some kind of intelligence honeypot meant to blackmail sick rich fucks (look up the origins of the CIA if you want to know more about this), and [most definitely did not kill himself with the toilet paper thin sheets that they give you in the clink](https://www.dailymail.co.uk/news/article-7855039/Graphic-photos-Jeffrey-Epsteins-autopsy-reveal-bloodied-neck.html) **(warning: dead guy pics within)**. He had close working relationships with [JP Morgan Chase](https://www.nytimes.com/2019/07/22/business/jeffrey-epstein-business-wall-street.html) and [Deutsche Bank](https://www.cnbc.com/2020/07/07/jeffrey-epstein-case-deutsche-bank-fined-150-million-penalty-for-relationship.html), which both have [conspicuously small positions](https://imgur.com/b4dOMkL) in PSTH, as well as [Goldman Sachs](https://www.wsj.com/articles/jeffrey-epstein-burrowed-into-the-lives-of-the-rich-and-made-a-fortune-11564092553), which is totally absent. I should probably note [that Ackman's wife did receive some Epstein bucks through the MIT Media Lab](https://www.artnews.com/art-news/news/neri-oxman-jeffrey-epstein-13236/) and that Ackman looks to have tried to [bury that story,](https://www.axios.com/joi-jeffrey-epstein-ties-mit-media-lab-professor-8384aa42-32d4-42dc-a0eb-54e23bcdee3a.html) which is ***very not cool***. Anyway, enough about Epstein (go listen to TrueAnon if you want to get yourself some of the same psychic damage that I have about him 👁). \n\nBank ownership of PSTH seems weirdly low in general except for [Wells Fargo](https://imgur.com/I3mrEiM), which strikes me as odd when considering that the top known holder of PSTH is Guggenheim, which has been historically [jacked to the tits](https://imgur.com/gRaf649) with holdings from the finance sector, but trimmed those positions considerably after the financial crisis.\n\nBy this point you may be finding yourself asking \"how the fuck does all this relate to Stripe, you schizoid freak?\" to which my response is that the [banks themselves](https://www.icij.org/investigations/fincen-files/) are the biggest financial crime doers in the world and with institutions like [Deutsche and JP Morgan](https://www.bloomberg.com/news/articles/2020-09-21/highlights-from-the-fincen-files-on-banks-suspect-transactions) being particularly egregious offenders, Ackman could be using his big fucking brain to cook up the future of public accountability in finance.\n\nConsider the recent toothlessness of the organizations theoretically in charge of maintaining compliance with financial laws. There are examples that directly are relevant to everyone here who uses Robinhood (which picked [fucking Goldman Sachs](https://www.reuters.com/article/robinhood-ipo/exclusive-trading-app-robinhood-hires-goldman-sachs-to-lead-ipo-sources-idUSL1N2IO2TN) to lead their IPO). This includes their failure to disclose their practice of [selling order flow](https://www.wsj.com/articles/why-free-trading-on-robinhood-isnt-really-free-1541772001), for which they were fined a [piddly $1.25 million by FINRA](https://www.finra.org/media-center/newsreleases/2019/finra-fines-robinhood-financial-llc-125-million-best-execution). Robinhood's [top buyer of order flow is a little company called Citadel,](https://www.institutionalinvestor.com/article/b1m2p1cv68bx56/Twitter-Freaked-Out-Over-Robinhood-Selling-Its-Trade-Flow-But-the-App-and-Others-Have-Been-Doing-It-for-Years) which was fined [a mere $700,000](https://imgur.com/0yT6vpJ) for using this data to snipe retail orders from retards like you and your cousin Billy using [high frequency trading algorithms](https://www.investopedia.com/articles/investing/091615/world-high-frequency-algorithmic-trading.asp), which is called frontrunning and is ***extremely not cool and extremely not legal*** (but crime definitely pays). For a company whose literal mission statement is to [\"democratize finance for all,\"](https://robinhood.com/us/en/support/articles/our-mission/) Robinhood sure does seem to put their finger on the scale in ways that unquestionably favor the big guys and by extension, themselves. By the way, the concept of selling order flow was invented by a dude you may have heard of who is currently serving a 150 year sentence for running a giant Ponzi scheme and will well-deservedly die in prison in the middle of Fucking Nowhere, [Bernard Madoff](https://www.investopedia.com/terms/p/paymentoforderflow.asp). Don't you wish the regulators would get off their knees, get the market maker dicks out of their mouths, and do their jobs?\n\nNow we return to Stripe. If you've ever bought anything on the internet, you've probably used Stripe to process the payment, even if you didn't realize it at the time. Stripe could wind up being one of the biggest and most valuable companies in the world if they play their cards right, and big brain haver [Paul Graham thinks they could wind up being the next Google in terms of valuation.](https://imgur.com/am4ONjr) Stripe is thought to [be valued somewhere from $70-100 billion right now](https://techcrunch.com/2020/11/28/what-to-make-of-stripes-possible-100-billion-valuation/), and we know that Ackman has about $7 billion in his war chest. I'd wager it's likely that the recent spate of IPOs by dog shit companies like AirBnB and DoorDash giving them ~$80 billion and ~$55 billion market caps respectively pushes Stripe's valuation toward the higher end of those current valuation estimates. Even the NPCs at /r/stocks are starting to figure out that something's fishy with [IPOs.](https://old.reddit.com/r/stocks/comments/kbbf2e/the_amount_of_insider_trading_with_ipos_is/) Also take note of the second tweet in that Paul Graham screenshot, because it strikes me as being not altogether dissimilar to what Ackman has previously said about what he thinks was his biggest miss going long, [Mastercard](https://www.youtube.com/watch?v=gxqTwpWizw4).\n\nStripe offers an [expansive and rapidly growing](https://imgur.com/OUSWYZi) anti-financial crimes platform called [Radar](https://stripe.com/radar) and is actively hiring for roles that seem like they'll be mission critical for the future of a company that's growing globally like [this one](https://stripe.com/jobs/listing/financial-crimes-investigation-payment-methods-lead-apac-chinese-speaker/2351914). They've already built the infrastructure that huge swathes of the internet economy run on and they're just getting rolling. \n\nGiven the levels of utter incompetence bordering on malfeasance by the syphilitic boomers with worm-filled brains that supposedly regulate finance, is it so implausible that an avowed optimist and guy who definitely thinks about this stuff more than you, [Patrick Collison,](https://imgur.com/5zwzFPm) would team up with the man running the [most investor-friendly SPAC ever](https://www.cnbc.com/2020/07/22/ackman-pershing-square-taking-no-compensation-for-new-spac-investment-vehicle.html) to truly bring the fight for equality of financial opportunity to the free market? I don't think so. Such an act would help subvert the power of creeps like [Ken Griffin](https://en.wikipedia.org/wiki/Kenneth_C._Griffin), who almost certainly believes that you and everyone you love are pathetic little worms that live in a world belonging to him and his buddies.\n\n**TLDR: An offshoot of Stripe could still be the target and the merger of PSTH with Stripe Radar as an independent, publicly owned entity, could be a step toward truly democratizing the markets and saving America and the rest of the world from the leviathan of Big Capital.** \n\n\nPositions: short puts and long shares + March calls of PSTH in my active trading account, along with ~25% of my Roth IRA currently allocated to PSTH shares with the intention to sell about half of my mutual fund holdings after the next dividend goes out and put all of that money into PSTH.\n\nDisclaimer: I am retarded and this is not financial advice. Sorry for any typos that still exist, I proofread this a bunch of times and I tried my best.\n\nP.S: if I die for any reason after making this post, please do not accept the coroner's conclusion, because it means JP Morgan and Deutsche probably sent their hitters after me.\n\n\n\nedit: cleaned up some typos like [this guy](https://old.reddit.com/r/RobinHoodPennyStocks/comments/kb2rqc/presentation_of_sls_the_play/) cleaned out a bunch of people's Robinhood accounts yesterday. I'm watching you /u/JustSomeStonksBoi 👁\n\nedit2: added a citation for the Herbalife short (it's wikipedia, suck my dick, i've given you enough)", "author_fullname": "t2_6a319a90", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "An alternative hypothesis for PSTH + Stripe, for the betterment of the world", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kbjpqy", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.78, "author_flair_background_color": null, "subreddit_type": "public", "ups": 35, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 35, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1607766621.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607780550.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Greetings fellow retards,</p>\n\n<p>I would like to submit for your consideration the following hypothesis: <strong>a spin-off of a Financial Crime Enforcement division from within Stripe as a publicly owned company through Bill Ackman&#39;s SPAC.</strong></p>\n\n<p>After having my mind totally shattered the last few days by watching some of the most insane biopharma pumping and dumping upon the Actual Stupids that inhabit stocktwits.com go down in real time (and getting banned from the platform in the process), I decided to clear my head for a while and then have a good think about the forgotten jewel of my autistic eye, Pershing Square Tontine Holdings.</p>\n\n<p>This hypothesis should be read as an optimist&#39;s case that could possibly tie together a number of disparate threads into a sort of unified field theory about the roles that a SPAC like PSTH specifically and an infrastructure behemoth like Stripe will have in building the economic future of the internet. If you feel like immediately dismissing this post because of <a href=\"https://imgur.com/azcdTT3\">this exchange</a> or because your brain don&#39;t work good for other reasons, please exit the 🚀 immediately.</p>\n\n<p>To start with <a href=\"https://imgur.com/a/wwofHhU\">Bill Ackman</a>, I mean, just look at the man. You would let this silver fox impregnate your wife if he showed up at the door because you are, like me, A F*gg0t Who Cares Too Much (or if you please, a 🌈🐻). It&#39;d probably make her happy and you&#39;d get a kid way smarter than the wretched spawn you&#39;ve loosed from your own loins out of the deal, too.</p>\n\n<p>Anyway, for those who somehow still don&#39;t know this, Ackman is an activist investor and one of the more unconventional thinkers operating in the cesspool known as Wall Street. He&#39;s probably best known for two things: 1) his COVID crash short that was a <a href=\"https://www.forbes.com/sites/antoinegara/2020/03/25/billionaire-bill-ackman-100-fold-return-on-coronavirus-hedge-2-billion/?sh=6f49d29e6fcc\">literal hundred bagger</a> and 2) a short position that blew up in his face to the tune of $1 billion, which he took against the very cool and very legal company that is definitely not a pyramid scheme, Herbalife. This dude is so autistic that he 💎👐 a <a href=\"https://imgur.com/GjAOQVp\">$300 million gain into a billion dollar loss trying to strangle the company.</a></p>\n\n<p>If you&#39;ve been paying attention to Ackman&#39;s last few days on Twitter, <a href=\"https://imgur.com/ZHsjkAP\">he&#39;s been busy putting the screws to the big credit card companies</a>, with some apparent <a href=\"https://imgur.com/kOq2H8E\">success</a>, for servicing Pornhub, known destination for pedo creeps. As someone who has spent the last year and a half slowly losing sanity while learning as much as I can about one <a href=\"https://en.wikipedia.org/wiki/Jeffrey_Epstein\">Jeffrey Edward Epstein</a>, a network of events and financial institutions that support this hypothesis starts to take shape here.</p>\n\n<p>Famously, Epstein hung around a lot of people at the highest echelons of so-called &quot;polite&quot; society, appears to have been some kind of intelligence honeypot meant to blackmail sick rich fucks (look up the origins of the CIA if you want to know more about this), and <a href=\"https://www.dailymail.co.uk/news/article-7855039/Graphic-photos-Jeffrey-Epsteins-autopsy-reveal-bloodied-neck.html\">most definitely did not kill himself with the toilet paper thin sheets that they give you in the clink</a> <strong>(warning: dead guy pics within)</strong>. He had close working relationships with <a href=\"https://www.nytimes.com/2019/07/22/business/jeffrey-epstein-business-wall-street.html\">JP Morgan Chase</a> and <a href=\"https://www.cnbc.com/2020/07/07/jeffrey-epstein-case-deutsche-bank-fined-150-million-penalty-for-relationship.html\">Deutsche Bank</a>, which both have <a href=\"https://imgur.com/b4dOMkL\">conspicuously small positions</a> in PSTH, as well as <a href=\"https://www.wsj.com/articles/jeffrey-epstein-burrowed-into-the-lives-of-the-rich-and-made-a-fortune-11564092553\">Goldman Sachs</a>, which is totally absent. I should probably note <a href=\"https://www.artnews.com/art-news/news/neri-oxman-jeffrey-epstein-13236/\">that Ackman&#39;s wife did receive some Epstein bucks through the MIT Media Lab</a> and that Ackman looks to have tried to <a href=\"https://www.axios.com/joi-jeffrey-epstein-ties-mit-media-lab-professor-8384aa42-32d4-42dc-a0eb-54e23bcdee3a.html\">bury that story,</a> which is <strong><em>very not cool</em></strong>. Anyway, enough about Epstein (go listen to TrueAnon if you want to get yourself some of the same psychic damage that I have about him 👁). </p>\n\n<p>Bank ownership of PSTH seems weirdly low in general except for <a href=\"https://imgur.com/I3mrEiM\">Wells Fargo</a>, which strikes me as odd when considering that the top known holder of PSTH is Guggenheim, which has been historically <a href=\"https://imgur.com/gRaf649\">jacked to the tits</a> with holdings from the finance sector, but trimmed those positions considerably after the financial crisis.</p>\n\n<p>By this point you may be finding yourself asking &quot;how the fuck does all this relate to Stripe, you schizoid freak?&quot; to which my response is that the <a href=\"https://www.icij.org/investigations/fincen-files/\">banks themselves</a> are the biggest financial crime doers in the world and with institutions like <a href=\"https://www.bloomberg.com/news/articles/2020-09-21/highlights-from-the-fincen-files-on-banks-suspect-transactions\">Deutsche and JP Morgan</a> being particularly egregious offenders, Ackman could be using his big fucking brain to cook up the future of public accountability in finance.</p>\n\n<p>Consider the recent toothlessness of the organizations theoretically in charge of maintaining compliance with financial laws. There are examples that directly are relevant to everyone here who uses Robinhood (which picked <a href=\"https://www.reuters.com/article/robinhood-ipo/exclusive-trading-app-robinhood-hires-goldman-sachs-to-lead-ipo-sources-idUSL1N2IO2TN\">fucking Goldman Sachs</a> to lead their IPO). This includes their failure to disclose their practice of <a href=\"https://www.wsj.com/articles/why-free-trading-on-robinhood-isnt-really-free-1541772001\">selling order flow</a>, for which they were fined a <a href=\"https://www.finra.org/media-center/newsreleases/2019/finra-fines-robinhood-financial-llc-125-million-best-execution\">piddly $1.25 million by FINRA</a>. Robinhood&#39;s <a href=\"https://www.institutionalinvestor.com/article/b1m2p1cv68bx56/Twitter-Freaked-Out-Over-Robinhood-Selling-Its-Trade-Flow-But-the-App-and-Others-Have-Been-Doing-It-for-Years\">top buyer of order flow is a little company called Citadel,</a> which was fined <a href=\"https://imgur.com/0yT6vpJ\">a mere $700,000</a> for using this data to snipe retail orders from retards like you and your cousin Billy using <a href=\"https://www.investopedia.com/articles/investing/091615/world-high-frequency-algorithmic-trading.asp\">high frequency trading algorithms</a>, which is called frontrunning and is <strong><em>extremely not cool and extremely not legal</em></strong> (but crime definitely pays). For a company whose literal mission statement is to <a href=\"https://robinhood.com/us/en/support/articles/our-mission/\">&quot;democratize finance for all,&quot;</a> Robinhood sure does seem to put their finger on the scale in ways that unquestionably favor the big guys and by extension, themselves. By the way, the concept of selling order flow was invented by a dude you may have heard of who is currently serving a 150 year sentence for running a giant Ponzi scheme and will well-deservedly die in prison in the middle of Fucking Nowhere, <a href=\"https://www.investopedia.com/terms/p/paymentoforderflow.asp\">Bernard Madoff</a>. Don&#39;t you wish the regulators would get off their knees, get the market maker dicks out of their mouths, and do their jobs?</p>\n\n<p>Now we return to Stripe. If you&#39;ve ever bought anything on the internet, you&#39;ve probably used Stripe to process the payment, even if you didn&#39;t realize it at the time. Stripe could wind up being one of the biggest and most valuable companies in the world if they play their cards right, and big brain haver <a href=\"https://imgur.com/am4ONjr\">Paul Graham thinks they could wind up being the next Google in terms of valuation.</a> Stripe is thought to <a href=\"https://techcrunch.com/2020/11/28/what-to-make-of-stripes-possible-100-billion-valuation/\">be valued somewhere from $70-100 billion right now</a>, and we know that Ackman has about $7 billion in his war chest. I&#39;d wager it&#39;s likely that the recent spate of IPOs by dog shit companies like AirBnB and DoorDash giving them ~$80 billion and ~$55 billion market caps respectively pushes Stripe&#39;s valuation toward the higher end of those current valuation estimates. Even the NPCs at <a href=\"/r/stocks\">/r/stocks</a> are starting to figure out that something&#39;s fishy with <a href=\"https://old.reddit.com/r/stocks/comments/kbbf2e/the_amount_of_insider_trading_with_ipos_is/\">IPOs.</a> Also take note of the second tweet in that Paul Graham screenshot, because it strikes me as being not altogether dissimilar to what Ackman has previously said about what he thinks was his biggest miss going long, <a href=\"https://www.youtube.com/watch?v=gxqTwpWizw4\">Mastercard</a>.</p>\n\n<p>Stripe offers an <a href=\"https://imgur.com/OUSWYZi\">expansive and rapidly growing</a> anti-financial crimes platform called <a href=\"https://stripe.com/radar\">Radar</a> and is actively hiring for roles that seem like they&#39;ll be mission critical for the future of a company that&#39;s growing globally like <a href=\"https://stripe.com/jobs/listing/financial-crimes-investigation-payment-methods-lead-apac-chinese-speaker/2351914\">this one</a>. They&#39;ve already built the infrastructure that huge swathes of the internet economy run on and they&#39;re just getting rolling. </p>\n\n<p>Given the levels of utter incompetence bordering on malfeasance by the syphilitic boomers with worm-filled brains that supposedly regulate finance, is it so implausible that an avowed optimist and guy who definitely thinks about this stuff more than you, <a href=\"https://imgur.com/5zwzFPm\">Patrick Collison,</a> would team up with the man running the <a href=\"https://www.cnbc.com/2020/07/22/ackman-pershing-square-taking-no-compensation-for-new-spac-investment-vehicle.html\">most investor-friendly SPAC ever</a> to truly bring the fight for equality of financial opportunity to the free market? I don&#39;t think so. Such an act would help subvert the power of creeps like <a href=\"https://en.wikipedia.org/wiki/Kenneth_C._Griffin\">Ken Griffin</a>, who almost certainly believes that you and everyone you love are pathetic little worms that live in a world belonging to him and his buddies.</p>\n\n<p><strong>TLDR: An offshoot of Stripe could still be the target and the merger of PSTH with Stripe Radar as an independent, publicly owned entity, could be a step toward truly democratizing the markets and saving America and the rest of the world from the leviathan of Big Capital.</strong> </p>\n\n<p>Positions: short puts and long shares + March calls of PSTH in my active trading account, along with ~25% of my Roth IRA currently allocated to PSTH shares with the intention to sell about half of my mutual fund holdings after the next dividend goes out and put all of that money into PSTH.</p>\n\n<p>Disclaimer: I am retarded and this is not financial advice. Sorry for any typos that still exist, I proofread this a bunch of times and I tried my best.</p>\n\n<p>P.S: if I die for any reason after making this post, please do not accept the coroner&#39;s conclusion, because it means JP Morgan and Deutsche probably sent their hitters after me.</p>\n\n<p>edit: cleaned up some typos like <a href=\"https://old.reddit.com/r/RobinHoodPennyStocks/comments/kb2rqc/presentation_of_sls_the_play/\">this guy</a> cleaned out a bunch of people&#39;s Robinhood accounts yesterday. I&#39;m watching you <a href=\"/u/JustSomeStonksBoi\">/u/JustSomeStonksBoi</a> 👁</p>\n\n<p>edit2: added a citation for the Herbalife short (it&#39;s wikipedia, suck my dick, i&#39;ve given you enough)</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/yZmp88HaV-ZYGc8CNez_8rZAzo7U-EU8keELTN3bzUo.jpg?auto=webp&s=0ba996635816ca535f1c1e0c5bc29c932ea59435", "width": 600, "height": 315}, "resolutions": [{"url": "https://external-preview.redd.it/yZmp88HaV-ZYGc8CNez_8rZAzo7U-EU8keELTN3bzUo.jpg?width=108&crop=smart&auto=webp&s=6831f368438413475f01c8aebe97444d779639d6", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/yZmp88HaV-ZYGc8CNez_8rZAzo7U-EU8keELTN3bzUo.jpg?width=216&crop=smart&auto=webp&s=ba79d054b9c5d2ae4f4f1b7cda83aaf25f3b5e85", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/yZmp88HaV-ZYGc8CNez_8rZAzo7U-EU8keELTN3bzUo.jpg?width=320&crop=smart&auto=webp&s=1ec905aa28fe279187050bac39ee7c2a07df712a", "width": 320, "height": 168}], "variants": {}, "id": "K-RfkXiWEXf4Tyy3ouNT0YITrFjlzq_el6zCWyLLu-U"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kbjpqy", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "420redditpornacct69", "fullname": "t2_6a319a90"}, "discussion_type": null, "num_comments": 39, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/", "subreddit_subscribers": 1693312, "created_utc": 1607751750.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 17, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kbjpqy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfhx8fk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "xpdx", "fullname": "t2_4riz7"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kbjpqy", "score": 17, "author_fullname": "t2_4riz7", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Jesus. I think I need extra lithium now. \n\nWhy did I read that?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Jesus. I think I need extra lithium now. </p>\n\n<p>Why did I read that?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/gfhx8fk/", "num_reports": null, "locked": false, "name": "t1_gfhx8fk", "created": 1607784377.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607755577.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kbjpqy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfi0ugq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "420redditpornacct69", "fullname": "t2_6a319a90"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gfhx8fk", "score": 1, "author_fullname": "t2_6a319a90", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "smoke a cigarette, it's good for you", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>smoke a cigarette, it&#39;s good for you</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/gfi0ugq/", "num_reports": null, "locked": false, "name": "t1_gfi0ugq", "created": 1607787752.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607758952.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kbjpqy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfi0g80", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "alphameridian0", "fullname": "t2_krcdj8g"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kbjpqy", "score": 10, "author_fullname": "t2_krcdj8g", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "ugh psth is like vegetables. good for you in the long run but not very fun to eat in the moment\n\nbuying more shares on monday because i love myself 🚀🚀🥦🥦", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>ugh psth is like vegetables. good for you in the long run but not very fun to eat in the moment</p>\n\n<p>buying more shares on monday because i love myself 🚀🚀🥦🥦</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/gfi0g80/", "num_reports": null, "locked": false, "name": "t1_gfi0g80", "created": 1607787378.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607758578.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kbjpqy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfhxjrd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "chasing_losses", "fullname": "t2_80z9ybug"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kbjpqy", "score": 7, "author_fullname": "t2_80z9ybug", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Not including TLDR and PS 1,2,3 that was 13 paragraphs. Thirteen.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Not including TLDR and PS 1,2,3 that was 13 paragraphs. Thirteen.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/gfhxjrd/", "num_reports": null, "locked": false, "name": "t1_gfhxjrd", "created": 1607784661.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607755861.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kbjpqy", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfi0tqy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "420redditpornacct69", "fullname": "t2_6a319a90"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gfhxjrd", "score": 2, "author_fullname": "t2_6a319a90", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "PSTH's S-1 is 180 pages not counting the appendix and it's literally just a money company", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>PSTH&#39;s S-1 is 180 pages not counting the appendix and it&#39;s literally just a money company</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kbjpqy/an_alternative_hypothesis_for_psth_stripe_for_the/gfi0tqy/", "num_reports": null, "locked": false, "name": "t1_gfi0tqy", "created": 1607787732.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607758932.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}