{"approved_at_utc": null, "selftext": "Prepare for a very lengthy post. **I have worked my ASS off on this**.  Fair warning, this post is an update for my Nokia idea on TradingView,  so when I refer to Reddit/WSB I am talking to you guys as if you are  looking at it from my TradingView idea. \n\n&#x200B;\n\nSince my original ideas on TV and social media, there have been quite a few very interesting developments. For once, I'm not going to do just chart analysis. I am also adding a large amount of due diligence regarding options activity, social media activity, news articles, and comparisons against competitors. Financials are something I am still struggling to learn but hopefully will eventually get there. As far as financials are concerned, I do know that their revenue is down overall but their profit margins have increased. As far as revenue is concerned, Nokia has been acquiring a large amount of contracts lately in the 5G sector. Nokia also has a very good debt to asset ratio when compared against pretty much the entire industry they're attempting to capture market share in.\n\n&#x200B;\n\nThis will start off with some regular old chart analysis. Support and resistance levels, and candlestick and RSI analysis. Bollinger Bands are self explanitory for the most part.\n\n&#x200B;\n\nLet us start with a crucial RSI trend I discovered on the 2 month time frame.\n\nSpanning from 2006, there has been a consistent trend of attempted breakouts upwards and above 50 RSI. Each breakout has been a lower high thus far. Currently, Nokia is contending with this 2 month RSI trend line for the 7th time. This is a MAJOR area of confluence when combined with MA's, Fib retracement levels, and reactions in candlesticks.\n\nhttps://preview.redd.it/xuobh6uor6c61.png?width=1930&format=png&auto=webp&s=580ba82ee3642e4332e1745ade50039ffc869939\n\n&#x200B;\n\nOn the monthly, we can see that this trend line coincided with a major selloff in October of 2019. This selloff was caused by a bad earnings report on 10/24/2019. Earnings were estimated to be $0.05 but reported $0.01 which had a -69.42% surprise of -$0.04. Prior to this, the month of August broke down below this trend line. During the month of September, Nokia attempted to rally back above it on low volume. The local support level it was testing at $5.18 or the 0.5 Fib retracement flipped to resistance and caused a 27.87% drop after the bad earnings report. It was not until the month of June 2020 that Nokia was able to get back above this trend line. 2 months later, Nokia tested that same resistance level and was able to get above 50 RSI, but was strongly rejected. This rejection dropped Nokia back below the RSI trend line, but it was able to hold support at 40 RSI. The month of November 2020 however had a bullish engulfing candle to bring Nokia back above the trend line. Then the month of October 2020 had low sell volume and thus held as support. For this particular trend line, support has not been tested successfully like this since July of 2018. Note however, that the mid line of the bollinger bands is so far holding as resistance.\n\n&#x200B;\n\nNotice the giant bearish hammer the lower arrow is pointing to. That was the market-wide covid selloff of March 2020 and it closed directly at the 0.786 Fib retracement. There was strong bullish support residing at the 0.886 Fib retracement which not only caused the large wick, but strongly pushed Nokia back up and into the 20 year trend line zone of support. Since December of 2017, Nokia's price movement has been unable to close a monthly candle below this trend line. In October of 2020, Nokia once again successfully tested the 0.786 Fib retracement for support which coincided perfectly with the 20 year trend line and a diagonal trend line breakout.\n\nhttps://preview.redd.it/giukvukpr6c61.png?width=1930&format=png&auto=webp&s=613407c999d8e004c84d2943f562a04ef3ade19c\n\n&#x200B;\n\nThe 2 month trend line also translates very well to the daily, where we can see that Nokia has successfully tested this trend line multiple times for support throughout 2020.\n\nSince 12/21/2020, Nokia has so far successfully tested this support on this time frame. According to the trend, this \\*should\\* produce at least some upwards movement to test local resistance levels. Namely, the 0.618 Fib level at $4.34.\n\nhttps://preview.redd.it/yad5hm4qr6c61.png?width=1930&format=png&auto=webp&s=b681b860cd1ad96f5260dcbd921187bfb59c1ba1\n\n&#x200B;\n\nAccording to the 3 month time frame, Nokia has \\*serious\\* support below the $tree fiddy price point, and 40 RSI. The October 2016 3 month candle tested 40 RSI and had a fairly strong bounce. Then a year later, same thing. From that point forward, this zone was not tested until the negative October 2019 earnings report pushed Nokia well below it. Then in April 2020, Nokia had a high volume bullish engulfing candle that brought the RSI back above 40 but was rejected at the 0.618 Fib retracement. After that 3 month candle closed in July, Nokia spent the next 6 months testing support. Bears were unable to close the next 2 candles below 40 RSI AND the 20 year trend line. The October 2020 3 month candle closed as a long legged doji on high volume indicating strong buyer support. This is a multitude of confluence that shows for the next 3 months at least, Nokia should have strong buying support.\n\nhttps://preview.redd.it/tfl8spoqr6c61.png?width=1930&format=png&auto=webp&s=e7a82eb96ac9bb40322fcd96a849d7b81c566f72\n\n&#x200B;\n\nNow is time for perhaps one of the most interesting clues as far as Nokia's price action, the 6 month time frame.\n\nThe 6 month candle starting on January 2nd, 2020 is one of the strongest indicators that Nokia is soon to have some serious volatility.\n\nIt closed as a bullish hammer with very long tail and short upper shadow. This indicates buying support stepped in and held the line in a big way towards the end of the candle close. Volumes for this candle are the highest they have been since the giant hulk dildo starting in July of 2013.\n\nThe very next candle after this bullish hammer was a bearish spinning top doji- but was able to close WITHIN the body of the bullish hammer. This type of doji can indicate the beginning of a shift in sentiment, or a 'pause'. This 'pause' does sometimes precede a resumption of the prior trend. Considering the volumes in these 2 candles, Nokia is likely to experience serious volatility over the next 6 months. It is a very good sign though in my opinion that this doji candle closed within the body of the bullish hammer. The RSI however is pointing out a break of support, and subsequent confirmation of resistance. Nokia needs to break back above 45 RSI on this time frame in order to establish strong bullish bias.\n\nhttps://preview.redd.it/mzv9hb6rr6c61.png?width=1930&format=png&auto=webp&s=a9d86440e0fba694083f58982c61ee810a8b79a7\n\n&#x200B;\n\n\\*\\*TLDR: Support is hodling but this is arguably the most important zone to decide Nokia's short, mid, and long term fate.\n\nImmediate support levels: $3.80, $3.70, $3.50.\n\nLower support levels: $3.15, $2.44, and ALL-IN anything below that.\n\n&#x200B;\n\nImmediate resistance levels: $4.30, $4.50, $5.\n\nHigher resistance levels: $5.18, $6, $7.50.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\n\\- 1/21/22 Leap options activity -\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nI happened to find a website to check historical data on options volumes and open interest. The position I currently hold are $7 call contracts expiring on 1/21/2022, so I decided to take a look at the data for them.\n\nI also checked the $10 call contracts with the same expiration as they currently have what seems to be the largest amount of open interest.\n\n&#x200B;\n\nThis is a short term screenshot of the volumes and open interest for the $7 call.\n\nBetween the end of December and January 4th, there were very slight fluctuations in the open interest, yet the volumes traded were above average.\n\nNote that on January 5th and 6th, the volumes skyrocketed while open interest decreased. Strange considering the premium price of the options were on a slight upwards trend from that date. After January 6th, however, the the volume was mostly flat/average while the open interest significantly increased. January 15th, open interest skyrocketed. Interesting to note that this increase came after a significantly high volume day in shares.\n\nhttps://preview.redd.it/7rh35wbtr6c61.png?width=720&format=png&auto=webp&s=2ddb32cb0aaf3feafa248be19682bdb6887cef61\n\n&#x200B;\n\nThis is a longer term screenshot of the volumes and open interest for the $7 call. Unfortunately, without paying for a subscription this website only allows you to see historical data spanning roughly 3 months.\n\nStill, this screenshot shows multiple significant trends in the options for this particular contract.\n\nThe first thing that obviously catches the eye is the enormous volume and drop in option premium price/open interest that happened right before November. On October 29th, Nokia released an earnings report. This particular report showed an expected earnings per share of $0.06, but the actual reported earnings per share were $0.04, which was a surprise of -$0.02 or -36.37%. As of the opening bell for trading, Nokia dropped by 18.99% in 1 hour, eventually bottoming out at $3.21 a few hours later after a 20.72% decline in share price. After this 'cleanse', the $7 call option mostly traded flat for another 12 days thereafter. On the 13th day, open interest began rising again. Currently, Nokia's $7 call 1/21/22 contract has an open interest of roughly 135,000 contracts.\n\nhttps://preview.redd.it/vy82mmstr6c61.png?width=720&format=png&auto=webp&s=c37840bae667ba18c238536ad190d79240daaf38\n\n&#x200B;\n\nThis is a short term screenshot of the volumes and open interest for the $10 call.\n\nUnlike the strange activity in the $7 call, the overall trend for the open interest in the $10 call has only been upwards since the 17th of December onwards. Volumes have mostly been flat up until the 14th when Nokia had a very high volume day in shares. Otherwise, open interest and volumes in this contract have not had anything major to really report on other than a steady increase in open interest.\n\nhttps://preview.redd.it/0mk1qbsur6c61.png?width=720&format=png&auto=webp&s=4bb533c845998c0ab2f41060e7fb6140c4bf5c4f\n\n&#x200B;\n\nThis is a longer term screenshot of the volumes and open interest for the $10 call.\n\nThis screenshot is quite interesting. There have been multiple high volume days for this option, but the one that specifically stands out was when the contract bottomed out at $0.08. From that point forward, open interest and volumes remained relatively flat. Notice that in the latter part of November, the high volume days preceeded a significant decline in the option premium price. From the peak option price premium of \\~$0.16 however, the open interest only increased unlike what happened with the $7 call option on October 29th for earnings. The highest volume days for this contract in the timeline that I have to work with were, interestingly, the 14th and the 15th. This could signal another significant decline in premium price, or it could be a signal that Nokia's share price may be in the beginning stages of a rally. Considering historical data, history indicates that this \\*\\*should\\*\\* unfortunately be a signal for a drop in premium price. Whales love to mess with the noobs.\n\nhttps://preview.redd.it/jx75xh8vr6c61.png?width=720&format=png&auto=webp&s=88fa0f5529c4353abcb0fc044ae4546267bcb58b\n\n&#x200B;\n\nThis is a screenshot that represents the grand total of all options traded versus share price.\n\nFor months, the options volume and stock volume have remained relatively flat until the 14th and 15th.\n\nImplied volatility as well as volumes are signaling there is likely to be a major move within the next few trading sessions.\n\n&#x200B;\n\nhttps://preview.redd.it/ua8dxbkxr6c61.png?width=720&format=png&auto=webp&s=228aa40f5f450f8a1fb76cc0c94052c50dbdcd90\n\n&#x200B;\n\n\\*\\*TLDR: Options Open Interest is skyrocketing. $7c has weird stuff going on but $10c is stronger than a held-in beer fart.\n\nOn the other hand, the amount of open interest in the $7 and $10 calls could very easily be used to create significant bearish options pressure.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -\n\n\\- 1/20/23 Leap options activity -\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nFor these particular calls, the images are self-explanitory when compared to above.\n\n&#x200B;\n\nThis is a short term screenshot of the volumes and open interest for the $5 call.\n\nhttps://preview.redd.it/d4inx3yyr6c61.png?width=720&format=png&auto=webp&s=594b3e7e3b7334f3178203e08133c0d0aa1a3860\n\n&#x200B;\n\nThis is a longer term screenshot of the volumes and open interest for the $5 call.\n\nhttps://preview.redd.it/524vekezr6c61.png?width=720&format=png&auto=webp&s=4cd90215aaccf64111cca4aacfb30609988998ef\n\n&#x200B;\n\nThis is a short term screenshot of the volumes and open interest for the $7 call.\n\nhttps://preview.redd.it/ueawqh70s6c61.png?width=720&format=png&auto=webp&s=fa7fe291df444f7e8e885797287ba0178f3ed97e\n\n&#x200B;\n\nThis is a long term screenshot of the volumes and open interest for the $7 call.\n\nhttps://preview.redd.it/l26jg2n0s6c61.png?width=720&format=png&auto=webp&s=cd99cfe58aa0f22de9857580cabc506c5931713e\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\- News -\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nKinda serious.\n\nT-Mobile announces 5 year, \"multi-billion dollar agreement\" with both Nokia and Ericsson.\n\n\"These multi-billion-dollar deals with both Ericsson and Nokia will continue to supercharge T-Mobile’s nationwide 5G network.\"\n\n[https://www.t-mobile.com/news/network/5g-best-coverage-ericsson-nokia](https://www.t-mobile.com/news/network/5g-best-coverage-ericsson-nokia)\n\n&#x200B;\n\nThen shit does get serious. Nokia partners with Google.\n\n\"Google Cloud and Nokia will jointly develop cloud-native 5G Core solutions for communications service providers and enterprise customers.\"\n\n[https://cloud.google.com/press-releases/2021/0114/google-cloud-nokia-telecommunications](https://cloud.google.com/press-releases/2021/0114/google-cloud-nokia-telecommunications)\n\n&#x200B;\n\nThen, shit gets out of this world serious, literally. N A S A partners with Nokia to build the very first cell network on the moon. No big.\n\n[https://www.nokia.com/about-us/news/releases/2020/10/19/nokia-selected-by-nasa-to-build-first-ever-cellular-network-on-the-moon/](https://www.nokia.com/about-us/news/releases/2020/10/19/nokia-selected-by-nasa-to-build-first-ever-cellular-network-on-the-moon/)\n\n&#x200B;\n\nThen, shit gets mars type serious. Nokia selected for U.S. Federal 5G Cybersecurity Project. This 5G project is through NIST - the National Institute of Standards and Technology, a U.S. Federal Government entity.\n\n\"Preparing a Secure Evolution to 5G\"\n\nNote that on the official government 5G security project page, Nokia stands alongside major, major, MAJOR names such as AT&T, Cisco, Dell, Intel, and T-Mobile:\n\n[https://ibb.co/M9zmvfH](https://ibb.co/M9zmvfH)\n\n[https://www.nccoe.nist.gov/projects/building-blocks/5g-CYBERSECURITY](https://www.nccoe.nist.gov/projects/building-blocks/5g-CYBERSECURITY)\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\- More recent news/Press releases -\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nNokia press release stating 60+ commercial 5G deals.\n\n[https://www.nokia.com/about-us/news/releases/2020/01/09/nokia-highlights-momentum-with-63-commercial-5g-deals/](https://www.nokia.com/about-us/news/releases/2020/01/09/nokia-highlights-momentum-with-63-commercial-5g-deals/)\n\n&#x200B;\n\nSweden's Tele2 picks Nokia for 5G core network.\n\n[https://www.reuters.com/article/us-nokia-tele2/swedens-tele2-picks-nokia-for-5g-core-network-idUSKBN29G0JP](https://www.reuters.com/article/us-nokia-tele2/swedens-tele2-picks-nokia-for-5g-core-network-idUSKBN29G0JP)\n\n&#x200B;\n\nTaiwan Mobile exclusively picks Nokia for 5G.\n\n[https://www.nokia.com/about-us/news/releases/2020/06/29/nokia-wins-exclusive-taiwan-mobile-5g-deal/](https://www.nokia.com/about-us/news/releases/2020/06/29/nokia-wins-exclusive-taiwan-mobile-5g-deal/)\n\n&#x200B;\n\nNokia partners with M1 for 5G standalone in Singapore.\n\n[https://finance.yahoo.com/news/nokia-nok-partners-m1-5g-134301276.html](https://finance.yahoo.com/news/nokia-nok-partners-m1-5g-134301276.html)\n\n&#x200B;\n\n\\*\\*TLDR: According to the news, Nokia is quite literally going to the moon.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-Key observations from above news articles- (Fair warning, this is strictly plagiarized aka copy + pasted straight from above news sources.\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nKevin Stine, \\*\\*Chief\\*\\* of the Applied Cybersecurity Division at \\*\\*NIST\\*\\*, said: “5G will touch every aspect of our lives and security must be integrated up front rather than an add-on element of 5G networks. We’re looking forward to working with our project collaborators such as Nokia to show 5G’s advanced standards based security features as well an architecture that leverages foundational security capabilities available in cloud technologies.”\n\n&#x200B;\n\nRaghav Sahgal, President, Cloud and Network Services at Nokia, said: “Previous cellular technology generations have been industry-led whereas 5G development must evolve in collaboration with governments to ensure availability and access of secure trusted networks. The 5G Cybersecurity Project fills this role with a cross-section of government and industry collaborators on board. At Nokia, we embed security into every solution that we ship, and we are committed to enabling the secure shift to the cloud by working with government agencies and the industry to advance cybersecurity for 5G use cases that leverage both open and commercial components.”\n\n&#x200B;\n\nAbout NIST NCCoE - National Institue of Standards and Technology\n\nThe NCCoE, a part of NIST, is a collaborative hub where industry organizations, government agencies, and academic institutions work together to address businesses’ most pressing cybersecurity issues. This public-private partnership enables creation of practical cybersecurity solutions for specific industries, as well as for broad, cross-sector technology challenges. Through consortia under CRADAs, including technology partners—from Fortune 50 market leaders to smaller companies specializing in information technology and operational technology security—the NCCoE applies standards and recommended practices to develop modular, easily adaptable example cybersecurity solutions by using commercially available technology. The NCCoE documents these example solutions in the NIST Special Publication 1800 series, which maps capabilities to the NIST Cybersecurity Framework and details the steps needed for another entity to re-create the example solution. The NCCoE was established in 2012 by NIST in partnership with the State of Maryland and Montgomery County, Maryland. Information is available at [https://www.nccoe.nist.gov](https://www.nccoe.nist.gov). \n\nTaken from [https://www.globenewswire.com/news-release/2021/01/14/2158714/0/en/Nokia-selected-for-U-S-Federal-5G-Cybersecurity-Project.html](https://www.globenewswire.com/news-release/2021/01/14/2158714/0/en/Nokia-selected-for-U-S-Federal-5G-Cybersecurity-Project.html)\n\n&#x200B;\n\n\\*\\*TLDR: Show me the charts, I'll tell you the news.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-Stock Rankings-\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nDo yourself a favor. GOOGLE \"What is Zacks Ranking\"\n\nZacks ranking rates a stock on a scale from 1-5. 1 Being a strong buy while 5 is a strong sell.\n\n\"The Zacks Rank is a short-term stock recommendation of 1-3 months that is based on analyst earnings estimate revisions. It is designed to weed out the companies with rising earnings estimates.\n\n... Remember, the Zacks Rank is generated daily.\"\n\n&#x200B;\n\n\"People also ask: Is Zacks a good rank?\"\n\n\"Since 1988, Zacks #1 Rank stocks have generated an annualized return of 25.67%, nearly three times better than the S&P 500's return of 10.79%. The Zacks Rank has also been very successful in telling investors which stocks to avoid. Since 1988, Zacks #5 Rank stocks have been flat..\"\n\n&#x200B;\n\nZacks basically states that Nokia is worthwhile with solid fundamentals and ranks Nokia a 3, or \"Hold\".\n\nTo comprise this ranking, however, Zacks evaluates a stock on 4 different areas. Value, Growth, Momentum, and an averaged score of all 3.\n\nThis particular evaluation is graded like a report card in school: A, B, C, D, or the big fat red F.\n\nAs far as the average Value, Growth, and Momentum score is concerned, Nokia gets an A:\n\nhttps://preview.redd.it/7rt8d4mms6c61.png?width=813&format=png&auto=webp&s=2f84ab111c518ae617c133144bd68af27111d1d4\n\n&#x200B;\n\nhttps://preview.redd.it/8q0jhmhns6c61.png?width=398&format=png&auto=webp&s=e1ae6e89fc93ab8b9d635799463ebd953ba789f1\n\n&#x200B;\n\nAs far as Nokia being ranked a 3, or \"Hold\" rating:\n\n\"Zacks #3 Rank Stocks Can Be Perfectly Acceptable. \n\nI bet that title attracted your attention. You most likely have heard us refer to stocks with a Zacks #1 Rank as being the “cream of the crop.” It is understandable why. These stocks represent the top 5% of all stocks that are covered by at least one analyst and are expected to experience the strongest earnings estimate revisions in the future.\"\n\n[https://www.zacks.com/stock-education/54/How-to-Use-Zacks-Rank-3--Hold-](https://www.zacks.com/stock-education/54/How-to-Use-Zacks-Rank-3--Hold-)\n\n&#x200B;\n\nI'll admit, I haven't looked into the above claim of #1 rankings hitting 25.67% annualized returns. I am only adding Zacks ranking here for analytical and historical purposes.\n\n&#x200B;\n\n\\*\\*TLDR: Zacks rank says to hold, as it could go up or down, but gives Nokia a \"Grade A\" rating for value, growth, and momentum potential.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-Social Media influence-\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nSocial Media is by far my favorite trading 'indicator', because of how funny human behavior and psychology can be.\n\nIt is absolutely in my opinion one of the most underutilized tools a person can have in their analysis arsenal.\n\nWhen you were a kid and someone told you \"I bet you can't throw this rock farther than me!\", what did you do?\n\nOr how about as a kid, your closest friend/friends always told you that you'd never beat their high score in video games.\n\nTo this day, when someone or especially multiple people try to tell you that you cannot do/achieve something, what do you try to do?\n\nOr how about today, where a very large Social Media sentiment is that Nokia is a complete waste of time?\n\nThe float of 5.6 billion outstanding shares is too high, there's absolutely no way the price can move!\n\nOr what about all the people that had too strong of hands and didn't cut their losses much earlier on?\n\nAll those people trashing Nokia's name? Saying they can't do something? They won't move? Flatter than a pancake?\n\n&#x200B;\n\nI have noticed that within the past few weeks, there has been a significant uptick in posts regarding Nokia on the first and third largest investing forums Reddit has. Their names? /r/Wallstreetbets and /r/Stocks.\n\nCurrently, /r/Wallstreetbets has the largest following of 1.9 million members, /r/Investing comes in 2nd at 1.3 million members, and the third largest investing forum on Reddit is /r/Stocks and it has 1.1 million members.\n\nTake a look around on Wallstreetbets and you will quickly realize that forum can legitimately move the market. No joke.\n\nTeh stocks forum is far more conservative than the WSB one, yet, Nokia is still popping up quite frequently these past couple weeks in both.\n\nInteresting to note however that the second biggest investing forum on Reddit is /r/Investing, and it has ZERO posts about Nokia since 12/08/20. That post didn't even garner a single reply. Hmm.. Weird.\n\n&#x200B;\n\nDo yourself a favor. Go into some of these older posts and read the comments. Notice anything?\n\n[https://www.reddit.com/r/wallstreetbets/search?q=nokia&restrict\\_sr=1&sort=relevance&t=year](https://www.reddit.com/r/wallstreetbets/search?q=nokia&restrict_sr=1&sort=relevance&t=year)\n\n[https://www.reddit.com/r/stocks/search?q=nokia&restrict\\_sr=1&sort=relevance&t=year](https://www.reddit.com/r/stocks/search?q=nokia&restrict_sr=1&sort=relevance&t=year)\n\n&#x200B;\n\nThen, read these newer ones.\n\n&#x200B;\n\n[https://www.reddit.com/r/wallstreetbets/comments/kz5i7g/another\\_exphone\\_company\\_nokia\\_the\\_sleeping\\_giant/](https://www.reddit.com/r/wallstreetbets/comments/kz5i7g/another_exphone_company_nokia_the_sleeping_giant/)\n\n[https://www.reddit.com/r/stocks/comments/kyltua/is\\_nokia\\_a\\_good\\_long\\_term\\_buy\\_current\\_market/](https://www.reddit.com/r/stocks/comments/kyltua/is_nokia_a_good_long_term_buy_current_market/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/ky28jf/its\\_starting\\_nokia\\_is\\_coming\\_back\\_bb\\_is\\_good\\_but/](https://www.reddit.com/r/wallstreetbets/comments/ky28jf/its_starting_nokia_is_coming_back_bb_is_good_but/)\n\n[https://www.reddit.com/r/stocks/comments/kyqn33/i\\_cant\\_be\\_the\\_only\\_one\\_who\\_sees\\_the\\_potential\\_in/](https://www.reddit.com/r/stocks/comments/kyqn33/i_cant_be_the_only_one_who_sees_the_potential_in/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/kybiy3/nokia\\_nok\\_is\\_going\\_to\\_be\\_moving\\_quick\\_next\\_week/](https://www.reddit.com/r/wallstreetbets/comments/kybiy3/nokia_nok_is_going_to_be_moving_quick_next_week/)\n\n[https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok\\_invest\\_in\\_the\\_future/?utm\\_source=share&utm\\_medium=web2x&context=3](https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/?utm_source=share&utm_medium=web2x&context=3)\n\n[https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok\\_invest\\_in\\_the\\_future/](https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/)\n\n&#x200B;\n\n\"Nothing can honestly move NOK out of the 4-4.25 range unfourt. Too big and too old.\"\n\n\"Nokia doesn’t move dude, let alone QUICKLY HAHAHA\"\n\n\"NOKIA is dogshit held that trashbag for years sold for a small loss.\"\n\n\"Nice try but NOK is a flaming POS. You can’t pump it. Held it for 6 years. POS\"\n\n\"Nokia has a staggering 5.32B free float! Not quite easy for this monster to move\"\n\n\"This fat boy ain’t moving (yet)\"\n\n\"I bought some $5 and $7 calls for 2023 so i hope you're right, with 5 billion float it'll probably never get there but it wasn't too expensive for some lottery tickets\"\n\n&#x200B;\n\nWhat is my point here? What angle am I getting at? H Y P E. How do you create serious hype/FOMO for a stock in todays world? It needs some sort of 'reputation'. A very negative one is best. Why?\n\nNokia is known for having a giant outstanding share supply. They're known for being in a decades long downtrend. They're known for not being worth investing in, plain and simple.\n\nSo, back to human behavior. If you look back at the past year ish or so of comments on social media regarding Nokia, the stock has built quite the negative reputation.\n\n&#x200B;\n\nYou NEVER hear about Nokia. You never see it in the news. You never hear its name anymore other than when people reminisce of the good old days- where products were ackshually built to last!\n\nYou don't see the Nokia brand anywhere anymore.. Its name doesn't show up on TV, or in the newspaper, or on ticker news feeds, nothing. Nowhere. Nada. Zilch.\n\nWhat would happen if, say, Nokia suddenly had a +50% day out of nowhere? EVERYONE who ever doubted Nokia or even heard their name are quickly reminded that they are still alive.\n\nThese people are seemingly  so brainwashed at this point that Nokia is not a worthwhile investment, they don't even bother. Even though it just rocketed 50%. Meh, just a dead cat bounce. \n\nNah, they'll stay out and chase their gains in PLTR or GME or BB or whatever the current meme stocks are for the day.\n\nNext day, Nokia rockets again while maybe other meme/blue chip stocks and/or indexes are flat or negative. See where I'm going with this here?\n\n&#x200B;\n\nTHE very M O M E N T Nokia rips a hulk dildo on the chart, everyone and their mother is going to know about it.\n\nMeh, just a dead cat bounce. Right guys? ...Right?\n\nThen it goes up. Again. While a lot of people including I/you were waiting for a pullback.\n\nSee where I'm going with this here?\n\n&#x200B;\n\nSTRICTLY because of Nokia's reputation and the extreme negative sentiment surrounding it in Social Media, this is a perfect play.\n\nWhen it finally rips loose, everyone and their brother is going to be waiting for a pullback. What if it doesn't come soon enough?\n\nImagine the FOMO.\n\nA multi decade long downtrend is clearly reversing. You can see it in the chart, trend lines, and in the sentiment. This was rock bottom.\n\n\\*\\*TLDR: Imagine the FOMO.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-Google Trends-\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\nGoogle Trends can be a fun 'indicator' of sorts to use. It doesn't necessarily mean anything, BUT, it can yield an interesting metric.\n\nHow outright BORING something is or isn't.\n\nHow UNDERAPPRECIATED something is or isn't.\n\nHow many people would choose to talk about anything BUT ... that.\n\nHow .. dare I say, \\*\\*undervalued\\*\\* something is? Or how popular something is? lolNokia.\n\n&#x200B;\n\nWhen you think of Nokia, what is the first thing you think of? For me, it is those damn 3310 phone models. The ones that just .. wouldn't die. No matter what you did to them. \n\nAt this point, Nokia has apparently upgraded its appetite. Let's face it. In todays world of \\*\\*planned obsolescence\\*\\* especially in the smartphone world, Nokia doesn't stand a chance because of how many competitors it has!\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-This is a 17 year chart from Google Trends.\n\n12/2011 - 01/11. Nokia absolutely TANKS in relevance. I wonder why?\n\n01/2016. Nokia suddenly for the most part flatlines after a decent drop.\n\nIf we compare this to a heart beat monitor, Nokia's relevancy is \\[still\\] legit dead. \n\nDead. Not coming back. Can't start, won't start, NOStart. OD'D and narcan can't save it.\n\nhttps://preview.redd.it/exy129hxs6c61.png?width=1168&format=png&auto=webp&s=baef9ace234ff1e9413a7b7b472b24a896fbe212\n\n&#x200B;\n\nMy dude BS says hi! 8D\n\nhttps://preview.redd.it/q7x4xxbys6c61.png?width=790&format=png&auto=webp&s=be55330e4d0e4342e59a3004a0baadf45cac4935\n\n&#x200B;\n\n1/27/2011 Nokia beat expectations by 6.7%! Therefore, it must go DOWN, amirite? >:(\n\n[https://ibb.co/y4BYwFX](https://ibb.co/y4BYwFX)\n\n&#x200B;\n\nFrom that 6.7% positive earnings report? Nokia \\*\\*tanks\\*\\*, AGAIN, only this time -84.72%. Yep. You saw that right.\n\nI wonder if the bear flag had anything to do with it, though?\n\n[https://www.tradingview.com/x/MPU2TxMz/](https://www.tradingview.com/x/MPU2TxMz/)\n\n&#x200B;\n\nHmmm.\n\n\\*\\*TLDR: Google Trends says Nokia is a **massive** buy opportunity.\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-This is a yearly chart from Google Trends.\n\nIt's flatter than The Earth. Nothing to see here, folks. BUT WAIT, IT FUGGIN QUADRUPLE BOTDUMBED. kek. \n\nNothing to see here, folks.\n\n[https://ibb.co/Xpt0KQb](https://ibb.co/Xpt0KQb)\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-This is a weekly chart from Google Trends.\n\nEureka! We have something to report, kinda!\n\n&#x200B;\n\n[https://ibb.co/bPSq67Y](https://ibb.co/bPSq67Y)\n\n[https://ibb.co/DMKj0jH](https://ibb.co/DMKj0jH)\n\n1/15/21 Nokia spikes on the Google Trends weekly chart at 10 PM. weird.\n\nEven weirder, since I started updating this portion of this DD, Texas and Kentucky have joined the NokiTrain!\n\n&#x200B;\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n\\-The Float Fallacy- Last but not least ;D\n\n\\- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - \n\n&#x200B;\n\nLastly, I would just like to address the echo chambered and (in MY opinion) incorrect opinion of how Nokia cannot move well or quickly in price because of what I will call \"The Float Fallacy.\"\n\nNokia has a grand total of 5.6 billion shares that make up the company, otherwise known as \"The Float\". Nokia has a market cap currently of $22.1B.\n\nThat means when you multiply the total supply of tradable shares to how much money they each are trading for, you get the total overall valuation of a company.\n\nThe majority opinion everywhere on Nokia above all else, is that it cannot move due to its float size. Essentially, people are arguing that you'd need to buy substantially more shares\n\nin order to move the price than you would a different company. While this is generally true, the AMOUNT OF MONEY TRADED STAYS THE SAME.\n\n&#x200B;\n\nTo give you an idea of why the float doesn't matter, we can compare Nokia's market cap to the market cap sizes and share values of other competitors.\n\nFirst example I will use is Ericsson. Ericsson has a market cap of $36.13B. Their share price is currently $11.76. Now, again, think about the MONEY, not the shares.\n\nSay I wanted to invest $100 in a given stock. I could buy 8.5 shares in total of Ericsson. Or, I could get 24.5 shares of Nokia for THE SAME AMOUNT OF MONEY.\n\nWhat sounds more appealing to you? Owning 8.5 shares in a company, or nearly 3 times as much?\n\n&#x200B;\n\nSo let's compare market cap sizes with a few competitors to see just how much growth potential Nokia truly has.\n\nWe will just use the major companies listed alongside Nokia on the U.S. Federal 5G Cybersecurity Project.\n\n&#x200B;\n\nAT&T\n\nMarket cap: $207.87B\n\nShare price: $29.17\n\nFloat: 7.13B\n\n&#x200B;\n\nCisco\n\nMarket cap: $191.97B\n\nShare price: $45.43\n\nFloat: 4.22B\n\n&#x200B;\n\nDell\n\nMarket cap: $55.68B\n\nShare price: $74.26\n\nFloat: 0.77B\n\n&#x200B;\n\nIntel\n\nMarket cap: $235.96B\n\nShare price: $57.58\n\nFloat: 4.1B\n\n&#x200B;\n\nT-Mobile\n\nMarket cap: $157.98B\n\nShare price: $127.28\n\nFloat: 1.24B\n\n&#x200B;\n\nThese figures show the valuation that Nokia can and will eventually hit.\n\nThe only real negative effect of having 5.6 billion outstanding shares is that it can take a while for them to become more widely dispersed rather than overconcentrated.\n\nMeaning a very select few absurdly rich people can and have been suppressing the price. The more they do it though, the more insane opportunities it gives you. That's the entire point.\n\nSo, in a way, float does matter, but that is EXACTLY WHY this is such a winning proposition. The more shares WE buy, the less THEY have and can control.\n\n \n\nanddd, I'm done. Finally. This is my  very last update regarding Nokia until $0.20 is no longer a gigantic  movement.\n\nShoutout to John. I just wanna help people too. Seems like I'm apparently doing it wrong but idk.\n\n**DISCLAIMER:  I am not a financial advisor. What is written in its entirety in this  idea is my opinion - specifically, MY thoughts on a chart. That does not  make me correct on the above informations.**\n\n**I only started 'trading' a little over 4 years ago - and started 'trading' stocks in the beginning of 2020.**\n\n**DYOR.**\n\nP.S. a limit on 20 images sucks :|\n\n&#x200B;\n\n[https://www.youtube.com/watch?v=N2qwXdA7K80](https://www.youtube.com/watch?v=N2qwXdA7K80)\n\nDoes Nokia go BIG or does it go HOME?\n\n🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀\n\n🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀\n\n🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀\n\n🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀\n\n🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀", "author_fullname": "t2_7po5ka03", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Nokia - Go Big?", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 82, "top_awarded_type": null, "hide_score": false, "media_metadata": {"yad5hm4qr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=108&crop=smart&auto=webp&s=2179bf1fe477cdb8bdbac04861a311c42efd4325"}, {"y": 126, "x": 216, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=216&crop=smart&auto=webp&s=cfa7bbe14c5684469af5bfc9276edb0efa3c3a33"}, {"y": 188, "x": 320, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=320&crop=smart&auto=webp&s=eab87d1ee451f8e4696d820c557569b7fc42299c"}, {"y": 376, "x": 640, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=640&crop=smart&auto=webp&s=24d4e86dbe5a56f57e0de0c21151a15c8b074bbd"}, {"y": 564, "x": 960, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=960&crop=smart&auto=webp&s=8cba034ec4943b0132fac4bf7348ed6a1c6161e3"}, {"y": 634, "x": 1080, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=1080&crop=smart&auto=webp&s=1a181116c4c8701f7dc383e12d1917d175be4c0f"}], "s": {"y": 1134, "x": 1930, "u": "https://preview.redd.it/yad5hm4qr6c61.png?width=1930&format=png&auto=webp&s=b681b860cd1ad96f5260dcbd921187bfb59c1ba1"}, "id": "yad5hm4qr6c61"}, "mzv9hb6rr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=108&crop=smart&auto=webp&s=2f07e09e93e580b771fdea9dca4ad697ce5ec2a3"}, {"y": 126, "x": 216, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=216&crop=smart&auto=webp&s=b90947111a9a3b505b40fccfc13449367d6c8bf3"}, {"y": 188, "x": 320, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=320&crop=smart&auto=webp&s=4150548f2fcc95a51e4cd45cdc5e7450966cf6b9"}, {"y": 376, "x": 640, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=640&crop=smart&auto=webp&s=ddb768f4a3dc7054a68f1101376e76e7397b6fba"}, {"y": 564, "x": 960, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=960&crop=smart&auto=webp&s=e462f82c3537670c9bc79f51190234bdbfe58467"}, {"y": 634, "x": 1080, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=1080&crop=smart&auto=webp&s=53f4c57783dc1e125fe2b3391ab2fbb314e3c723"}], "s": {"y": 1134, "x": 1930, "u": "https://preview.redd.it/mzv9hb6rr6c61.png?width=1930&format=png&auto=webp&s=a9d86440e0fba694083f58982c61ee810a8b79a7"}, "id": "mzv9hb6rr6c61"}, "7rh35wbtr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/7rh35wbtr6c61.png?width=108&crop=smart&auto=webp&s=68fecbbbbef6373dc1aa4aca4850afa9f6196d9b"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/7rh35wbtr6c61.png?width=216&crop=smart&auto=webp&s=38744159042aed1a51c78dc9748fee18661fc5c5"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/7rh35wbtr6c61.png?width=320&crop=smart&auto=webp&s=6224f3d428466b7e57cad0f4f4cf46dc8afc3b59"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/7rh35wbtr6c61.png?width=640&crop=smart&auto=webp&s=699504180fb73fa77e45e3a940b0b0e0954e14ee"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/7rh35wbtr6c61.png?width=720&format=png&auto=webp&s=2ddb32cb0aaf3feafa248be19682bdb6887cef61"}, "id": "7rh35wbtr6c61"}, "xuobh6uor6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=108&crop=smart&auto=webp&s=ca4f457058047f17f5d6954ea58bb0606ee83c51"}, {"y": 126, "x": 216, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=216&crop=smart&auto=webp&s=44f9a8e9bfe2fb34886938f25f8f970d2c0e2dc4"}, {"y": 188, "x": 320, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=320&crop=smart&auto=webp&s=d95d292d2e42166b3a271e69fb70de66def1d82d"}, {"y": 376, "x": 640, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=640&crop=smart&auto=webp&s=21616a141be16aa8e6153563d41793c1e35bcc09"}, {"y": 564, "x": 960, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=960&crop=smart&auto=webp&s=79c4e83fb9609e3af3f44a941c7e41ae55796d11"}, {"y": 634, "x": 1080, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=1080&crop=smart&auto=webp&s=96803bda47afab75c9423c039d10930971c8cf35"}], "s": {"y": 1134, "x": 1930, "u": "https://preview.redd.it/xuobh6uor6c61.png?width=1930&format=png&auto=webp&s=580ba82ee3642e4332e1745ade50039ffc869939"}, "id": "xuobh6uor6c61"}, "d4inx3yyr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/d4inx3yyr6c61.png?width=108&crop=smart&auto=webp&s=5648e8d988a214844cfdc67cc9e9959c9b7103a1"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/d4inx3yyr6c61.png?width=216&crop=smart&auto=webp&s=e1aee608cb3cd6f49f0e3c02fe408683f4fae3f8"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/d4inx3yyr6c61.png?width=320&crop=smart&auto=webp&s=a88fefd479e4b027b2c968c864fe527df1281963"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/d4inx3yyr6c61.png?width=640&crop=smart&auto=webp&s=9d39c1ea6c5cd4d432b6ebc7388e5db21662f3dd"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/d4inx3yyr6c61.png?width=720&format=png&auto=webp&s=594b3e7e3b7334f3178203e08133c0d0aa1a3860"}, "id": "d4inx3yyr6c61"}, "8q0jhmhns6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 116, "x": 108, "u": "https://preview.redd.it/8q0jhmhns6c61.png?width=108&crop=smart&auto=webp&s=5ea1641194bd3f60b377eb8270b0d1951b443147"}, {"y": 232, "x": 216, "u": "https://preview.redd.it/8q0jhmhns6c61.png?width=216&crop=smart&auto=webp&s=4ea0e356cbc53de276de599d12759a2967d32fc2"}, {"y": 344, "x": 320, "u": "https://preview.redd.it/8q0jhmhns6c61.png?width=320&crop=smart&auto=webp&s=1f16380e82109bf47ccb45e1d1361ee54be8589f"}], "s": {"y": 429, "x": 398, "u": "https://preview.redd.it/8q0jhmhns6c61.png?width=398&format=png&auto=webp&s=e1ae6e89fc93ab8b9d635799463ebd953ba789f1"}, "id": "8q0jhmhns6c61"}, "vy82mmstr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/vy82mmstr6c61.png?width=108&crop=smart&auto=webp&s=2375d466cc51fe6a4393eb855164e88ae71f5747"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/vy82mmstr6c61.png?width=216&crop=smart&auto=webp&s=05fc4ebd6608e1232247922e61312bf5a9841da4"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/vy82mmstr6c61.png?width=320&crop=smart&auto=webp&s=f0dcf6489af66b06a46789dff2f8e6ff0328290b"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/vy82mmstr6c61.png?width=640&crop=smart&auto=webp&s=65204d7378b6e4926fb1be22f7464b625c6d9fc4"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/vy82mmstr6c61.png?width=720&format=png&auto=webp&s=c37840bae667ba18c238536ad190d79240daaf38"}, "id": "vy82mmstr6c61"}, "q7x4xxbys6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 51, "x": 108, "u": "https://preview.redd.it/q7x4xxbys6c61.png?width=108&crop=smart&auto=webp&s=ecdbe98695a6167f65ab5f97f40916b117e8a2c1"}, {"y": 103, "x": 216, "u": "https://preview.redd.it/q7x4xxbys6c61.png?width=216&crop=smart&auto=webp&s=01cf7aabff5403d604411d9568e720fc0fe6f241"}, {"y": 153, "x": 320, "u": "https://preview.redd.it/q7x4xxbys6c61.png?width=320&crop=smart&auto=webp&s=da78027eaf1f8ceb3658c36ac0d8f7fc7f6acda4"}, {"y": 307, "x": 640, "u": "https://preview.redd.it/q7x4xxbys6c61.png?width=640&crop=smart&auto=webp&s=7101e5620b23da406fa86a1812d2ca953dbc4808"}], "s": {"y": 379, "x": 790, "u": "https://preview.redd.it/q7x4xxbys6c61.png?width=790&format=png&auto=webp&s=be55330e4d0e4342e59a3004a0baadf45cac4935"}, "id": "q7x4xxbys6c61"}, "giukvukpr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/giukvukpr6c61.png?width=108&crop=smart&auto=webp&s=241f6d4a02ff95d4be1fdc3868b1bf47948a7515"}, {"y": 126, "x": 216, "u": "https://preview.redd.it/giukvukpr6c61.png?width=216&crop=smart&auto=webp&s=c4f7d64fa9f60e8b50a9d231edb0232b9cfa60cb"}, {"y": 188, "x": 320, "u": "https://preview.redd.it/giukvukpr6c61.png?width=320&crop=smart&auto=webp&s=80e94c4a01a6d04b62843375c09dd3f4675ac2cb"}, {"y": 376, "x": 640, "u": "https://preview.redd.it/giukvukpr6c61.png?width=640&crop=smart&auto=webp&s=8e1859b7b2afce9f214b0cb231ebf5e9456ba7a5"}, {"y": 564, "x": 960, "u": "https://preview.redd.it/giukvukpr6c61.png?width=960&crop=smart&auto=webp&s=cd4a3d8c0566355b8e42b15bb6515523592acab5"}, {"y": 634, "x": 1080, "u": "https://preview.redd.it/giukvukpr6c61.png?width=1080&crop=smart&auto=webp&s=63e35e0108a0b04a3233342996825ea2d3efeadd"}], "s": {"y": 1134, "x": 1930, "u": "https://preview.redd.it/giukvukpr6c61.png?width=1930&format=png&auto=webp&s=613407c999d8e004c84d2943f562a04ef3ade19c"}, "id": "giukvukpr6c61"}, "ueawqh70s6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/ueawqh70s6c61.png?width=108&crop=smart&auto=webp&s=e979670236f5ad00a43e98f5d587d6d83ed09a88"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/ueawqh70s6c61.png?width=216&crop=smart&auto=webp&s=090a095a76022450001e07cf6ccf639598847d53"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/ueawqh70s6c61.png?width=320&crop=smart&auto=webp&s=5045845523d14e1e7be76124b4a3da014d4d5026"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/ueawqh70s6c61.png?width=640&crop=smart&auto=webp&s=401f3d5cd2bf4fdecaadf58833269c1e4c64c479"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/ueawqh70s6c61.png?width=720&format=png&auto=webp&s=fa7fe291df444f7e8e885797287ba0178f3ed97e"}, "id": "ueawqh70s6c61"}, "l26jg2n0s6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/l26jg2n0s6c61.png?width=108&crop=smart&auto=webp&s=e6169700817b0a013448e54e8e0cef7a46d2e0e8"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/l26jg2n0s6c61.png?width=216&crop=smart&auto=webp&s=703fd672903c908223894c69b3adb342e269fb41"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/l26jg2n0s6c61.png?width=320&crop=smart&auto=webp&s=1018d8852d3be521e004ca34e92b816150df82f4"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/l26jg2n0s6c61.png?width=640&crop=smart&auto=webp&s=7bd3d36f1b966361457dbefdbdd4601bf6b5bf45"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/l26jg2n0s6c61.png?width=720&format=png&auto=webp&s=cd99cfe58aa0f22de9857580cabc506c5931713e"}, "id": "l26jg2n0s6c61"}, "exy129hxs6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 66, "x": 108, "u": "https://preview.redd.it/exy129hxs6c61.png?width=108&crop=smart&auto=webp&s=0c79b6c6e47cbded3552b0b8b0d92db4363b980a"}, {"y": 132, "x": 216, "u": "https://preview.redd.it/exy129hxs6c61.png?width=216&crop=smart&auto=webp&s=bbe415223c2ac75b89f10207cec8ccaea36b693d"}, {"y": 196, "x": 320, "u": "https://preview.redd.it/exy129hxs6c61.png?width=320&crop=smart&auto=webp&s=ad918a4d5efd68000c235938e365db1a030a466a"}, {"y": 393, "x": 640, "u": "https://preview.redd.it/exy129hxs6c61.png?width=640&crop=smart&auto=webp&s=268583f6b42cd52c6514363ff1d3ed09729e3348"}, {"y": 590, "x": 960, "u": "https://preview.redd.it/exy129hxs6c61.png?width=960&crop=smart&auto=webp&s=9dd1dab08b9c63c14136b56af7fd575d76f21b71"}, {"y": 664, "x": 1080, "u": "https://preview.redd.it/exy129hxs6c61.png?width=1080&crop=smart&auto=webp&s=973c574aa8907cb38ca40470c639c53667a8b497"}], "s": {"y": 719, "x": 1168, "u": "https://preview.redd.it/exy129hxs6c61.png?width=1168&format=png&auto=webp&s=baef9ace234ff1e9413a7b7b472b24a896fbe212"}, "id": "exy129hxs6c61"}, "0mk1qbsur6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/0mk1qbsur6c61.png?width=108&crop=smart&auto=webp&s=009dbde6619561bce874724b0ce468dbcf911c83"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/0mk1qbsur6c61.png?width=216&crop=smart&auto=webp&s=4fb27c7441f2e3648a13c414e3314bbd1a15885c"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/0mk1qbsur6c61.png?width=320&crop=smart&auto=webp&s=7d753445f6319b2de4a24b7737933a0f23132c92"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/0mk1qbsur6c61.png?width=640&crop=smart&auto=webp&s=4898735c690e89e28ea58540514ec89f1d3e3161"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/0mk1qbsur6c61.png?width=720&format=png&auto=webp&s=4bb533c845998c0ab2f41060e7fb6140c4bf5c4f"}, "id": "0mk1qbsur6c61"}, "524vekezr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/524vekezr6c61.png?width=108&crop=smart&auto=webp&s=006b08b18084757132e51d37f5f12c8140bc47de"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/524vekezr6c61.png?width=216&crop=smart&auto=webp&s=e0235f38cbfb9d48c5f76e18ba4ea814a5688acd"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/524vekezr6c61.png?width=320&crop=smart&auto=webp&s=3c53a7b7171039cf10c1735ae4b25f261511e9b1"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/524vekezr6c61.png?width=640&crop=smart&auto=webp&s=65ba4d76dc75c47a4a17135db293da3e8de1dba3"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/524vekezr6c61.png?width=720&format=png&auto=webp&s=4cd90215aaccf64111cca4aacfb30609988998ef"}, "id": "524vekezr6c61"}, "tfl8spoqr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 63, "x": 108, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=108&crop=smart&auto=webp&s=0f139ca62b52527b658fa16c229f0932a8f59516"}, {"y": 126, "x": 216, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=216&crop=smart&auto=webp&s=8c7c06a35586d27725f9191d68fc536563824a33"}, {"y": 188, "x": 320, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=320&crop=smart&auto=webp&s=d584dab889c7a575273633b0379058539c6055bb"}, {"y": 376, "x": 640, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=640&crop=smart&auto=webp&s=b6e669454d2164f65edc6617728ac0d8ed9c759b"}, {"y": 564, "x": 960, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=960&crop=smart&auto=webp&s=84a701306556e4d4778af70aaa0c7e77da3113e4"}, {"y": 634, "x": 1080, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=1080&crop=smart&auto=webp&s=f92337259bba3152b820dde240da3329e2d61943"}], "s": {"y": 1134, "x": 1930, "u": "https://preview.redd.it/tfl8spoqr6c61.png?width=1930&format=png&auto=webp&s=e7a82eb96ac9bb40322fcd96a849d7b81c566f72"}, "id": "tfl8spoqr6c61"}, "ua8dxbkxr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 46, "x": 108, "u": "https://preview.redd.it/ua8dxbkxr6c61.png?width=108&crop=smart&auto=webp&s=5ff958ef2e315ebd2d0b708e61ce85ace9ab3bb2"}, {"y": 92, "x": 216, "u": "https://preview.redd.it/ua8dxbkxr6c61.png?width=216&crop=smart&auto=webp&s=ef2edb7b4e507b7bc5469f8fb0ca0453e5550858"}, {"y": 137, "x": 320, "u": "https://preview.redd.it/ua8dxbkxr6c61.png?width=320&crop=smart&auto=webp&s=20b96a5218504dbe12e3e55d8f612fcb60127e3f"}, {"y": 274, "x": 640, "u": "https://preview.redd.it/ua8dxbkxr6c61.png?width=640&crop=smart&auto=webp&s=ef03f7ba901ecda3a41b7dac593d2007b8e3df85"}], "s": {"y": 309, "x": 720, "u": "https://preview.redd.it/ua8dxbkxr6c61.png?width=720&format=png&auto=webp&s=228aa40f5f450f8a1fb76cc0c94052c50dbdcd90"}, "id": "ua8dxbkxr6c61"}, "7rt8d4mms6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 36, "x": 108, "u": "https://preview.redd.it/7rt8d4mms6c61.png?width=108&crop=smart&auto=webp&s=0795d71f214cf3a0ef5ccf01ee24176a7bea1fd3"}, {"y": 73, "x": 216, "u": "https://preview.redd.it/7rt8d4mms6c61.png?width=216&crop=smart&auto=webp&s=4b26489eda98abfeb5b26de7891ec1aa72e9bc4e"}, {"y": 108, "x": 320, "u": "https://preview.redd.it/7rt8d4mms6c61.png?width=320&crop=smart&auto=webp&s=92f9f29922c021a7d1a1ed3f0a209638b9f6502c"}, {"y": 216, "x": 640, "u": "https://preview.redd.it/7rt8d4mms6c61.png?width=640&crop=smart&auto=webp&s=a02d40a97fd2e8a41525a7bb42e1da029f443938"}], "s": {"y": 275, "x": 813, "u": "https://preview.redd.it/7rt8d4mms6c61.png?width=813&format=png&auto=webp&s=2f84ab111c518ae617c133144bd68af27111d1d4"}, "id": "7rt8d4mms6c61"}, "jx75xh8vr6c61": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 48, "x": 108, "u": "https://preview.redd.it/jx75xh8vr6c61.png?width=108&crop=smart&auto=webp&s=3effde9cbe2ac305faa583810445783be8cdd676"}, {"y": 96, "x": 216, "u": "https://preview.redd.it/jx75xh8vr6c61.png?width=216&crop=smart&auto=webp&s=89ef3952331142eeba31d9c1129073f678b43982"}, {"y": 142, "x": 320, "u": "https://preview.redd.it/jx75xh8vr6c61.png?width=320&crop=smart&auto=webp&s=b5f37ee2b895e2d54485a79e2a1557c00abc4aa9"}, {"y": 285, "x": 640, "u": "https://preview.redd.it/jx75xh8vr6c61.png?width=640&crop=smart&auto=webp&s=4115c26d7e3a98107962654f7075aed1165f9c66"}], "s": {"y": 321, "x": 720, "u": "https://preview.redd.it/jx75xh8vr6c61.png?width=720&format=png&auto=webp&s=88fa0f5529c4353abcb0fc044ae4546267bcb58b"}, "id": "jx75xh8vr6c61"}}, "name": "t3_l08brv", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.87, "author_flair_background_color": null, "subreddit_type": "public", "ups": 87, "total_awards_received": 3, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 87, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/MkJGdiBAy9XpSSZ4N8XEg8xhzuCvb_qj66kS7cXxMlc.jpg", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1611046547.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": true, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Prepare for a very lengthy post. <strong>I have worked my ASS off on this</strong>.  Fair warning, this post is an update for my Nokia idea on TradingView,  so when I refer to Reddit/WSB I am talking to you guys as if you are  looking at it from my TradingView idea. </p>\n\n<p>&#x200B;</p>\n\n<p>Since my original ideas on TV and social media, there have been quite a few very interesting developments. For once, I&#39;m not going to do just chart analysis. I am also adding a large amount of due diligence regarding options activity, social media activity, news articles, and comparisons against competitors. Financials are something I am still struggling to learn but hopefully will eventually get there. As far as financials are concerned, I do know that their revenue is down overall but their profit margins have increased. As far as revenue is concerned, Nokia has been acquiring a large amount of contracts lately in the 5G sector. Nokia also has a very good debt to asset ratio when compared against pretty much the entire industry they&#39;re attempting to capture market share in.</p>\n\n<p>&#x200B;</p>\n\n<p>This will start off with some regular old chart analysis. Support and resistance levels, and candlestick and RSI analysis. Bollinger Bands are self explanitory for the most part.</p>\n\n<p>&#x200B;</p>\n\n<p>Let us start with a crucial RSI trend I discovered on the 2 month time frame.</p>\n\n<p>Spanning from 2006, there has been a consistent trend of attempted breakouts upwards and above 50 RSI. Each breakout has been a lower high thus far. Currently, Nokia is contending with this 2 month RSI trend line for the 7th time. This is a MAJOR area of confluence when combined with MA&#39;s, Fib retracement levels, and reactions in candlesticks.</p>\n\n<p><a href=\"https://preview.redd.it/xuobh6uor6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=580ba82ee3642e4332e1745ade50039ffc869939\">https://preview.redd.it/xuobh6uor6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=580ba82ee3642e4332e1745ade50039ffc869939</a></p>\n\n<p>&#x200B;</p>\n\n<p>On the monthly, we can see that this trend line coincided with a major selloff in October of 2019. This selloff was caused by a bad earnings report on 10/24/2019. Earnings were estimated to be $0.05 but reported $0.01 which had a -69.42% surprise of -$0.04. Prior to this, the month of August broke down below this trend line. During the month of September, Nokia attempted to rally back above it on low volume. The local support level it was testing at $5.18 or the 0.5 Fib retracement flipped to resistance and caused a 27.87% drop after the bad earnings report. It was not until the month of June 2020 that Nokia was able to get back above this trend line. 2 months later, Nokia tested that same resistance level and was able to get above 50 RSI, but was strongly rejected. This rejection dropped Nokia back below the RSI trend line, but it was able to hold support at 40 RSI. The month of November 2020 however had a bullish engulfing candle to bring Nokia back above the trend line. Then the month of October 2020 had low sell volume and thus held as support. For this particular trend line, support has not been tested successfully like this since July of 2018. Note however, that the mid line of the bollinger bands is so far holding as resistance.</p>\n\n<p>&#x200B;</p>\n\n<p>Notice the giant bearish hammer the lower arrow is pointing to. That was the market-wide covid selloff of March 2020 and it closed directly at the 0.786 Fib retracement. There was strong bullish support residing at the 0.886 Fib retracement which not only caused the large wick, but strongly pushed Nokia back up and into the 20 year trend line zone of support. Since December of 2017, Nokia&#39;s price movement has been unable to close a monthly candle below this trend line. In October of 2020, Nokia once again successfully tested the 0.786 Fib retracement for support which coincided perfectly with the 20 year trend line and a diagonal trend line breakout.</p>\n\n<p><a href=\"https://preview.redd.it/giukvukpr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=613407c999d8e004c84d2943f562a04ef3ade19c\">https://preview.redd.it/giukvukpr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=613407c999d8e004c84d2943f562a04ef3ade19c</a></p>\n\n<p>&#x200B;</p>\n\n<p>The 2 month trend line also translates very well to the daily, where we can see that Nokia has successfully tested this trend line multiple times for support throughout 2020.</p>\n\n<p>Since 12/21/2020, Nokia has so far successfully tested this support on this time frame. According to the trend, this *should* produce at least some upwards movement to test local resistance levels. Namely, the 0.618 Fib level at $4.34.</p>\n\n<p><a href=\"https://preview.redd.it/yad5hm4qr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=b681b860cd1ad96f5260dcbd921187bfb59c1ba1\">https://preview.redd.it/yad5hm4qr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=b681b860cd1ad96f5260dcbd921187bfb59c1ba1</a></p>\n\n<p>&#x200B;</p>\n\n<p>According to the 3 month time frame, Nokia has *serious* support below the $tree fiddy price point, and 40 RSI. The October 2016 3 month candle tested 40 RSI and had a fairly strong bounce. Then a year later, same thing. From that point forward, this zone was not tested until the negative October 2019 earnings report pushed Nokia well below it. Then in April 2020, Nokia had a high volume bullish engulfing candle that brought the RSI back above 40 but was rejected at the 0.618 Fib retracement. After that 3 month candle closed in July, Nokia spent the next 6 months testing support. Bears were unable to close the next 2 candles below 40 RSI AND the 20 year trend line. The October 2020 3 month candle closed as a long legged doji on high volume indicating strong buyer support. This is a multitude of confluence that shows for the next 3 months at least, Nokia should have strong buying support.</p>\n\n<p><a href=\"https://preview.redd.it/tfl8spoqr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=e7a82eb96ac9bb40322fcd96a849d7b81c566f72\">https://preview.redd.it/tfl8spoqr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=e7a82eb96ac9bb40322fcd96a849d7b81c566f72</a></p>\n\n<p>&#x200B;</p>\n\n<p>Now is time for perhaps one of the most interesting clues as far as Nokia&#39;s price action, the 6 month time frame.</p>\n\n<p>The 6 month candle starting on January 2nd, 2020 is one of the strongest indicators that Nokia is soon to have some serious volatility.</p>\n\n<p>It closed as a bullish hammer with very long tail and short upper shadow. This indicates buying support stepped in and held the line in a big way towards the end of the candle close. Volumes for this candle are the highest they have been since the giant hulk dildo starting in July of 2013.</p>\n\n<p>The very next candle after this bullish hammer was a bearish spinning top doji- but was able to close WITHIN the body of the bullish hammer. This type of doji can indicate the beginning of a shift in sentiment, or a &#39;pause&#39;. This &#39;pause&#39; does sometimes precede a resumption of the prior trend. Considering the volumes in these 2 candles, Nokia is likely to experience serious volatility over the next 6 months. It is a very good sign though in my opinion that this doji candle closed within the body of the bullish hammer. The RSI however is pointing out a break of support, and subsequent confirmation of resistance. Nokia needs to break back above 45 RSI on this time frame in order to establish strong bullish bias.</p>\n\n<p><a href=\"https://preview.redd.it/mzv9hb6rr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=a9d86440e0fba694083f58982c61ee810a8b79a7\">https://preview.redd.it/mzv9hb6rr6c61.png?width=1930&amp;format=png&amp;auto=webp&amp;s=a9d86440e0fba694083f58982c61ee810a8b79a7</a></p>\n\n<p>&#x200B;</p>\n\n<p>**TLDR: Support is hodling but this is arguably the most important zone to decide Nokia&#39;s short, mid, and long term fate.</p>\n\n<p>Immediate support levels: $3.80, $3.70, $3.50.</p>\n\n<p>Lower support levels: $3.15, $2.44, and ALL-IN anything below that.</p>\n\n<p>&#x200B;</p>\n\n<p>Immediate resistance levels: $4.30, $4.50, $5.</p>\n\n<p>Higher resistance levels: $5.18, $6, $7.50.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>- 1/21/22 Leap options activity -</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>I happened to find a website to check historical data on options volumes and open interest. The position I currently hold are $7 call contracts expiring on 1/21/2022, so I decided to take a look at the data for them.</p>\n\n<p>I also checked the $10 call contracts with the same expiration as they currently have what seems to be the largest amount of open interest.</p>\n\n<p>&#x200B;</p>\n\n<p>This is a short term screenshot of the volumes and open interest for the $7 call.</p>\n\n<p>Between the end of December and January 4th, there were very slight fluctuations in the open interest, yet the volumes traded were above average.</p>\n\n<p>Note that on January 5th and 6th, the volumes skyrocketed while open interest decreased. Strange considering the premium price of the options were on a slight upwards trend from that date. After January 6th, however, the the volume was mostly flat/average while the open interest significantly increased. January 15th, open interest skyrocketed. Interesting to note that this increase came after a significantly high volume day in shares.</p>\n\n<p><a href=\"https://preview.redd.it/7rh35wbtr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=2ddb32cb0aaf3feafa248be19682bdb6887cef61\">https://preview.redd.it/7rh35wbtr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=2ddb32cb0aaf3feafa248be19682bdb6887cef61</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a longer term screenshot of the volumes and open interest for the $7 call. Unfortunately, without paying for a subscription this website only allows you to see historical data spanning roughly 3 months.</p>\n\n<p>Still, this screenshot shows multiple significant trends in the options for this particular contract.</p>\n\n<p>The first thing that obviously catches the eye is the enormous volume and drop in option premium price/open interest that happened right before November. On October 29th, Nokia released an earnings report. This particular report showed an expected earnings per share of $0.06, but the actual reported earnings per share were $0.04, which was a surprise of -$0.02 or -36.37%. As of the opening bell for trading, Nokia dropped by 18.99% in 1 hour, eventually bottoming out at $3.21 a few hours later after a 20.72% decline in share price. After this &#39;cleanse&#39;, the $7 call option mostly traded flat for another 12 days thereafter. On the 13th day, open interest began rising again. Currently, Nokia&#39;s $7 call 1/21/22 contract has an open interest of roughly 135,000 contracts.</p>\n\n<p><a href=\"https://preview.redd.it/vy82mmstr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=c37840bae667ba18c238536ad190d79240daaf38\">https://preview.redd.it/vy82mmstr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=c37840bae667ba18c238536ad190d79240daaf38</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a short term screenshot of the volumes and open interest for the $10 call.</p>\n\n<p>Unlike the strange activity in the $7 call, the overall trend for the open interest in the $10 call has only been upwards since the 17th of December onwards. Volumes have mostly been flat up until the 14th when Nokia had a very high volume day in shares. Otherwise, open interest and volumes in this contract have not had anything major to really report on other than a steady increase in open interest.</p>\n\n<p><a href=\"https://preview.redd.it/0mk1qbsur6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=4bb533c845998c0ab2f41060e7fb6140c4bf5c4f\">https://preview.redd.it/0mk1qbsur6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=4bb533c845998c0ab2f41060e7fb6140c4bf5c4f</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a longer term screenshot of the volumes and open interest for the $10 call.</p>\n\n<p>This screenshot is quite interesting. There have been multiple high volume days for this option, but the one that specifically stands out was when the contract bottomed out at $0.08. From that point forward, open interest and volumes remained relatively flat. Notice that in the latter part of November, the high volume days preceeded a significant decline in the option premium price. From the peak option price premium of ~$0.16 however, the open interest only increased unlike what happened with the $7 call option on October 29th for earnings. The highest volume days for this contract in the timeline that I have to work with were, interestingly, the 14th and the 15th. This could signal another significant decline in premium price, or it could be a signal that Nokia&#39;s share price may be in the beginning stages of a rally. Considering historical data, history indicates that this **should** unfortunately be a signal for a drop in premium price. Whales love to mess with the noobs.</p>\n\n<p><a href=\"https://preview.redd.it/jx75xh8vr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=88fa0f5529c4353abcb0fc044ae4546267bcb58b\">https://preview.redd.it/jx75xh8vr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=88fa0f5529c4353abcb0fc044ae4546267bcb58b</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a screenshot that represents the grand total of all options traded versus share price.</p>\n\n<p>For months, the options volume and stock volume have remained relatively flat until the 14th and 15th.</p>\n\n<p>Implied volatility as well as volumes are signaling there is likely to be a major move within the next few trading sessions.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/ua8dxbkxr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=228aa40f5f450f8a1fb76cc0c94052c50dbdcd90\">https://preview.redd.it/ua8dxbkxr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=228aa40f5f450f8a1fb76cc0c94052c50dbdcd90</a></p>\n\n<p>&#x200B;</p>\n\n<p>**TLDR: Options Open Interest is skyrocketing. $7c has weird stuff going on but $10c is stronger than a held-in beer fart.</p>\n\n<p>On the other hand, the amount of open interest in the $7 and $10 calls could very easily be used to create significant bearish options pressure.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p>\n\n<p>- 1/20/23 Leap options activity -</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>For these particular calls, the images are self-explanitory when compared to above.</p>\n\n<p>&#x200B;</p>\n\n<p>This is a short term screenshot of the volumes and open interest for the $5 call.</p>\n\n<p><a href=\"https://preview.redd.it/d4inx3yyr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=594b3e7e3b7334f3178203e08133c0d0aa1a3860\">https://preview.redd.it/d4inx3yyr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=594b3e7e3b7334f3178203e08133c0d0aa1a3860</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a longer term screenshot of the volumes and open interest for the $5 call.</p>\n\n<p><a href=\"https://preview.redd.it/524vekezr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=4cd90215aaccf64111cca4aacfb30609988998ef\">https://preview.redd.it/524vekezr6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=4cd90215aaccf64111cca4aacfb30609988998ef</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a short term screenshot of the volumes and open interest for the $7 call.</p>\n\n<p><a href=\"https://preview.redd.it/ueawqh70s6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=fa7fe291df444f7e8e885797287ba0178f3ed97e\">https://preview.redd.it/ueawqh70s6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=fa7fe291df444f7e8e885797287ba0178f3ed97e</a></p>\n\n<p>&#x200B;</p>\n\n<p>This is a long term screenshot of the volumes and open interest for the $7 call.</p>\n\n<p><a href=\"https://preview.redd.it/l26jg2n0s6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=cd99cfe58aa0f22de9857580cabc506c5931713e\">https://preview.redd.it/l26jg2n0s6c61.png?width=720&amp;format=png&amp;auto=webp&amp;s=cd99cfe58aa0f22de9857580cabc506c5931713e</a></p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>- News -</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Kinda serious.</p>\n\n<p>T-Mobile announces 5 year, &quot;multi-billion dollar agreement&quot; with both Nokia and Ericsson.</p>\n\n<p>&quot;These multi-billion-dollar deals with both Ericsson and Nokia will continue to supercharge T-Mobile’s nationwide 5G network.&quot;</p>\n\n<p><a href=\"https://www.t-mobile.com/news/network/5g-best-coverage-ericsson-nokia\">https://www.t-mobile.com/news/network/5g-best-coverage-ericsson-nokia</a></p>\n\n<p>&#x200B;</p>\n\n<p>Then shit does get serious. Nokia partners with Google.</p>\n\n<p>&quot;Google Cloud and Nokia will jointly develop cloud-native 5G Core solutions for communications service providers and enterprise customers.&quot;</p>\n\n<p><a href=\"https://cloud.google.com/press-releases/2021/0114/google-cloud-nokia-telecommunications\">https://cloud.google.com/press-releases/2021/0114/google-cloud-nokia-telecommunications</a></p>\n\n<p>&#x200B;</p>\n\n<p>Then, shit gets out of this world serious, literally. N A S A partners with Nokia to build the very first cell network on the moon. No big.</p>\n\n<p><a href=\"https://www.nokia.com/about-us/news/releases/2020/10/19/nokia-selected-by-nasa-to-build-first-ever-cellular-network-on-the-moon/\">https://www.nokia.com/about-us/news/releases/2020/10/19/nokia-selected-by-nasa-to-build-first-ever-cellular-network-on-the-moon/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Then, shit gets mars type serious. Nokia selected for U.S. Federal 5G Cybersecurity Project. This 5G project is through NIST - the National Institute of Standards and Technology, a U.S. Federal Government entity.</p>\n\n<p>&quot;Preparing a Secure Evolution to 5G&quot;</p>\n\n<p>Note that on the official government 5G security project page, Nokia stands alongside major, major, MAJOR names such as AT&amp;T, Cisco, Dell, Intel, and T-Mobile:</p>\n\n<p><a href=\"https://ibb.co/M9zmvfH\">https://ibb.co/M9zmvfH</a></p>\n\n<p><a href=\"https://www.nccoe.nist.gov/projects/building-blocks/5g-CYBERSECURITY\">https://www.nccoe.nist.gov/projects/building-blocks/5g-CYBERSECURITY</a></p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>- More recent news/Press releases -</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Nokia press release stating 60+ commercial 5G deals.</p>\n\n<p><a href=\"https://www.nokia.com/about-us/news/releases/2020/01/09/nokia-highlights-momentum-with-63-commercial-5g-deals/\">https://www.nokia.com/about-us/news/releases/2020/01/09/nokia-highlights-momentum-with-63-commercial-5g-deals/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Sweden&#39;s Tele2 picks Nokia for 5G core network.</p>\n\n<p><a href=\"https://www.reuters.com/article/us-nokia-tele2/swedens-tele2-picks-nokia-for-5g-core-network-idUSKBN29G0JP\">https://www.reuters.com/article/us-nokia-tele2/swedens-tele2-picks-nokia-for-5g-core-network-idUSKBN29G0JP</a></p>\n\n<p>&#x200B;</p>\n\n<p>Taiwan Mobile exclusively picks Nokia for 5G.</p>\n\n<p><a href=\"https://www.nokia.com/about-us/news/releases/2020/06/29/nokia-wins-exclusive-taiwan-mobile-5g-deal/\">https://www.nokia.com/about-us/news/releases/2020/06/29/nokia-wins-exclusive-taiwan-mobile-5g-deal/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Nokia partners with M1 for 5G standalone in Singapore.</p>\n\n<p><a href=\"https://finance.yahoo.com/news/nokia-nok-partners-m1-5g-134301276.html\">https://finance.yahoo.com/news/nokia-nok-partners-m1-5g-134301276.html</a></p>\n\n<p>&#x200B;</p>\n\n<p>**TLDR: According to the news, Nokia is quite literally going to the moon.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-Key observations from above news articles- (Fair warning, this is strictly plagiarized aka copy + pasted straight from above news sources.</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Kevin Stine, **Chief** of the Applied Cybersecurity Division at **NIST**, said: “5G will touch every aspect of our lives and security must be integrated up front rather than an add-on element of 5G networks. We’re looking forward to working with our project collaborators such as Nokia to show 5G’s advanced standards based security features as well an architecture that leverages foundational security capabilities available in cloud technologies.”</p>\n\n<p>&#x200B;</p>\n\n<p>Raghav Sahgal, President, Cloud and Network Services at Nokia, said: “Previous cellular technology generations have been industry-led whereas 5G development must evolve in collaboration with governments to ensure availability and access of secure trusted networks. The 5G Cybersecurity Project fills this role with a cross-section of government and industry collaborators on board. At Nokia, we embed security into every solution that we ship, and we are committed to enabling the secure shift to the cloud by working with government agencies and the industry to advance cybersecurity for 5G use cases that leverage both open and commercial components.”</p>\n\n<p>&#x200B;</p>\n\n<p>About NIST NCCoE - National Institue of Standards and Technology</p>\n\n<p>The NCCoE, a part of NIST, is a collaborative hub where industry organizations, government agencies, and academic institutions work together to address businesses’ most pressing cybersecurity issues. This public-private partnership enables creation of practical cybersecurity solutions for specific industries, as well as for broad, cross-sector technology challenges. Through consortia under CRADAs, including technology partners—from Fortune 50 market leaders to smaller companies specializing in information technology and operational technology security—the NCCoE applies standards and recommended practices to develop modular, easily adaptable example cybersecurity solutions by using commercially available technology. The NCCoE documents these example solutions in the NIST Special Publication 1800 series, which maps capabilities to the NIST Cybersecurity Framework and details the steps needed for another entity to re-create the example solution. The NCCoE was established in 2012 by NIST in partnership with the State of Maryland and Montgomery County, Maryland. Information is available at <a href=\"https://www.nccoe.nist.gov\">https://www.nccoe.nist.gov</a>. </p>\n\n<p>Taken from <a href=\"https://www.globenewswire.com/news-release/2021/01/14/2158714/0/en/Nokia-selected-for-U-S-Federal-5G-Cybersecurity-Project.html\">https://www.globenewswire.com/news-release/2021/01/14/2158714/0/en/Nokia-selected-for-U-S-Federal-5G-Cybersecurity-Project.html</a></p>\n\n<p>&#x200B;</p>\n\n<p>**TLDR: Show me the charts, I&#39;ll tell you the news.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-Stock Rankings-</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Do yourself a favor. GOOGLE &quot;What is Zacks Ranking&quot;</p>\n\n<p>Zacks ranking rates a stock on a scale from 1-5. 1 Being a strong buy while 5 is a strong sell.</p>\n\n<p>&quot;The Zacks Rank is a short-term stock recommendation of 1-3 months that is based on analyst earnings estimate revisions. It is designed to weed out the companies with rising earnings estimates.</p>\n\n<p>... Remember, the Zacks Rank is generated daily.&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>&quot;People also ask: Is Zacks a good rank?&quot;</p>\n\n<p>&quot;Since 1988, Zacks #1 Rank stocks have generated an annualized return of 25.67%, nearly three times better than the S&amp;P 500&#39;s return of 10.79%. The Zacks Rank has also been very successful in telling investors which stocks to avoid. Since 1988, Zacks #5 Rank stocks have been flat..&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>Zacks basically states that Nokia is worthwhile with solid fundamentals and ranks Nokia a 3, or &quot;Hold&quot;.</p>\n\n<p>To comprise this ranking, however, Zacks evaluates a stock on 4 different areas. Value, Growth, Momentum, and an averaged score of all 3.</p>\n\n<p>This particular evaluation is graded like a report card in school: A, B, C, D, or the big fat red F.</p>\n\n<p>As far as the average Value, Growth, and Momentum score is concerned, Nokia gets an A:</p>\n\n<p><a href=\"https://preview.redd.it/7rt8d4mms6c61.png?width=813&amp;format=png&amp;auto=webp&amp;s=2f84ab111c518ae617c133144bd68af27111d1d4\">https://preview.redd.it/7rt8d4mms6c61.png?width=813&amp;format=png&amp;auto=webp&amp;s=2f84ab111c518ae617c133144bd68af27111d1d4</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/8q0jhmhns6c61.png?width=398&amp;format=png&amp;auto=webp&amp;s=e1ae6e89fc93ab8b9d635799463ebd953ba789f1\">https://preview.redd.it/8q0jhmhns6c61.png?width=398&amp;format=png&amp;auto=webp&amp;s=e1ae6e89fc93ab8b9d635799463ebd953ba789f1</a></p>\n\n<p>&#x200B;</p>\n\n<p>As far as Nokia being ranked a 3, or &quot;Hold&quot; rating:</p>\n\n<p>&quot;Zacks #3 Rank Stocks Can Be Perfectly Acceptable. </p>\n\n<p>I bet that title attracted your attention. You most likely have heard us refer to stocks with a Zacks #1 Rank as being the “cream of the crop.” It is understandable why. These stocks represent the top 5% of all stocks that are covered by at least one analyst and are expected to experience the strongest earnings estimate revisions in the future.&quot;</p>\n\n<p><a href=\"https://www.zacks.com/stock-education/54/How-to-Use-Zacks-Rank-3--Hold-\">https://www.zacks.com/stock-education/54/How-to-Use-Zacks-Rank-3--Hold-</a></p>\n\n<p>&#x200B;</p>\n\n<p>I&#39;ll admit, I haven&#39;t looked into the above claim of #1 rankings hitting 25.67% annualized returns. I am only adding Zacks ranking here for analytical and historical purposes.</p>\n\n<p>&#x200B;</p>\n\n<p>**TLDR: Zacks rank says to hold, as it could go up or down, but gives Nokia a &quot;Grade A&quot; rating for value, growth, and momentum potential.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-Social Media influence-</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Social Media is by far my favorite trading &#39;indicator&#39;, because of how funny human behavior and psychology can be.</p>\n\n<p>It is absolutely in my opinion one of the most underutilized tools a person can have in their analysis arsenal.</p>\n\n<p>When you were a kid and someone told you &quot;I bet you can&#39;t throw this rock farther than me!&quot;, what did you do?</p>\n\n<p>Or how about as a kid, your closest friend/friends always told you that you&#39;d never beat their high score in video games.</p>\n\n<p>To this day, when someone or especially multiple people try to tell you that you cannot do/achieve something, what do you try to do?</p>\n\n<p>Or how about today, where a very large Social Media sentiment is that Nokia is a complete waste of time?</p>\n\n<p>The float of 5.6 billion outstanding shares is too high, there&#39;s absolutely no way the price can move!</p>\n\n<p>Or what about all the people that had too strong of hands and didn&#39;t cut their losses much earlier on?</p>\n\n<p>All those people trashing Nokia&#39;s name? Saying they can&#39;t do something? They won&#39;t move? Flatter than a pancake?</p>\n\n<p>&#x200B;</p>\n\n<p>I have noticed that within the past few weeks, there has been a significant uptick in posts regarding Nokia on the first and third largest investing forums Reddit has. Their names? <a href=\"/r/Wallstreetbets\">/r/Wallstreetbets</a> and <a href=\"/r/Stocks\">/r/Stocks</a>.</p>\n\n<p>Currently, <a href=\"/r/Wallstreetbets\">/r/Wallstreetbets</a> has the largest following of 1.9 million members, <a href=\"/r/Investing\">/r/Investing</a> comes in 2nd at 1.3 million members, and the third largest investing forum on Reddit is <a href=\"/r/Stocks\">/r/Stocks</a> and it has 1.1 million members.</p>\n\n<p>Take a look around on Wallstreetbets and you will quickly realize that forum can legitimately move the market. No joke.</p>\n\n<p>Teh stocks forum is far more conservative than the WSB one, yet, Nokia is still popping up quite frequently these past couple weeks in both.</p>\n\n<p>Interesting to note however that the second biggest investing forum on Reddit is <a href=\"/r/Investing\">/r/Investing</a>, and it has ZERO posts about Nokia since 12/08/20. That post didn&#39;t even garner a single reply. Hmm.. Weird.</p>\n\n<p>&#x200B;</p>\n\n<p>Do yourself a favor. Go into some of these older posts and read the comments. Notice anything?</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/search?q=nokia&amp;restrict_sr=1&amp;sort=relevance&amp;t=year\">https://www.reddit.com/r/wallstreetbets/search?q=nokia&amp;restrict_sr=1&amp;sort=relevance&amp;t=year</a></p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/search?q=nokia&amp;restrict_sr=1&amp;sort=relevance&amp;t=year\">https://www.reddit.com/r/stocks/search?q=nokia&amp;restrict_sr=1&amp;sort=relevance&amp;t=year</a></p>\n\n<p>&#x200B;</p>\n\n<p>Then, read these newer ones.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kz5i7g/another_exphone_company_nokia_the_sleeping_giant/\">https://www.reddit.com/r/wallstreetbets/comments/kz5i7g/another_exphone_company_nokia_the_sleeping_giant/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/kyltua/is_nokia_a_good_long_term_buy_current_market/\">https://www.reddit.com/r/stocks/comments/kyltua/is_nokia_a_good_long_term_buy_current_market/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/ky28jf/its_starting_nokia_is_coming_back_bb_is_good_but/\">https://www.reddit.com/r/wallstreetbets/comments/ky28jf/its_starting_nokia_is_coming_back_bb_is_good_but/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/stocks/comments/kyqn33/i_cant_be_the_only_one_who_sees_the_potential_in/\">https://www.reddit.com/r/stocks/comments/kyqn33/i_cant_be_the_only_one_who_sees_the_potential_in/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kybiy3/nokia_nok_is_going_to_be_moving_quick_next_week/\">https://www.reddit.com/r/wallstreetbets/comments/kybiy3/nokia_nok_is_going_to_be_moving_quick_next_week/</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/?utm_source=share&amp;utm_medium=web2x&amp;context=3\">https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/?utm_source=share&amp;utm_medium=web2x&amp;context=3</a></p>\n\n<p><a href=\"https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/\">https://www.reddit.com/r/wallstreetbets/comments/kx6kws/nok_invest_in_the_future/</a></p>\n\n<p>&#x200B;</p>\n\n<p>&quot;Nothing can honestly move NOK out of the 4-4.25 range unfourt. Too big and too old.&quot;</p>\n\n<p>&quot;Nokia doesn’t move dude, let alone QUICKLY HAHAHA&quot;</p>\n\n<p>&quot;NOKIA is dogshit held that trashbag for years sold for a small loss.&quot;</p>\n\n<p>&quot;Nice try but NOK is a flaming POS. You can’t pump it. Held it for 6 years. POS&quot;</p>\n\n<p>&quot;Nokia has a staggering 5.32B free float! Not quite easy for this monster to move&quot;</p>\n\n<p>&quot;This fat boy ain’t moving (yet)&quot;</p>\n\n<p>&quot;I bought some $5 and $7 calls for 2023 so i hope you&#39;re right, with 5 billion float it&#39;ll probably never get there but it wasn&#39;t too expensive for some lottery tickets&quot;</p>\n\n<p>&#x200B;</p>\n\n<p>What is my point here? What angle am I getting at? H Y P E. How do you create serious hype/FOMO for a stock in todays world? It needs some sort of &#39;reputation&#39;. A very negative one is best. Why?</p>\n\n<p>Nokia is known for having a giant outstanding share supply. They&#39;re known for being in a decades long downtrend. They&#39;re known for not being worth investing in, plain and simple.</p>\n\n<p>So, back to human behavior. If you look back at the past year ish or so of comments on social media regarding Nokia, the stock has built quite the negative reputation.</p>\n\n<p>&#x200B;</p>\n\n<p>You NEVER hear about Nokia. You never see it in the news. You never hear its name anymore other than when people reminisce of the good old days- where products were ackshually built to last!</p>\n\n<p>You don&#39;t see the Nokia brand anywhere anymore.. Its name doesn&#39;t show up on TV, or in the newspaper, or on ticker news feeds, nothing. Nowhere. Nada. Zilch.</p>\n\n<p>What would happen if, say, Nokia suddenly had a +50% day out of nowhere? EVERYONE who ever doubted Nokia or even heard their name are quickly reminded that they are still alive.</p>\n\n<p>These people are seemingly  so brainwashed at this point that Nokia is not a worthwhile investment, they don&#39;t even bother. Even though it just rocketed 50%. Meh, just a dead cat bounce. </p>\n\n<p>Nah, they&#39;ll stay out and chase their gains in PLTR or GME or BB or whatever the current meme stocks are for the day.</p>\n\n<p>Next day, Nokia rockets again while maybe other meme/blue chip stocks and/or indexes are flat or negative. See where I&#39;m going with this here?</p>\n\n<p>&#x200B;</p>\n\n<p>THE very M O M E N T Nokia rips a hulk dildo on the chart, everyone and their mother is going to know about it.</p>\n\n<p>Meh, just a dead cat bounce. Right guys? ...Right?</p>\n\n<p>Then it goes up. Again. While a lot of people including I/you were waiting for a pullback.</p>\n\n<p>See where I&#39;m going with this here?</p>\n\n<p>&#x200B;</p>\n\n<p>STRICTLY because of Nokia&#39;s reputation and the extreme negative sentiment surrounding it in Social Media, this is a perfect play.</p>\n\n<p>When it finally rips loose, everyone and their brother is going to be waiting for a pullback. What if it doesn&#39;t come soon enough?</p>\n\n<p>Imagine the FOMO.</p>\n\n<p>A multi decade long downtrend is clearly reversing. You can see it in the chart, trend lines, and in the sentiment. This was rock bottom.</p>\n\n<p>**TLDR: Imagine the FOMO.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-Google Trends-</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>Google Trends can be a fun &#39;indicator&#39; of sorts to use. It doesn&#39;t necessarily mean anything, BUT, it can yield an interesting metric.</p>\n\n<p>How outright BORING something is or isn&#39;t.</p>\n\n<p>How UNDERAPPRECIATED something is or isn&#39;t.</p>\n\n<p>How many people would choose to talk about anything BUT ... that.</p>\n\n<p>How .. dare I say, **undervalued** something is? Or how popular something is? lolNokia.</p>\n\n<p>&#x200B;</p>\n\n<p>When you think of Nokia, what is the first thing you think of? For me, it is those damn 3310 phone models. The ones that just .. wouldn&#39;t die. No matter what you did to them. </p>\n\n<p>At this point, Nokia has apparently upgraded its appetite. Let&#39;s face it. In todays world of **planned obsolescence** especially in the smartphone world, Nokia doesn&#39;t stand a chance because of how many competitors it has!</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-This is a 17 year chart from Google Trends.</p>\n\n<p>12/2011 - 01/11. Nokia absolutely TANKS in relevance. I wonder why?</p>\n\n<p>01/2016. Nokia suddenly for the most part flatlines after a decent drop.</p>\n\n<p>If we compare this to a heart beat monitor, Nokia&#39;s relevancy is [still] legit dead. </p>\n\n<p>Dead. Not coming back. Can&#39;t start, won&#39;t start, NOStart. OD&#39;D and narcan can&#39;t save it.</p>\n\n<p><a href=\"https://preview.redd.it/exy129hxs6c61.png?width=1168&amp;format=png&amp;auto=webp&amp;s=baef9ace234ff1e9413a7b7b472b24a896fbe212\">https://preview.redd.it/exy129hxs6c61.png?width=1168&amp;format=png&amp;auto=webp&amp;s=baef9ace234ff1e9413a7b7b472b24a896fbe212</a></p>\n\n<p>&#x200B;</p>\n\n<p>My dude BS says hi! 8D</p>\n\n<p><a href=\"https://preview.redd.it/q7x4xxbys6c61.png?width=790&amp;format=png&amp;auto=webp&amp;s=be55330e4d0e4342e59a3004a0baadf45cac4935\">https://preview.redd.it/q7x4xxbys6c61.png?width=790&amp;format=png&amp;auto=webp&amp;s=be55330e4d0e4342e59a3004a0baadf45cac4935</a></p>\n\n<p>&#x200B;</p>\n\n<p>1/27/2011 Nokia beat expectations by 6.7%! Therefore, it must go DOWN, amirite? &gt;:(</p>\n\n<p><a href=\"https://ibb.co/y4BYwFX\">https://ibb.co/y4BYwFX</a></p>\n\n<p>&#x200B;</p>\n\n<p>From that 6.7% positive earnings report? Nokia **tanks**, AGAIN, only this time -84.72%. Yep. You saw that right.</p>\n\n<p>I wonder if the bear flag had anything to do with it, though?</p>\n\n<p><a href=\"https://www.tradingview.com/x/MPU2TxMz/\">https://www.tradingview.com/x/MPU2TxMz/</a></p>\n\n<p>&#x200B;</p>\n\n<p>Hmmm.</p>\n\n<p>**TLDR: Google Trends says Nokia is a <strong>massive</strong> buy opportunity.</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-This is a yearly chart from Google Trends.</p>\n\n<p>It&#39;s flatter than The Earth. Nothing to see here, folks. BUT WAIT, IT FUGGIN QUADRUPLE BOTDUMBED. kek. </p>\n\n<p>Nothing to see here, folks.</p>\n\n<p><a href=\"https://ibb.co/Xpt0KQb\">https://ibb.co/Xpt0KQb</a></p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-This is a weekly chart from Google Trends.</p>\n\n<p>Eureka! We have something to report, kinda!</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://ibb.co/bPSq67Y\">https://ibb.co/bPSq67Y</a></p>\n\n<p><a href=\"https://ibb.co/DMKj0jH\">https://ibb.co/DMKj0jH</a></p>\n\n<p>1/15/21 Nokia spikes on the Google Trends weekly chart at 10 PM. weird.</p>\n\n<p>Even weirder, since I started updating this portion of this DD, Texas and Kentucky have joined the NokiTrain!</p>\n\n<p>&#x200B;</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>-The Float Fallacy- Last but not least ;D</p>\n\n<p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p>\n\n<p>&#x200B;</p>\n\n<p>Lastly, I would just like to address the echo chambered and (in MY opinion) incorrect opinion of how Nokia cannot move well or quickly in price because of what I will call &quot;The Float Fallacy.&quot;</p>\n\n<p>Nokia has a grand total of 5.6 billion shares that make up the company, otherwise known as &quot;The Float&quot;. Nokia has a market cap currently of $22.1B.</p>\n\n<p>That means when you multiply the total supply of tradable shares to how much money they each are trading for, you get the total overall valuation of a company.</p>\n\n<p>The majority opinion everywhere on Nokia above all else, is that it cannot move due to its float size. Essentially, people are arguing that you&#39;d need to buy substantially more shares</p>\n\n<p>in order to move the price than you would a different company. While this is generally true, the AMOUNT OF MONEY TRADED STAYS THE SAME.</p>\n\n<p>&#x200B;</p>\n\n<p>To give you an idea of why the float doesn&#39;t matter, we can compare Nokia&#39;s market cap to the market cap sizes and share values of other competitors.</p>\n\n<p>First example I will use is Ericsson. Ericsson has a market cap of $36.13B. Their share price is currently $11.76. Now, again, think about the MONEY, not the shares.</p>\n\n<p>Say I wanted to invest $100 in a given stock. I could buy 8.5 shares in total of Ericsson. Or, I could get 24.5 shares of Nokia for THE SAME AMOUNT OF MONEY.</p>\n\n<p>What sounds more appealing to you? Owning 8.5 shares in a company, or nearly 3 times as much?</p>\n\n<p>&#x200B;</p>\n\n<p>So let&#39;s compare market cap sizes with a few competitors to see just how much growth potential Nokia truly has.</p>\n\n<p>We will just use the major companies listed alongside Nokia on the U.S. Federal 5G Cybersecurity Project.</p>\n\n<p>&#x200B;</p>\n\n<p>AT&amp;T</p>\n\n<p>Market cap: $207.87B</p>\n\n<p>Share price: $29.17</p>\n\n<p>Float: 7.13B</p>\n\n<p>&#x200B;</p>\n\n<p>Cisco</p>\n\n<p>Market cap: $191.97B</p>\n\n<p>Share price: $45.43</p>\n\n<p>Float: 4.22B</p>\n\n<p>&#x200B;</p>\n\n<p>Dell</p>\n\n<p>Market cap: $55.68B</p>\n\n<p>Share price: $74.26</p>\n\n<p>Float: 0.77B</p>\n\n<p>&#x200B;</p>\n\n<p>Intel</p>\n\n<p>Market cap: $235.96B</p>\n\n<p>Share price: $57.58</p>\n\n<p>Float: 4.1B</p>\n\n<p>&#x200B;</p>\n\n<p>T-Mobile</p>\n\n<p>Market cap: $157.98B</p>\n\n<p>Share price: $127.28</p>\n\n<p>Float: 1.24B</p>\n\n<p>&#x200B;</p>\n\n<p>These figures show the valuation that Nokia can and will eventually hit.</p>\n\n<p>The only real negative effect of having 5.6 billion outstanding shares is that it can take a while for them to become more widely dispersed rather than overconcentrated.</p>\n\n<p>Meaning a very select few absurdly rich people can and have been suppressing the price. The more they do it though, the more insane opportunities it gives you. That&#39;s the entire point.</p>\n\n<p>So, in a way, float does matter, but that is EXACTLY WHY this is such a winning proposition. The more shares WE buy, the less THEY have and can control.</p>\n\n<p>anddd, I&#39;m done. Finally. This is my  very last update regarding Nokia until $0.20 is no longer a gigantic  movement.</p>\n\n<p>Shoutout to John. I just wanna help people too. Seems like I&#39;m apparently doing it wrong but idk.</p>\n\n<p><strong>DISCLAIMER:  I am not a financial advisor. What is written in its entirety in this  idea is my opinion - specifically, MY thoughts on a chart. That does not  make me correct on the above informations.</strong></p>\n\n<p><strong>I only started &#39;trading&#39; a little over 4 years ago - and started &#39;trading&#39; stocks in the beginning of 2020.</strong></p>\n\n<p><strong>DYOR.</strong></p>\n\n<p>P.S. a limit on 20 images sucks :|</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://www.youtube.com/watch?v=N2qwXdA7K80\">https://www.youtube.com/watch?v=N2qwXdA7K80</a></p>\n\n<p>Does Nokia go BIG or does it go HOME?</p>\n\n<p>🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀</p>\n\n<p>🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀</p>\n\n<p>🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀</p>\n\n<p>🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀   🚀   🚀  🚀  🚀    🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀    🚀  🚀  🚀</p>\n\n<p>🚀   🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀    🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀   🚀  🚀  🚀     🚀  🚀  🚀</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 400, "id": "award_84276b1e-cc8f-484f-a19c-be6c09adc1a5", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_512.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_16.png", "width": 16, "height": 16}, {"url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_32.png", "width": 32, "height": 32}, {"url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_48.png", "width": 48, "height": 48}, {"url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_64.png", "width": 64, "height": 64}, {"url": "https://www.redditstatic.com/gold/awards/icon/SnooClapping_128.png", "width": 128, "height": 128}], "icon_width": 512, "static_icon_width": 512, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "An amazing showing.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 512, "name": "Bravo!", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png?width=16&height=16&auto=webp&s=647cccf78702582f30d23908180da092b135cffe", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png?width=32&height=32&auto=webp&s=4644ac0618ecdef010ae2368e2e58669953fd9a3", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png?width=48&height=48&auto=webp&s=ca4efb2faa26429279f44ced2822f5e81ff37537", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png?width=64&height=64&auto=webp&s=3a307ad71aad031accfd47f1af82a2b1e09195cc", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png?width=128&height=128&auto=webp&s=fb9b2c432b1ddd85fd653ef3cc1a28e5edc40a1f", "width": 128, "height": 128}], "icon_format": "APNG", "icon_height": 512, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/m5fdvo7cl4451_Bravo-Static.png"}, {"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 100, "id": "award_abcdefe4-c92f-4c66-880f-425962d17098", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=16&height=16&auto=webp&s=26e20b03316dade0c334e0dc94bffefc9b5aa631", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=32&height=32&auto=webp&s=a837f262573009bb5e05d09136fff6e562b8b5ff", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=48&height=48&auto=webp&s=786cf9e11fd170c638b5c643b7ded488da4385b1", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=64&height=64&auto=webp&s=8d95e824d8b33ef5a3b3ba65e5cf80c45728a1a1", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=128&height=128&auto=webp&s=8575d3ac8befa3b39a4d25eb93cac40867b415cb", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "I don't need it, I don't even necessarily want it, but I've got some cash to burn so I'm gonna get it.", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Burning Cash", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=16&height=16&auto=webp&s=26e20b03316dade0c334e0dc94bffefc9b5aa631", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=32&height=32&auto=webp&s=a837f262573009bb5e05d09136fff6e562b8b5ff", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=48&height=48&auto=webp&s=786cf9e11fd170c638b5c643b7ded488da4385b1", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=64&height=64&auto=webp&s=8d95e824d8b33ef5a3b3ba65e5cf80c45728a1a1", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png?width=128&height=128&auto=webp&s=8575d3ac8befa3b39a4d25eb93cac40867b415cb", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_22cerq/kqr00h8b7q161_BurningCash.png"}, {"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 80, "id": "award_8352bdff-3e03-4189-8a08-82501dd8f835", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Everything is better with a good hug", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Hugz", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "l08brv", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "mysecretupvoteacct", "fullname": "t2_7po5ka03"}, "discussion_type": null, "num_comments": 97, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/l08brv/nokia_go_big/", "subreddit_subscribers": 1890703, "created_utc": 1611017747.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 94, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs2935", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ZillaJe", "fullname": "t2_33tc0rwj"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l08brv", "score": 94, "author_fullname": "t2_33tc0rwj", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Dude holy shit I can’t read", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Dude holy shit I can’t read</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs2935/", "num_reports": null, "locked": false, "name": "t1_gjs2935", "created": 1611046779.0, "author_flair_text": "", "treatment_tags": [], "created_utc": 1611017979.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 15, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs2n7h", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "mysecretupvoteacct", "fullname": "t2_7po5ka03"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2935", "score": 15, "author_fullname": "t2_7po5ka03", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": ">Dude holy shit I can’t read\n\nHalp I've fallen and can't get it up", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><blockquote>\n<p>Dude holy shit I can’t read</p>\n</blockquote>\n\n<p>Halp I&#39;ve fallen and can&#39;t get it up</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs2n7h/", "num_reports": null, "locked": false, "name": "t1_gjs2n7h", "created": 1611046994.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611018194.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 13, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs5oc6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "everlastingdeath", "fullname": "t2_g464h"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2935", "score": 13, "author_fullname": "t2_g464h", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "There was no TLDR. What did this guy even say?", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "\u001b210107:3:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>There was no TLDR. What did this guy even say?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs5oc6/", "num_reports": null, "locked": false, "name": "t1_gjs5oc6", "created": 1611048621.0, "author_flair_text": "\u001b210107:3:1", "treatment_tags": [], "created_utc": 1611019821.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 11, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs6d34", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "realtimetrader", "fullname": "t2_7ych24tn"}, "can_mod_post": false, "created_utc": 1611020184.0, "send_replies": true, "parent_id": "t1_gjs5oc6", "score": 11, "author_fullname": "t2_7ych24tn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Dude there was like 5 tldr’s. They each needed their own tldr", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Dude there was like 5 tldr’s. They each needed their own tldr</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs6d34/", "num_reports": null, "locked": false, "name": "t1_gjs6d34", "created": 1611048984.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs8nhg", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "mysecretupvoteacct", "fullname": "t2_7po5ka03"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs6d34", "score": 5, "author_fullname": "t2_7po5ka03", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Hey man, I've learned a bit since my first post.\n\nThat's what the 342 rockets are for, or so I have been told.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Hey man, I&#39;ve learned a bit since my first post.</p>\n\n<p>That&#39;s what the 342 rockets are for, or so I have been told.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs8nhg/", "num_reports": null, "locked": false, "name": "t1_gjs8nhg", "created": 1611050186.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611021386.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjsajgs", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "realtimetrader", "fullname": "t2_7ych24tn"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs8nhg", "score": 3, "author_fullname": "t2_7ych24tn", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Well there is no second guessing your sentiment. I scroll down and I get a rocket paragraph, I know what to do", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Well there is no second guessing your sentiment. I scroll down and I get a rocket paragraph, I know what to do</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjsajgs/", "num_reports": null, "locked": false, "name": "t1_gjsajgs", "created": 1611051175.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611022375.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 4, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs6aby", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "RonnieVanDan", "fullname": "t2_1t5w5zz3"}, "can_mod_post": false, "created_utc": 1611020144.0, "send_replies": true, "parent_id": "t1_gjs5oc6", "score": 5, "author_fullname": "t2_1t5w5zz3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Nokia 🚀🚀🚀🚀", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Nokia 🚀🚀🚀🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs6aby/", "num_reports": null, "locked": false, "name": "t1_gjs6aby", "created": 1611048944.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs73rz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "estacks", "fullname": "t2_12n5x1"}, "can_mod_post": false, "created_utc": 1611020570.0, "send_replies": true, "parent_id": "t1_gjs5oc6", "score": 3, "author_fullname": "t2_12n5x1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "TREND LINES DIDNT READ", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>TREND LINES DIDNT READ</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs73rz/", "num_reports": null, "locked": false, "name": "t1_gjs73rz", "created": 1611049370.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjsbsca", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "HoboGir", "fullname": "t2_nbn4r88"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2935", "score": 2, "author_fullname": "t2_nbn4r88", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Gourd damn that was a long post", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Gourd damn that was a long post</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjsbsca/", "num_reports": null, "locked": false, "name": "t1_gjsbsca", "created": 1611051830.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611023030.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 57, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs27kv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ilikepie145", "fullname": "t2_40fn61iy"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l08brv", "score": 57, "author_fullname": "t2_40fn61iy", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "With this much DD it literally can't go tits up", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>With this much DD it literally can&#39;t go tits up</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs27kv/", "num_reports": null, "locked": false, "name": "t1_gjs27kv", "created": 1611046755.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611017955.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs2avi", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "tu_test_bot", "fullname": "t2_4q7qjfqu"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs27kv", "score": 10, "author_fullname": "t2_4q7qjfqu", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Stonks go up, bears go down", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Stonks go up, bears go down</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs2avi/", "num_reports": null, "locked": false, "name": "t1_gjs2avi", "created": 1611046804.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611018004.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 59, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs2p2f", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "dreamedaxis", "fullname": "t2_58ygqc51"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_l08brv", "score": 59, "author_fullname": "t2_58ygqc51", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Who else made it to the comments?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b210113:1:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Who else made it to the comments?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs2p2f/", "num_reports": null, "locked": false, "name": "t1_gjs2p2f", "created": 1611047023.0, "author_flair_text": "\u001b210113:1:1", "treatment_tags": [], "created_utc": 1611018223.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs9kw6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Troostboost", "fullname": "t2_nel9x"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2p2f", "score": 7, "author_fullname": "t2_nel9x", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "My fingers cramped half way down while swiping but I made it...", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>My fingers cramped half way down while swiping but I made it...</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs9kw6/", "num_reports": null, "locked": false, "name": "t1_gjs9kw6", "created": 1611050670.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611021870.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjsag5u", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "dreamedaxis", "fullname": "t2_58ygqc51"}, "can_mod_post": false, "created_utc": 1611022327.0, "send_replies": true, "parent_id": "t1_gjs9kw6", "score": 4, "author_fullname": "t2_58ygqc51", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "My eyes got fucked trying to skim through everything fast", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "\u001b210113:1:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>My eyes got fucked trying to skim through everything fast</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjsag5u/", "num_reports": null, "locked": false, "name": "t1_gjsag5u", "created": 1611051127.0, "author_flair_text": "\u001b210113:1:1", "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs5csa", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "mysecretupvoteacct", "fullname": "t2_7po5ka03"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2p2f", "score": 3, "author_fullname": "t2_7po5ka03", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "😆", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>😆</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs5csa/", "num_reports": null, "locked": false, "name": "t1_gjs5csa", "created": 1611048455.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611019655.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_l08brv", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gjs5qag", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "big_rig_pig", "fullname": "t2_7dehwt5v"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gjs2p2f", "score": 2, "author_fullname": "t2_7dehwt5v", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Just barely. Only after I saw the 🚀🚀🚀🚀", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Just barely. Only after I saw the 🚀🚀🚀🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/l08brv/nokia_go_big/gjs5qag/", "num_reports": null, "locked": false, "name": "t1_gjs5qag", "created": 1611048649.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1611019849.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}