{"approved_at_utc": null, "selftext": "There are plenty of 🚀🚀🚀🚀 to keep your attention. This will be long. This will be epic. It even includes a physics lesson and how GME is in a physics equation, validating Valhalla. \n\nJust as reminder, most of you should have possibly received your first “welcome” $5 certificate from GME. Your first month’s Certificates will be available at the beginning of calendar month. So by tomorrow you should have $10 incentive to make it rain at GME. (You can end up with $75 in certificates in the 12 month period)\n\n\nSince “people” are lurking and keeping tabs on us, let me have your full attention with this. \n\nRyan is Vito Corleone and Mel is Don Ciccio. More on this later, but just in case you are clueless, here is a little [preview.](https://youtu.be/gCdXiOssbM0)\n\nSince many people like to compare GME to BlockBuster, both BlockBuster and Toys R Us can be Antonio Andolini. I’ll include an important economic lesson later regarding all 3 companies. \n\n\nI want to start some #️⃣ #trends \n\n#1. #TheDogFather \n\nI think it’s very fitting for our savior Lord Cohen. Yet still “clean” and catchy for mainstream media. He may be aware of us, but we want him to know that we support him and are looking forward to him. \n\n#2. #AnOfferHeCantRefuse\n\nI think we all know this one...\n\n\n#3. #HireOptimusPrimo\n\nGME didn’t take me seriously. I contacted HQ, the HR department specifically. I said I would like to get on board with GME and that I’m responsible for a massive spike in their memberships. The guy was dumbfounded of my request to look into Pro Membership numbers and said he would “email others to look into it and they may contact” me...then he suggested that I should still apply for positions at GME....when I said I want to be on board, I literally meant the board....but I’ll be willing to start off as a district manager or in marketing. \n\nNow it’s been a few days, and I know it’s right before New Years, but Sherman has yet to contact me. Then again, he doesn’t even have twitter, showing how old school he is. \n\n3) I will need your input for additional # \n——————————————————————————\n\n\n#Official Start of the Post\n\nWSB is what GME is to the general public. Just like GME, most people don’t understand WSB and have a negative view on us. They hear rumors, see glimpses and glorified headlines and make their opinion on WSB. \n\nAre we perfect? Hell no. Are we saints? Absolutely not. Do we have some bad apples who are cringeworthy that even we at WSB despise? Absolutely! WSB isn’t for soft ❄️ and the faint of heart individuals who take things at face value. \n\nThe truth is, just like GME, there is a lot of positives to us, but not everyone notices that and looks at both GME and WSB as pure evil. **Many are betting against GME and WSB.** Unfortunately for them, both are here to stay, and will become a greater presence as time goes on. \n\n\nHave you ever beat it up so good that months later  they contacted you back for a repeat? Well you haven’t, but your wife can attest to this experience.\n\n**“The axe forgets what the tree remembers.”**\n\nBefore I lose you since this will be a lengthy post with lofty goals of charity and coordinated social media presence...\n\nGME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🌕🌕🌕🌕🌕🌕📈📈📈📈📈📈📈\n\n\nThis is an attempt to coordinate our efforts and become a more powerful force to be reckoned with. \n\n##Speaking of Force, even Physics validates GME🚀🚀🚀 🚀🚀🚀\n\nYou see there is an equation for Newton’s Law of Universal Gravitation. The law is that objects with greater masses have a greater (attraction) gravitational force. The attractive force is directly related to the mass of the objects, and inversely related to the distance between them. \n\nThe more massive the objects, the greater the force. The greater the distance, the less of the force. Want proof? Have you ever seen any chicks on my 600 lb life who is single? They all have a partner. Have you seen the 1000 lb sisters? One of them is currently pregnant. That means that someone, possibly one of you, managed to get her pregnant. \n\nThe law validates itself, the more massive you are, the more attractive you become. GME has been a massive target for shorts, it has been and will remain a huge attraction to shorts and bears. \n\nGME is so attractive, that Mel left GME for dead. They could’ve closed positions, they weren’t satisfied at $4. They want GME bankrupt. \n\nDon Ciccio was wise enough to order Vito to be killed when he was 9, but his foot soldiers weren’t the best. In fact, when Vito’s mom begged Don Ciccio to spare Vito who is ”dumb-witted and only 9 years old” after having killed her husband and her oldest son who has vowed revenge; Don Ciccio responded “when he becomes bigger, he will come for revenge and kill me.” \n\nSo calling Mel Don Ciccio is an insult because Don Ciccio was wise to attempt to tie up loose ends, but the fate is the same. \n\nBack to Physics: The law and equation...\n\nThe equation (for Earth) is:\n\n#F = GMeM / Re^2\n\n##Can you believe this???\n\nWe all know what Re means...but if they are scattered and too far from each other, the force is not as great. This is why we have to recruit and bring all the scattered individuals to join the cause. The closer the distance of Re, the greater the force. \n\n\n\nWith that said, not all forces are evil, and we will be benefiting many great causes. \n\nWe are the leading sub in gifting awards, by a landslide, and that’s not even coordinated. Imagine if we did actually start to coordinate for our goals. \n\nFFS, **we may have set the record of most awards given to a post** for a post that said to buy shares instead of awards. \n\nPeople are aware of us....but they don’t take us seriously. They notice us, they lurk for their headlines and etc, but they don’t see the true power behind us. Every now and then, they may acknowledge or refer to us, but the reality is, it is always in a negative way. In fact, that’s ok. We don’t want to give the illusion that we do charities and donations to improve our “image.” We are not like the powerful and famous people who do things for PR purposes. We are just your regular individuals who have a more giving heart then the people who look down upon us. \n\nMany people here have individually donated to charities and towards great causes, for genuine reasons, and that is far more valuable than those who donate for pure PR. \n\n##Back to the tree and axe saying:\n\nThe tree is Mel, old, ancient, and deeply rooted in their beliefs. While trees are beneficial, this one is rotten and is experiencing heart rot. On top of this, there are many termites planning on feasting (smaller position shorts and bears.) We are not going to eradicate them, we are going to hit them twice. They’ll call the first one a fluke, contribute it to new console releases, and pure luck of WSB. \n\nBut at some point, in order to realize gains, we will have to sell. Eventually time will pass, GME will be lower than its peak values because of the inevitable squeeze, and some unfortunate souls will be FOMOing at the top and be left bag holding. These bags will be so big and heavy that not even Southwest Airlines will let them fly for free. \n\nThe likes of Mel, boomer analysts, and bears will rise again and claim that it is going back to the “5 year trend.” They’ll be setting themselves up for a 2nd round...But by this time\n\n##TheDogFather Cohen has taken over GME \n\nand laid the foundations of successful business that will help GME transition and thrive. \n\n\nGME has consolidated and we’ve kept it above $19.\nBut no one is taking us seriously. There was an obvious attack that made the Uptick Rule go into effect this week, and many expected today to be the dip. We here at WSB don’t have  🧻 TP hands, but there are others who do. Those individuals are not aware of us and are easily manipulated. We should educate them, harden them up and have them join the cause.\n\nJust like how many of you and the public weren’t aware of the memberships, many people (outside of here) aren’t aware of the strategy. Or if they are, they may not understand what to do and what not to do...ie during uptick rule times and not using margins etc. \n\nWe also want to quickly spread solid info. Some of you posted my post on stock twits and noticed other people talking about it. Thank you for that, we made a reach, but we need to make it bigger. \n\nThis is where my new info and DD will come into play, and many others as well. \n\nThe reality is, many people (consumers and “investors” are still having the stereotypical view of GME. These stereotypes are leading to a downfall and an uphill battle. \n\nGetting the word out and educating people is the best thing to do, not just for GME, but for all businesses. There is great lesson to learn from and there’s more to it than just “they didn’t transition with the times”\n\nThere are valuable lessons to learn from BlockBuster and TRU, which I will get to. \n\n##At this point I have to take a break, will update soon with the rest of the post.\n\nThere will be more information about GME, benefits, and how things work as I edit this post and add it. \n\n#I’ll edit this post and update.\n\nWhy am I posting something incomplete?\n\n1) I’m a human, I have to take care of somethings and come back and finish\n\n2) You’re a human and you need the break. \n\n3) Gather interest in this post as reaching the hot posts takes time...unless you’re the guy who posted about not spending money on awards. I’ve never laughed harder from a title alone (and seeing the bukkake of awards on that post). \n\n\n#You can redeem 5k points for an additional $5 certificate or donate to the current charities GME is affiliated with. \n\nWe can also come up with our indirect donation / charity. One of my ideas was is that we can organize a program with hospitals. \n\nWe can buy memberships under fake names or possibly \n\n#Ryan Chewy\n\nThe Ryan Chewy name will serve a 2 fold purpose. Besides in the name of TheDogFather, it’ll serve as a warning signal to Sherman as what is to come and that he better not start taking credit for more “memberships and retention.”\n\nAnd use the phone number of a local children’s hospital. This bit of info can be shared with that hospital, and they can use the certificates to purchase little toys etc. Obviously the hospital would need to use their own funds to cover the remaining balance, but perhaps they already have such budget, or maybe they can set up and we can donate here and there. \n\nAt the very least, they can get a physical copy of the magazine (assuming you signed up for $20)...but since it’s COVID, the magazine can’t really be shared...so maybe digital is better.\n\nThese are just random ideas, if we combine all of our low IQs, we can come up with some good benefit drive ideas etc.\n\n#TL;DR ( so far)\n\nPost is not finished (yikes)\n\nYour welcome certificate may be available now , tomorrow you should receive your 1st monthly certificate. \n\nYou may have 2 certificates tomorrow for $10 to make it rain at GME.\n\nYou can donate your rewards points to foundations.\nIf you have change / coins, take them to GME.\n\nGME now has credit card, flex pay, and layaway plans available. \n\nRead right above the TL;DR for my ideas of donations, brainstorm and let’s get some good ideas rolling. \n\nEducate people and 🚀🚀🚀🚀🚀🚀", "author_fullname": "t2_nkled", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "🚀GME DD PT2 🚀🚀🚀🚀 + Coordinated Charity for Autism and Kids + making it rain at GME + Coordinated Social Media", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_knxf4f", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.89, "author_flair_background_color": null, "subreddit_type": "public", "ups": 23, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 23, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": 1609447922.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609475292.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>There are plenty of 🚀🚀🚀🚀 to keep your attention. This will be long. This will be epic. It even includes a physics lesson and how GME is in a physics equation, validating Valhalla. </p>\n\n<p>Just as reminder, most of you should have possibly received your first “welcome” $5 certificate from GME. Your first month’s Certificates will be available at the beginning of calendar month. So by tomorrow you should have $10 incentive to make it rain at GME. (You can end up with $75 in certificates in the 12 month period)</p>\n\n<p>Since “people” are lurking and keeping tabs on us, let me have your full attention with this. </p>\n\n<p>Ryan is Vito Corleone and Mel is Don Ciccio. More on this later, but just in case you are clueless, here is a little <a href=\"https://youtu.be/gCdXiOssbM0\">preview.</a></p>\n\n<p>Since many people like to compare GME to BlockBuster, both BlockBuster and Toys R Us can be Antonio Andolini. I’ll include an important economic lesson later regarding all 3 companies. </p>\n\n<p>I want to start some #️⃣ #trends </p>\n\n<h1>1. #TheDogFather</h1>\n\n<p>I think it’s very fitting for our savior Lord Cohen. Yet still “clean” and catchy for mainstream media. He may be aware of us, but we want him to know that we support him and are looking forward to him. </p>\n\n<h1>2. #AnOfferHeCantRefuse</h1>\n\n<p>I think we all know this one...</p>\n\n<h1>3. #HireOptimusPrimo</h1>\n\n<p>GME didn’t take me seriously. I contacted HQ, the HR department specifically. I said I would like to get on board with GME and that I’m responsible for a massive spike in their memberships. The guy was dumbfounded of my request to look into Pro Membership numbers and said he would “email others to look into it and they may contact” me...then he suggested that I should still apply for positions at GME....when I said I want to be on board, I literally meant the board....but I’ll be willing to start off as a district manager or in marketing. </p>\n\n<p>Now it’s been a few days, and I know it’s right before New Years, but Sherman has yet to contact me. Then again, he doesn’t even have twitter, showing how old school he is. </p>\n\n<p>3) I will need your input for additional # \n——————————————————————————</p>\n\n<h1>Official Start of the Post</h1>\n\n<p>WSB is what GME is to the general public. Just like GME, most people don’t understand WSB and have a negative view on us. They hear rumors, see glimpses and glorified headlines and make their opinion on WSB. </p>\n\n<p>Are we perfect? Hell no. Are we saints? Absolutely not. Do we have some bad apples who are cringeworthy that even we at WSB despise? Absolutely! WSB isn’t for soft ❄️ and the faint of heart individuals who take things at face value. </p>\n\n<p>The truth is, just like GME, there is a lot of positives to us, but not everyone notices that and looks at both GME and WSB as pure evil. <strong>Many are betting against GME and WSB.</strong> Unfortunately for them, both are here to stay, and will become a greater presence as time goes on. </p>\n\n<p>Have you ever beat it up so good that months later  they contacted you back for a repeat? Well you haven’t, but your wife can attest to this experience.</p>\n\n<p><strong>“The axe forgets what the tree remembers.”</strong></p>\n\n<p>Before I lose you since this will be a lengthy post with lofty goals of charity and coordinated social media presence...</p>\n\n<p>GME 🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🚀🌕🌕🌕🌕🌕🌕📈📈📈📈📈📈📈</p>\n\n<p>This is an attempt to coordinate our efforts and become a more powerful force to be reckoned with. </p>\n\n<h2>Speaking of Force, even Physics validates GME🚀🚀🚀 🚀🚀🚀</h2>\n\n<p>You see there is an equation for Newton’s Law of Universal Gravitation. The law is that objects with greater masses have a greater (attraction) gravitational force. The attractive force is directly related to the mass of the objects, and inversely related to the distance between them. </p>\n\n<p>The more massive the objects, the greater the force. The greater the distance, the less of the force. Want proof? Have you ever seen any chicks on my 600 lb life who is single? They all have a partner. Have you seen the 1000 lb sisters? One of them is currently pregnant. That means that someone, possibly one of you, managed to get her pregnant. </p>\n\n<p>The law validates itself, the more massive you are, the more attractive you become. GME has been a massive target for shorts, it has been and will remain a huge attraction to shorts and bears. </p>\n\n<p>GME is so attractive, that Mel left GME for dead. They could’ve closed positions, they weren’t satisfied at $4. They want GME bankrupt. </p>\n\n<p>Don Ciccio was wise enough to order Vito to be killed when he was 9, but his foot soldiers weren’t the best. In fact, when Vito’s mom begged Don Ciccio to spare Vito who is ”dumb-witted and only 9 years old” after having killed her husband and her oldest son who has vowed revenge; Don Ciccio responded “when he becomes bigger, he will come for revenge and kill me.” </p>\n\n<p>So calling Mel Don Ciccio is an insult because Don Ciccio was wise to attempt to tie up loose ends, but the fate is the same. </p>\n\n<p>Back to Physics: The law and equation...</p>\n\n<p>The equation (for Earth) is:</p>\n\n<h1>F = GMeM / Re<sup>2</sup></h1>\n\n<h2>Can you believe this???</h2>\n\n<p>We all know what Re means...but if they are scattered and too far from each other, the force is not as great. This is why we have to recruit and bring all the scattered individuals to join the cause. The closer the distance of Re, the greater the force. </p>\n\n<p>With that said, not all forces are evil, and we will be benefiting many great causes. </p>\n\n<p>We are the leading sub in gifting awards, by a landslide, and that’s not even coordinated. Imagine if we did actually start to coordinate for our goals. </p>\n\n<p>FFS, <strong>we may have set the record of most awards given to a post</strong> for a post that said to buy shares instead of awards. </p>\n\n<p>People are aware of us....but they don’t take us seriously. They notice us, they lurk for their headlines and etc, but they don’t see the true power behind us. Every now and then, they may acknowledge or refer to us, but the reality is, it is always in a negative way. In fact, that’s ok. We don’t want to give the illusion that we do charities and donations to improve our “image.” We are not like the powerful and famous people who do things for PR purposes. We are just your regular individuals who have a more giving heart then the people who look down upon us. </p>\n\n<p>Many people here have individually donated to charities and towards great causes, for genuine reasons, and that is far more valuable than those who donate for pure PR. </p>\n\n<h2>Back to the tree and axe saying:</h2>\n\n<p>The tree is Mel, old, ancient, and deeply rooted in their beliefs. While trees are beneficial, this one is rotten and is experiencing heart rot. On top of this, there are many termites planning on feasting (smaller position shorts and bears.) We are not going to eradicate them, we are going to hit them twice. They’ll call the first one a fluke, contribute it to new console releases, and pure luck of WSB. </p>\n\n<p>But at some point, in order to realize gains, we will have to sell. Eventually time will pass, GME will be lower than its peak values because of the inevitable squeeze, and some unfortunate souls will be FOMOing at the top and be left bag holding. These bags will be so big and heavy that not even Southwest Airlines will let them fly for free. </p>\n\n<p>The likes of Mel, boomer analysts, and bears will rise again and claim that it is going back to the “5 year trend.” They’ll be setting themselves up for a 2nd round...But by this time</p>\n\n<h2>TheDogFather Cohen has taken over GME</h2>\n\n<p>and laid the foundations of successful business that will help GME transition and thrive. </p>\n\n<p>GME has consolidated and we’ve kept it above $19.\nBut no one is taking us seriously. There was an obvious attack that made the Uptick Rule go into effect this week, and many expected today to be the dip. We here at WSB don’t have  🧻 TP hands, but there are others who do. Those individuals are not aware of us and are easily manipulated. We should educate them, harden them up and have them join the cause.</p>\n\n<p>Just like how many of you and the public weren’t aware of the memberships, many people (outside of here) aren’t aware of the strategy. Or if they are, they may not understand what to do and what not to do...ie during uptick rule times and not using margins etc. </p>\n\n<p>We also want to quickly spread solid info. Some of you posted my post on stock twits and noticed other people talking about it. Thank you for that, we made a reach, but we need to make it bigger. </p>\n\n<p>This is where my new info and DD will come into play, and many others as well. </p>\n\n<p>The reality is, many people (consumers and “investors” are still having the stereotypical view of GME. These stereotypes are leading to a downfall and an uphill battle. </p>\n\n<p>Getting the word out and educating people is the best thing to do, not just for GME, but for all businesses. There is great lesson to learn from and there’s more to it than just “they didn’t transition with the times”</p>\n\n<p>There are valuable lessons to learn from BlockBuster and TRU, which I will get to. </p>\n\n<h2>At this point I have to take a break, will update soon with the rest of the post.</h2>\n\n<p>There will be more information about GME, benefits, and how things work as I edit this post and add it. </p>\n\n<h1>I’ll edit this post and update.</h1>\n\n<p>Why am I posting something incomplete?</p>\n\n<p>1) I’m a human, I have to take care of somethings and come back and finish</p>\n\n<p>2) You’re a human and you need the break. </p>\n\n<p>3) Gather interest in this post as reaching the hot posts takes time...unless you’re the guy who posted about not spending money on awards. I’ve never laughed harder from a title alone (and seeing the bukkake of awards on that post). </p>\n\n<h1>You can redeem 5k points for an additional $5 certificate or donate to the current charities GME is affiliated with.</h1>\n\n<p>We can also come up with our indirect donation / charity. One of my ideas was is that we can organize a program with hospitals. </p>\n\n<p>We can buy memberships under fake names or possibly </p>\n\n<h1>Ryan Chewy</h1>\n\n<p>The Ryan Chewy name will serve a 2 fold purpose. Besides in the name of TheDogFather, it’ll serve as a warning signal to Sherman as what is to come and that he better not start taking credit for more “memberships and retention.”</p>\n\n<p>And use the phone number of a local children’s hospital. This bit of info can be shared with that hospital, and they can use the certificates to purchase little toys etc. Obviously the hospital would need to use their own funds to cover the remaining balance, but perhaps they already have such budget, or maybe they can set up and we can donate here and there. </p>\n\n<p>At the very least, they can get a physical copy of the magazine (assuming you signed up for $20)...but since it’s COVID, the magazine can’t really be shared...so maybe digital is better.</p>\n\n<p>These are just random ideas, if we combine all of our low IQs, we can come up with some good benefit drive ideas etc.</p>\n\n<h1>TL;DR ( so far)</h1>\n\n<p>Post is not finished (yikes)</p>\n\n<p>Your welcome certificate may be available now , tomorrow you should receive your 1st monthly certificate. </p>\n\n<p>You may have 2 certificates tomorrow for $10 to make it rain at GME.</p>\n\n<p>You can donate your rewards points to foundations.\nIf you have change / coins, take them to GME.</p>\n\n<p>GME now has credit card, flex pay, and layaway plans available. </p>\n\n<p>Read right above the TL;DR for my ideas of donations, brainstorm and let’s get some good ideas rolling. </p>\n\n<p>Educate people and 🚀🚀🚀🚀🚀🚀</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/lLmy5sHOYaKFjLVKf85uEsCX7MdsXfE3xF3Rkk__YXQ.jpg?auto=webp&s=43261088df0b17bd4be96ed32c6db7fea88a77de", "width": 480, "height": 360}, "resolutions": [{"url": "https://external-preview.redd.it/lLmy5sHOYaKFjLVKf85uEsCX7MdsXfE3xF3Rkk__YXQ.jpg?width=108&crop=smart&auto=webp&s=a7ab501f7f8735e990d247958d9ce43348f8fd07", "width": 108, "height": 81}, {"url": "https://external-preview.redd.it/lLmy5sHOYaKFjLVKf85uEsCX7MdsXfE3xF3Rkk__YXQ.jpg?width=216&crop=smart&auto=webp&s=51cc72cbcda0f2a4dacb742173b8f82c27b5069e", "width": 216, "height": 162}, {"url": "https://external-preview.redd.it/lLmy5sHOYaKFjLVKf85uEsCX7MdsXfE3xF3Rkk__YXQ.jpg?width=320&crop=smart&auto=webp&s=c5aedb73025cf03993d27e9e3aafecd4713a7cd2", "width": 320, "height": 240}], "variants": {}, "id": "ilt4V12C5yP6He77O99cCO7XCICuvk_qcYuIHwRdmxg"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "knxf4f", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0ptimusPrim0", "fullname": "t2_nkled"}, "discussion_type": null, "num_comments": 9, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/", "subreddit_subscribers": 1756650, "created_utc": 1609446492.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_knxf4f", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "ghn16sa", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_knxf4f", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**I am a bot. Is this submission violating the [content guide](https://www.reddit.com/r/wallstreetbets/wiki/contentguide)? Vote below.**\n\n| **Remove It** | **Keep It** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=knxf4f&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=knxf4f&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=knxf4f)\n___\n ^comment ^will ^disappear ^--- ^30 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>I am a bot. Is this submission violating the <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">content guide</a>? Vote below.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It</strong></th>\n<th align=\"left\"><strong>Keep It</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=knxf4f&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=knxf4f&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=knxf4f\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>30</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/ghn16sa/", "num_reports": null, "locked": false, "name": "t1_ghn16sa", "created": 1609475802.0, "author_flair_text": ":zjz_flair: Robot Janitor", "treatment_tags": [], "created_utc": 1609447002.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_knxf4f", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghn2bki", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Mediocre-Age-5346", "fullname": "t2_85bwajwj"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_knxf4f", "score": 7, "author_fullname": "t2_85bwajwj", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Some of these GME DD’s are really reaching. People are gonna actually start  thinking we’re retarded.\n\nPositions: ALL IN GME SHARES 🚀🚀🚀🚀🚀🚀🚀", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Some of these GME DD’s are really reaching. People are gonna actually start  thinking we’re retarded.</p>\n\n<p>Positions: ALL IN GME SHARES 🚀🚀🚀🚀🚀🚀🚀</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/ghn2bki/", "num_reports": null, "locked": false, "name": "t1_ghn2bki", "created": 1609476423.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609447623.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_knxf4f", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghn3bgv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0ptimusPrim0", "fullname": "t2_nkled"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ghn2bki", "score": 1, "author_fullname": "t2_nkled", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "At this point we’ve exhausted most of what there is. \n\nThe remaining way to DD is to build rapport with your local store. I tried DDing earlier in the week in their subs, but I got banned...LMAO.", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>At this point we’ve exhausted most of what there is. </p>\n\n<p>The remaining way to DD is to build rapport with your local store. I tried DDing earlier in the week in their subs, but I got banned...LMAO.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/ghn3bgv/", "num_reports": null, "locked": false, "name": "t1_ghn3bgv", "created": 1609476968.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609448168.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_knxf4f", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghn0fb9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "whisky", "fullname": "t2_3jplq"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_knxf4f", "score": 7, "author_fullname": "t2_3jplq", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "🚀🚀🚀🚀🚀🚀 Rocket is ready. January 15th is the first catalyst. >$30 Jan 16th.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>🚀🚀🚀🚀🚀🚀 Rocket is ready. January 15th is the first catalyst. &gt;$30 Jan 16th.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/knxf4f/gme_dd_pt2_coordinated_charity_for_autism_and/ghn0fb9/", "num_reports": null, "locked": false, "name": "t1_ghn0fb9", "created": 1609475383.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609446583.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}