{"approved_at_utc": null, "selftext": "**Stocks finish at all-time highs as Tesla passes Facebook in market value. Lemonade rises by more than 20% again while reports continue to come in on the Apple Car. Let’s talk about this and other stock market news**\n\n**\\~Very Long Post\\~**\n\nHello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a big rally in the stock market after the [Biden](https://ibb.co/QpPkkvg) confirmation and Trump called for a smooth transition with the tech heavy [Nasdaq Composite](https://ibb.co/sw8bKdb) recovering the previous day losses and closing at over 13K. We also saw the broad stock market [SP500](https://ibb.co/MnjT8BH) gaining almost 1.5% and finishing over 3800 while the [Dow Jones](https://ibb.co/ykPckZD) also posted a gain of over 200 points to close at just over 31k with all 3 of the big indexes finishing at new records. This broad rally pushed the [VIX](https://ibb.co/5MY0P1w) down, as the volatility index finished the day lower by more than 10% as 9 of the 11 [SECTORS](https://ibb.co/nmc7x8X) finished in the Green with Technology leading the way up 2.7%, while Utilities was the biggest laggard dropping by 1.3%.\n\nGrowth companies largely outperformed [yesterday](https://ibb.co/XpHGdhb) with both small and large cap growth companies posting big gains across the board, while value plays lagged behind, as 2/3 of the companies were advancing [YESTERDAY](https://ibb.co/NLLMyLY) with over 300 new highs on average volume.\n\nSo, let’ take a look at the [HEAT MAP](https://ibb.co/ys6zg6M) from yesterday, as big tech companies flourished with the likes of Apple, Google, Microsoft, Facebook, Nvidia, Tesla and many more posting gains at least 2%, while most of the losses were concentrated in the Chinese stocks that are being delisted and the more value heavy utilities sector.\n\nYesterday we also received the investor sentiment [SURVEY](https://ibb.co/10gRPgn), which saw a worrying move in the stock market, as bullish investors surpassed 50% of the total investors and is near the 1-year high from November. Most of this move to the bullish side came from neutral investors, which are way below the historical [average](https://ibb.co/XbyKxjB), which probably decided to get back in the market, rushing in the clean energy sector, the industrials and many others after the Democrats swept the Georgia election. I remind you that I usually use this survey as a contrarian indicator, when sentiment moves to this much greed in the market, I usually don’t like to add to my positions, as I await to buy stocks on red days.\n\nWe also received some economic data yesterday, as we saw December’s homes for [SALE](https://ibb.co/7Y3njz3) fall to an all-time low, below 700K as the housing market keeps on booming, with homes selling faster by about 2 weeks compared to last year while the national inventory dropped by almost 40% since last year, as the median listing price was $340K, up over 13% since 2019.\n\n[Today](https://ibb.co/t4bS0wH) is a quieter economic day, with the biggest number coming in the early morning as we wait to see the non-farm payrolls.\n\nIn some other stock market news, we saw [Nikola](https://ibb.co/DLP8f1P) joining the broad rally in the EV [STOCKS](https://ibb.co/mJgVqwr) yesterday which pushed almost every single stock higher, while we also saw a report from JP Morgan on some possible good developments on their trucks. I don’t believe in this company, it’s bad history, bad management and reputation will hurt it in the long even if they manage to develop a decent product, which is still to be seen, as they haven’t really brought anything innovative to the market.\n\nOne other stock that rose yesterday was [Lemonade](https://ibb.co/FbZZ5Lz), as the stock spiked more than 27% yesterday, after the company was pitched by the Motley Fool yet again. I really like this company, and I think it has major disruption potential in the insurance world, so I agree with this report. The stock did suffer a slight pullback about a week ago after a report from The Friendly Bear but I don’t believe it will have a long-lasting effect, as I believe this stock has great growth potential.\n\n[Apple](https://ibb.co/Xzscpk6) also seems to be confirming the previous reports and is in talks with Hyundai about a development of a self-driving EV, as we heard something about this from Hyundai before some confusion made them kind of back out of the previous statement. This report is pretty much as anticipated, as Apple would probably be looking to either collaborate on manufacturing with a traditional car manufacturer or actually just acquiring pretty much any one of them.\n\nWe also saw [Snowflake](https://ibb.co/vZ1v7yw) regain some momentum yesterday, rising by more than 13% despite the expiration period of another 38M shares. The latest IPOs and small-cap stocks have recently been able to raise a lot of capital as investors seem to be grabbing any share available at almost any price regarding valuations. This is a very dangerous thing yet again. This kind of stuff was happening in the last dot com bubble, though… I don’t really expect anything like that to happen with the overall stock market, but I think we might see some stocks have a big crash when valuations start to come back in the mind of investors.\n\nMeanwhile we saw 2 big milestones for Tesla & Elon Musk yesterday as the company [passed](https://ibb.co/yXnFsbp) Facebook as market value goes as Tesla is seeing huge trading volumes as yesterday, it [traded](https://ibb.co/6BYkLP9) more shares than the next 3 big movers Apple, Alibaba and Amazon, while Elon Musk [became](https://ibb.co/xS0G5Sk) the richest man in the world, on the back of a 16% increase in Tesla stock already in 2021.\n\nAnd two last pieces of good news are that the it’s expected the [FED](https://ibb.co/6FTNrSF) will likely hold rates near zero until 2024 while [Pfizer's](https://ibb.co/6nGSdWR) vaccine seems to be working as expected on multiple mutations, especially the latest highly transmissible one.\n\nSo, let’s hope for a good day as the European [markets](https://ibb.co/LdhPq9P) and the US [FUTURES](https://ibb.co/wSTgstr) are up to start off the day, with the Nasdaq Leading the way up over half a percent.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Stock Market News for Today | TSLA vs FB | LMND SPIKES | APPLE CAR & other stock market news [01-08]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kt2a38", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.87, "author_flair_background_color": null, "subreddit_type": "public", "ups": 22, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 22, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1610140719.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Stocks finish at all-time highs as Tesla passes Facebook in market value. Lemonade rises by more than 20% again while reports continue to come in on the Apple Car. Let’s talk about this and other stock market news</strong></p>\n\n<p><strong>~Very Long Post~</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of yesterday as we saw a big rally in the stock market after the <a href=\"https://ibb.co/QpPkkvg\">Biden</a> confirmation and Trump called for a smooth transition with the tech heavy <a href=\"https://ibb.co/sw8bKdb\">Nasdaq Composite</a> recovering the previous day losses and closing at over 13K. We also saw the broad stock market <a href=\"https://ibb.co/MnjT8BH\">SP500</a> gaining almost 1.5% and finishing over 3800 while the <a href=\"https://ibb.co/ykPckZD\">Dow Jones</a> also posted a gain of over 200 points to close at just over 31k with all 3 of the big indexes finishing at new records. This broad rally pushed the <a href=\"https://ibb.co/5MY0P1w\">VIX</a> down, as the volatility index finished the day lower by more than 10% as 9 of the 11 <a href=\"https://ibb.co/nmc7x8X\">SECTORS</a> finished in the Green with Technology leading the way up 2.7%, while Utilities was the biggest laggard dropping by 1.3%.</p>\n\n<p>Growth companies largely outperformed <a href=\"https://ibb.co/XpHGdhb\">yesterday</a> with both small and large cap growth companies posting big gains across the board, while value plays lagged behind, as 2/3 of the companies were advancing <a href=\"https://ibb.co/NLLMyLY\">YESTERDAY</a> with over 300 new highs on average volume.</p>\n\n<p>So, let’ take a look at the <a href=\"https://ibb.co/ys6zg6M\">HEAT MAP</a> from yesterday, as big tech companies flourished with the likes of Apple, Google, Microsoft, Facebook, Nvidia, Tesla and many more posting gains at least 2%, while most of the losses were concentrated in the Chinese stocks that are being delisted and the more value heavy utilities sector.</p>\n\n<p>Yesterday we also received the investor sentiment <a href=\"https://ibb.co/10gRPgn\">SURVEY</a>, which saw a worrying move in the stock market, as bullish investors surpassed 50% of the total investors and is near the 1-year high from November. Most of this move to the bullish side came from neutral investors, which are way below the historical <a href=\"https://ibb.co/XbyKxjB\">average</a>, which probably decided to get back in the market, rushing in the clean energy sector, the industrials and many others after the Democrats swept the Georgia election. I remind you that I usually use this survey as a contrarian indicator, when sentiment moves to this much greed in the market, I usually don’t like to add to my positions, as I await to buy stocks on red days.</p>\n\n<p>We also received some economic data yesterday, as we saw December’s homes for <a href=\"https://ibb.co/7Y3njz3\">SALE</a> fall to an all-time low, below 700K as the housing market keeps on booming, with homes selling faster by about 2 weeks compared to last year while the national inventory dropped by almost 40% since last year, as the median listing price was $340K, up over 13% since 2019.</p>\n\n<p><a href=\"https://ibb.co/t4bS0wH\">Today</a> is a quieter economic day, with the biggest number coming in the early morning as we wait to see the non-farm payrolls.</p>\n\n<p>In some other stock market news, we saw <a href=\"https://ibb.co/DLP8f1P\">Nikola</a> joining the broad rally in the EV <a href=\"https://ibb.co/mJgVqwr\">STOCKS</a> yesterday which pushed almost every single stock higher, while we also saw a report from JP Morgan on some possible good developments on their trucks. I don’t believe in this company, it’s bad history, bad management and reputation will hurt it in the long even if they manage to develop a decent product, which is still to be seen, as they haven’t really brought anything innovative to the market.</p>\n\n<p>One other stock that rose yesterday was <a href=\"https://ibb.co/FbZZ5Lz\">Lemonade</a>, as the stock spiked more than 27% yesterday, after the company was pitched by the Motley Fool yet again. I really like this company, and I think it has major disruption potential in the insurance world, so I agree with this report. The stock did suffer a slight pullback about a week ago after a report from The Friendly Bear but I don’t believe it will have a long-lasting effect, as I believe this stock has great growth potential.</p>\n\n<p><a href=\"https://ibb.co/Xzscpk6\">Apple</a> also seems to be confirming the previous reports and is in talks with Hyundai about a development of a self-driving EV, as we heard something about this from Hyundai before some confusion made them kind of back out of the previous statement. This report is pretty much as anticipated, as Apple would probably be looking to either collaborate on manufacturing with a traditional car manufacturer or actually just acquiring pretty much any one of them.</p>\n\n<p>We also saw <a href=\"https://ibb.co/vZ1v7yw\">Snowflake</a> regain some momentum yesterday, rising by more than 13% despite the expiration period of another 38M shares. The latest IPOs and small-cap stocks have recently been able to raise a lot of capital as investors seem to be grabbing any share available at almost any price regarding valuations. This is a very dangerous thing yet again. This kind of stuff was happening in the last dot com bubble, though… I don’t really expect anything like that to happen with the overall stock market, but I think we might see some stocks have a big crash when valuations start to come back in the mind of investors.</p>\n\n<p>Meanwhile we saw 2 big milestones for Tesla &amp; Elon Musk yesterday as the company <a href=\"https://ibb.co/yXnFsbp\">passed</a> Facebook as market value goes as Tesla is seeing huge trading volumes as yesterday, it <a href=\"https://ibb.co/6BYkLP9\">traded</a> more shares than the next 3 big movers Apple, Alibaba and Amazon, while Elon Musk <a href=\"https://ibb.co/xS0G5Sk\">became</a> the richest man in the world, on the back of a 16% increase in Tesla stock already in 2021.</p>\n\n<p>And two last pieces of good news are that the it’s expected the <a href=\"https://ibb.co/6FTNrSF\">FED</a> will likely hold rates near zero until 2024 while <a href=\"https://ibb.co/6nGSdWR\">Pfizer&#39;s</a> vaccine seems to be working as expected on multiple mutations, especially the latest highly transmissible one.</p>\n\n<p>So, let’s hope for a good day as the European <a href=\"https://ibb.co/LdhPq9P\">markets</a> and the US <a href=\"https://ibb.co/wSTgstr\">FUTURES</a> are up to start off the day, with the Nasdaq Leading the way up over half a percent.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/b-VBpgRM-wotp2lK8QDYHBx22FcRUTSe-mYShR56a_o.jpg?auto=webp&s=a24e0ae7896dbc627c54ccb35ca34445108057c1", "width": 762, "height": 242}, "resolutions": [{"url": "https://external-preview.redd.it/b-VBpgRM-wotp2lK8QDYHBx22FcRUTSe-mYShR56a_o.jpg?width=108&crop=smart&auto=webp&s=dda8e8b7d0fb4b90435a9a7098a4b91aa161155c", "width": 108, "height": 34}, {"url": "https://external-preview.redd.it/b-VBpgRM-wotp2lK8QDYHBx22FcRUTSe-mYShR56a_o.jpg?width=216&crop=smart&auto=webp&s=4a977c21d388c48b7e0ba07e844586ee44975e86", "width": 216, "height": 68}, {"url": "https://external-preview.redd.it/b-VBpgRM-wotp2lK8QDYHBx22FcRUTSe-mYShR56a_o.jpg?width=320&crop=smart&auto=webp&s=d501aa7dbf166df9757a280e5d6a80dd365fc5ae", "width": 320, "height": 101}, {"url": "https://external-preview.redd.it/b-VBpgRM-wotp2lK8QDYHBx22FcRUTSe-mYShR56a_o.jpg?width=640&crop=smart&auto=webp&s=43b7e23f8de098a74da661751ab84823705b0682", "width": 640, "height": 203}], "variants": {}, "id": "bg14X9GBRHFd3m-f-voWtbONV1ikIpMRh9fJGgjiLz0"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kt2a38", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 12, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/", "subreddit_subscribers": 1786197, "created_utc": 1610111919.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 9, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijdqzt", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kt2a38", "score": 9, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**\\~Tl;dr\\~ Buy AAPL, TSLA, LMND  | SELL NKLA**", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>~Tl;dr~ Buy AAPL, TSLA, LMND  | SELL NKLA</strong></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijdqzt/", "num_reports": null, "locked": false, "name": "t1_gijdqzt", "created": 1610140904.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610112104.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijfxp8", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "seeker12789", "fullname": "t2_q4b32"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gijdqzt", "score": 3, "author_fullname": "t2_q4b32", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "To clarify, why buy LMND?", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>To clarify, why buy LMND?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijfxp8/", "num_reports": null, "locked": false, "name": "t1_gijfxp8", "created": 1610142300.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610113500.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijg175", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "created_utc": 1610113559.0, "send_replies": true, "parent_id": "t1_gijfxp8", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Long-term growth potential basically", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Long-term growth potential basically</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijg175/", "num_reports": null, "locked": false, "name": "t1_gijg175", "created": 1610142359.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijggul", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "seeker12789", "fullname": "t2_q4b32"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gijg175", "score": 3, "author_fullname": "t2_q4b32", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Gotcha.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Gotcha.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijggul/", "num_reports": null, "locked": false, "name": "t1_gijggul", "created": 1610142627.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610113827.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 3, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijecg3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "JBarz95", "fullname": "t2_6b3ouxzt"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kt2a38", "score": 4, "author_fullname": "t2_6b3ouxzt", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Happy 69th day on Reddit!", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Happy 69th day on Reddit!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijecg3/", "num_reports": null, "locked": false, "name": "t1_gijecg3", "created": 1610141296.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610112496.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijefol", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gijecg3", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Lol:)) Thanx", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Lol:)) Thanx</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijefol/", "num_reports": null, "locked": false, "name": "t1_gijefol", "created": 1610141352.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610112552.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gije10d", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Jannse", "fullname": "t2_vldfj"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kt2a38", "score": 3, "author_fullname": "t2_vldfj", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Bro, thanks and have a great day yourself!", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Bro, thanks and have a great day yourself!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gije10d/", "num_reports": null, "locked": false, "name": "t1_gije10d", "created": 1610141089.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610112289.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kt2a38", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gijeenc", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gije10d", "score": 2, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Appreciate it!", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Appreciate it!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kt2a38/stock_market_news_for_today_tsla_vs_fb_lmnd/gijeenc/", "num_reports": null, "locked": false, "name": "t1_gijeenc", "created": 1610141334.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1610112534.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}