{"approved_at_utc": null, "selftext": "Paypal was an early COVID investing pick due to its nature of contactless payments and its rise in young populations with Venmo. Paypal has a storied history, founded by some of the most influential Silicon Valley VC’s and entrepreneurs they started as two smaller companies founded in the middle of the tech bubble (1998 and 1999) as Confinity and X.com by Peter Thiel and Elon Musk. They were able to weather the storm of the 2000 tech fallout by being bought out by eBay for $1.5B beforehand. Under eBay, Paypal grew their services into what most of us know them for: digitized payments. Starting from effortless check transfers for unauthorized vendors to working their way to B(!)tcoin, Paypal has made it more convenient for payments to be processed, and in our consumerist economy that’s an absolute goldmine. Square is a relatively new player in the digital transaction space but they’ve had quite a run up this year under the leadership of Jack Dorsey, founder of Twitter. Their first product was a card reader that fit into the headphone jack of smartphones, so naturally Square expanded into the enterprise services market and continued developing solutions for small businesses like payroll management. I’ll further discuss the respective structures of both companies in this due diligence\n\n**The Expansion of Digital Transactions**\n\nPaper currency has been the standard means of exchange for ages, but the digital method of exchange, particularly mobile exchanges has now become far more convenient. In 2017, digital payments were expected to reach a market value of [$726B](https://www.cnbc.com/2017/10/09/digital-payments-expected-to-hit-726-billion-by-2020-study-finds.html) in 2020, and here we are post covid with the value of digital payments at over 910B.\n\n&#x200B;\n\nhttps://preview.redd.it/mr9elex5z0561.png?width=800&format=png&auto=webp&s=18e6eb1b9039d738af6c2ea5277018d2749cbbfd\n\nStatista forecasts that most of the sales growth for digitized payments past 2020 will come from mobile POS, and that most of the user growth for digitized payments will also be in peer-to-peer transactions. Paypal has both bases covered with Venmo when it comes to mobile transactions and it has E-Commerce covered with its major retailer partnerships and with eBay. Square has Cash app, which is a peer-to-peer payments app plus they also have in-person small business products for digital payments like their “cash register” called the Square Stand which is useful for freelancing professionals and small businesses.\n\nSo a pro of Square is that it has a far more established presence in the growing sector of digital payments which is mobile POS payments, not E-Commerce. However, E-Commerce is the much larger sector by users alone:\n\n&#x200B;\n\nhttps://preview.redd.it/x99o8v39z0561.png?width=800&format=png&auto=webp&s=c12fa73d91b1948acec47fe715cdefe8b4bfb3bb\n\n### As you can see, mobile POS payments are expected to triple in the same time that E-commerce will grow by around 20%.\n\nThis makes a lot of sense to me as E-Commerce still makes up a small amount of all transactions and its trajectory is very much fixed and established now. POS payments are definitely growing though, as on my last trip to India, one of the fastest growing countries, I observed that every small business had a PayTM barcode for transactions, and this is where both Paypal and especially Square will eventually expand to. CNBC also forecasts most digital payment growth will happen in emerging markets (which is why I’ll suggest an ETF at the end which incorporates emerging market companies) “Emerging markets are expected to grow at a rate three times that of developed economies in terms of digital transaction volumes. Digital payments in developing markets grew 21.6 percent between 2014 and 2015, compared to a 6.8 percent rise in mature markets. Non-cash payments in Asian emerging markets are projected to grow by almost a third (30.9 percent), led by powerhouses China and India”. According to CNBC analysts though, cash will still remain supreme for the following reasons: speed of exchange, universal acceptance, anonymity, absence of record and free of charge. Anonymity and absence of record are things that are being fixed by the incorporation of cr(!)ptocurrency into transactions, but it’s likely the biggest reason people don’t switch to cashless is because not all merchants use it and the fees add up especially for many transactions a day for the *merchants*. Eventually when the digital transaction economy grows fully, there will be enough competitors to offer sellers competitive rates to a point where they’ll choose mobile payments for the convenience it provides in terms of not having to use physical cash but as of now only small businesses are willing to make the opportunity cost of losing fees so they don’t have to store cash.\n\n***Paypal***\n\nPaypal is “a global, two-sided network at scale that connects merchants and consumers with 305 million active accounts (consisting of 281 million consumer active accounts and 24 million merchant active accounts) across more than 200 markets. PayPal helps merchants and consumers connect, transact, and complete payments, whether they are online, on a mobile device, in an app, or in person”. They have a variety of new products in development as they have made several acquisitions since their establishment. Paypal offers merchants a technology-agnostic platform that requires no hardware and little time to set up with its Braintree product which is primarily for online sellers and iZettle which is used for POS payments primarily in international markets and they have a user base of 19 million. This acquisition was made with the full intention of competing with Square and since Paypal has had an extremely talented eye for acquisitions in the past in Xoom and Venmo, this [relatively new acquisition](https://www.forbes.com/sites/greatspeculations/2018/06/07/why-did-paypal-pay-such-a-high-price-for-izettle/?sh=60f035216860) has a lot of potential, but it could also just be a last minute scramble to catch up to Square’s huge market share in POS payment offerings. Paypal has a great P2P ecosystem in Venmo and Xoom and a credit partnership with Synchrony bank as well which helps diversify revenue streams. Paypal also owns a company called GoPay, which basically provides the same services Paypal does but in China, which expands them into a market that’s more likely to grow in the future.\n\n&#x200B;\n\nhttps://preview.redd.it/w3vmknzbz0561.png?width=800&format=png&auto=webp&s=23c083f35611ffa86a997cf3a9f75a7c29de7a9f\n\nAs you can see, Paypal has some pretty consistent revenue, profit, and EBITDA growth, but a bit more concerning may be the fact that margins have been relatively stable and they haven’t been increasing at all. I believe the reason for this is because PayPal’s full potential isn’t close to being realized, and even founder Peter Thiel said in his book “Zero to One” that Paypal wouldn’t start realizing a majority of their cash flows until 2020.\n\n&#x200B;\n\nhttps://preview.redd.it/78wifzfdz0561.png?width=800&format=png&auto=webp&s=9bce649ad199031a1c5ddbfbdb663324b7ae3454\n\n&#x200B;\n\n While Paypal was able to increase earnings per share by a strong 21% from 2018 to 2019, they decreased cash flows from operating activities by 17% from 2018. This requires that we go into the capital expenditures in their CF statement, which will provide a clearer idea of why and how Paypal lost cash flow despite rising net income. Another thing standing out may be the fact that the operating margin is pretty constant, which can be a concerning sign for investors seeking a growth stock. Plus, considering how much the price for PYPL has run up in the past few months you’d expect better profitability to come with it hand-in-hand. But the future being factored into Paypal isn’t based on its face value, or else the price would be very stagnant right now and it wouldn’t have grown nearly as much as it has.\n\nHere’s what I mean:\n\n&#x200B;\n\nhttps://preview.redd.it/47r8msvez0561.png?width=800&format=png&auto=webp&s=2cefbcab0e52e1a1ca9e42b946f569f4a1595785\n\nThe amount of profit Paypal can squeeze out of its main product is pretty much at a maximum as transaction expenses are growing at the same rate as revenues are and operating expenses are still going up at a somewhat proportional rate to that of net income, meaning that no more value is going to come out of the existing product. While the existing product is still going to grow in popularity, its profitability is only going to decrease or stagnate as Paypal expands into developing markets that aren’t willing to cough up as much in fees. As Thiel himself puts it, that’s “horizontal innovation” AKA just globalism. That alone isn’t enough to justify the investment levels in Paypal, but investments and acquisitions into the future of transactions will expand it, and on top of this it is only recently Paypal has experienced such tremendous growth in cash flows YoY.\n\nNow you’ll see below PYPL’s historic cash flows, and if you go to the bottom you’ll see their free cash flow decreased from 2018 to 2019 as I previously mentioned. The root cause of this is investment purchases, which increased by $5B in 2019 and contributed to the Free Cash Flow decreasing by 800M. Again, if we look at Paypal’s track record when it comes to acquisitions they’ve been very successful, so there’s not much reason to expect much different this time around. If Paypal’s investing, investors are excited. They’ve piled up cash up until last year, and they’re finally using it now based off their cash per share:\n\n&#x200B;\n\nhttps://preview.redd.it/rq6x4g8kz0561.png?width=387&format=png&auto=webp&s=976d294dbc9ceb68d288570648b9a894fde8c1ac\n\n&#x200B;\n\nhttps://preview.redd.it/jh21m90lz0561.png?width=800&format=png&auto=webp&s=b77b71f08785127aea6cad5afa30e6ff37f78f11\n\n&#x200B;\n\nhttps://preview.redd.it/z2kkuyilz0561.png?width=800&format=png&auto=webp&s=3dc69e6a4ecd333adf5c3e9fa851a266473fe4ec\n\nAdd to this the tremendous increase in digital payment volume in the past year and we can expect a real change in the entire sector’s trajectory. Hedge funds have been piling up on this supposed legacy company for a valid reason: their time for expansion is ***now, and COVID-19 has only spurred in realizing this perfect storm, as net income and revenue has seen a jump in the past two quarters:***\n\n&#x200B;\n\nhttps://preview.redd.it/v4cgyl1nz0561.png?width=800&format=png&auto=webp&s=272965de645fa1a9aac0ff763863cc28e7942035\n\nSo you must be wondering why Paypal’s cash from operations was down in 2019 from 2018, but in their most recent 10k Paypal explained cash from operations and free cash flow was only down due to “positive impact of $1.4 billion of changes in loans and interest receivable, held for sale, net following the sale of our U.S. consumer credit receivables portfolio” which was added into the operating income as it was a noncash expense and that’s why 2019 looks down about $1B in cash even though operating income for 2019 was up $0.4B:\n\n&#x200B;\n\nhttps://preview.redd.it/7i979ldoz0561.png?width=800&format=png&auto=webp&s=798113837df594aa112574facc98df32685c8c79\n\nPaypal’s newly acquired capital is already being used and it’ll be put to good use based on the meteoric rise in transactions in the past two years. Contactless payments will eventually become a norm and their established e-commerce platform will set them up pretty well on this end.\n\nNow to address the flip side of the coin: POS or Point of Sale transactions, which is a market Square has wrapped around its finger as it’s had the head start since the iPhone 4. Here’s how Square got started, instead of giving 10$ to people for using their product, founder and CEO Jack Dorsey (who also is the founder and CEO of Twitter) gave them the product for free and built an infrastructure around it. It was simply a credit card scanner that could be inserted into the headphone jack of a smartphone. This simple product is still being sent out for free to small businesses and the software and business model that surrounded this tiny card reader has expanded like a wildfire since then. Square would collect 2.75% on each payment similar to Paypal.\n\nSquare also made a “cash management” app, Cash App to dive into a non-retail market.\n\nAbout Cash App: “Cash App provides an ecosystem of financial products and services to help individuals manage their money. While Cash App started with the single ability to send and receive money, it now provides an ecosystem of financial services that allows individuals to store, send, receive, spend, and invest their money.”\n\nIt appears as if Square is trying to become an all-round player in the consumer and producer financial ecosystem as Cash App has become more like a bank or brokerage account rather than just a P2P service like Paypal or Zelle. Now, Cash App makes 25% of SQ’s revenues.\n\nIn Square’s 2019 annual report, they reported the following:\n\nIn the year ended December 31, 2019, we processed $106.2 billion of Gross Payment Volume (GPV), which was generated by nearly 2.3 billion card payments from 407 million payment cards. At the end of 2019, our Square point of sale ecosystem had over 180 million buyer profiles and approximately 230 million items were listed on Square by sellers.\n\nAs of December 2019, Cash App had approximately 24 million monthly active customers who had at least one cash inflow or outflow during a given month.\n\n&#x200B;\n\n[The above image shows Square’s payment volume distribution across different industries, and as you can see in 2019 payment volume was very diverse which bodes well for SQ’s stability.](https://preview.redd.it/rjjzniarz0561.png?width=371&format=png&auto=webp&s=efe83afdb1c1d8adc38f4c37325fde9c1b125f93)\n\n&#x200B;\n\n[This shows the increasing size of sellers who use Square, and this shows that Square’s mission of making small businesses big and having them stick to their product regardless of their stage in growth is working.](https://preview.redd.it/cj0vx6gsz0561.png?width=800&format=png&auto=webp&s=d7f72e7dad5f7cbe846c489a90be6fa8d81067dd)\n\nAlthough their main business is in processing payments, Square is making itself a fin-tech institutional force with 30 different API’s for retail and e-commerce sellers along with invoicing, appointment, payroll, loyalty/gift card, and account management services. Square also has financing for small businesses in Square Capital, which I find to be the most interesting part of their model. They give small loans to businesses based on the data that they ***already have as Square manages the business’ finances, remember? And this puts them at an advantage to make good debt because of the transparency into the business’ finances. This will allow Square to make extremely profitable and high turnover loans that have virtually NO risk of default***. The types of loans they give are generally small, and they could be as little as $500. They describe these loans as the type you’d ask for from your parents or relatives. Square has such in-depth data from these businesses that when they make loans they don’t even *consider* credit scores: “Generally, for loans to Square sellers, loan repayment occurs automatically through a fixed percentage of every card transaction a seller takes. Loans are sized to be less than 20% of a seller’s expected annual GPV (their payment volume) and, by simply running their business, sellers repay their loan in eight to nine months on average”\n\nSince 2014, Square has made over $6B in loans with a failure rate of only 4%, which makes sense because Square has access to all of its client’s financials so therefore they possess the ability to make fully transparent loans.\n\nWhen you jump into Square’s financials, there’s a lot of promise to say the least:\n\n&#x200B;\n\nhttps://preview.redd.it/a4zkobuvz0561.png?width=800&format=png&auto=webp&s=35c1273cb128c0d627add76e54bb36a9b34941a1\n\nNot only has revenue grown by 42% from 2018 to 2019, net income finally became positive in 2019 and free cash flow increased from 232m to 400m in the same span.\n\nHere’s the revenue breakdown for Square, and as you can observe while transaction revenue saw much stronger compared to Paypal, the real deal was Square’s expansion of its enterprise solutions as those revenues increased by 74% last year, these are revenues recognized as the following: “Revenue from Cash App, Square Capital, and Instant Transfers for sellers currently comprise the majority of our subscription and services-based revenue. Cash App subscription and services-based revenue is primarily comprised of transaction fees from Cash App Instant Deposit and Cash Card. Our other subscription and services-based products include website hosting and domain name registration services, Gift Cards, Square Appointments, Customer Engagement, Employee Management, Payroll, Square Card, and other product offerings.”\n\nB(!)tcoin revenues from Cash App investing whose revenues increased by 210% (in this case B(!)tcoin is an asset that Square owns and sells to those using Cash App to invest in cr(!)ptocurrency.)\n\n&#x200B;\n\nhttps://preview.redd.it/6krvne7101561.png?width=800&format=png&auto=webp&s=87bb78977eaa222762e5f24f5061651850ad74e5\n\nAlso in that same span, Square’s cash has nearly doubled. This liquidity will be necessary as Square Capital continues to grow and will require financing.\n\n&#x200B;\n\nhttps://preview.redd.it/0b3gxlr201561.png?width=800&format=png&auto=webp&s=068b3f2d994b04f67fd2ad5c6de629851dd658ae\n\nObserving some long term trends now for $SQ:\n\n&#x200B;\n\n[Lower SG&A expenses per $ of revenue](https://preview.redd.it/gz1ncgq301561.png?width=398&format=png&auto=webp&s=52195d2a61cfd59582c11349b010a4203c5ca5b9)\n\n&#x200B;\n\n[Low receivables\\/sales despite expansion of Square capital because revenue has grown so fast](https://preview.redd.it/xa3wpk1501561.png?width=402&format=png&auto=webp&s=4d87e93f2f5a146b7506dbb47cad697b7366adbf)\n\n&#x200B;\n\n[Increasing return on equity \\(higher net profit margins and leverage\\)](https://preview.redd.it/mwzv067601561.png?width=390&format=png&auto=webp&s=d91926c27c23d593e8b951cacc99e32d98babdbc)\n\n&#x200B;\n\n[Consistently increasing free cash flow points to stability \\(especially since 2019 turned positive\\)](https://preview.redd.it/xzbtkm8701561.png?width=418&format=png&auto=webp&s=a8044e4e5413607ece7c32c4a9e093522ffa9469)\n\nWhile Square is far riskier than Paypal, they seem to be capturing a much larger market and have a bigger vision for the future at this point. Paypal becomes more like Microsoft and Square is kind of like Apple if we went back 10 years. One of them has widespread use and an established platform but still has consistent growth (about 15%) and the other is finding itself in a competitive market but is also slowly establishing absolute dominance. Square is absolutely overvalued, but for a growth stock that’s nothing out of the ordinary, and so is Paypal considering they don’t have nearly as much a prospect for growth unless leadership shows a huge change in direction some time soon. The “Paypal Mafia” however has surprised us before and I think there’s a solid chance of growth still plausible for them. Regardless, both of these companies should be a holding in your portfolio amidst a growing FinTech sector and a huge transition away from traditional payments.\n\nTickers: $ARKF $PYPL $SQ\n\nARKF 1/15/21 55c", "author_fullname": "t2_4h8ltwha", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "PYPL/SQ/ARKF fintech DD", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": 67, "top_awarded_type": null, "hide_score": true, "media_metadata": {"gz1ncgq301561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 74, "x": 108, "u": "https://preview.redd.it/gz1ncgq301561.png?width=108&crop=smart&auto=webp&s=bb308ddd3bf1d0790e1a4b67964dd61be2118408"}, {"y": 148, "x": 216, "u": "https://preview.redd.it/gz1ncgq301561.png?width=216&crop=smart&auto=webp&s=22274cad0aafd0c2901166c2b1df3902fa02b364"}, {"y": 219, "x": 320, "u": "https://preview.redd.it/gz1ncgq301561.png?width=320&crop=smart&auto=webp&s=ba119595fd24c500f25083d2369a02cb9ffca445"}], "s": {"y": 273, "x": 398, "u": "https://preview.redd.it/gz1ncgq301561.png?width=398&format=png&auto=webp&s=52195d2a61cfd59582c11349b010a4203c5ca5b9"}, "id": "gz1ncgq301561"}, "xzbtkm8701561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 73, "x": 108, "u": "https://preview.redd.it/xzbtkm8701561.png?width=108&crop=smart&auto=webp&s=852ce0f7b1b43c648763b88b3395180611e54c50"}, {"y": 147, "x": 216, "u": "https://preview.redd.it/xzbtkm8701561.png?width=216&crop=smart&auto=webp&s=58cb1d615f045312e36315966b40df6304d79ea6"}, {"y": 218, "x": 320, "u": "https://preview.redd.it/xzbtkm8701561.png?width=320&crop=smart&auto=webp&s=ac4ce5efd759a5f26e16d90b2646c371a484c3c4"}], "s": {"y": 285, "x": 418, "u": "https://preview.redd.it/xzbtkm8701561.png?width=418&format=png&auto=webp&s=a8044e4e5413607ece7c32c4a9e093522ffa9469"}, "id": "xzbtkm8701561"}, "cj0vx6gsz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 67, "x": 108, "u": "https://preview.redd.it/cj0vx6gsz0561.png?width=108&crop=smart&auto=webp&s=fcb0c9f6995451c09f6dd65a58aa3dc6e9d8a1c4"}, {"y": 135, "x": 216, "u": "https://preview.redd.it/cj0vx6gsz0561.png?width=216&crop=smart&auto=webp&s=29fe1b9c5e8ce80923c0fdda49e241431e170fe1"}, {"y": 200, "x": 320, "u": "https://preview.redd.it/cj0vx6gsz0561.png?width=320&crop=smart&auto=webp&s=e707de405735bc5f0f2d78c8a078f7e3c5d72be6"}, {"y": 400, "x": 640, "u": "https://preview.redd.it/cj0vx6gsz0561.png?width=640&crop=smart&auto=webp&s=7154534401a74711791ef203cd938671b43fad5a"}], "s": {"y": 500, "x": 800, "u": "https://preview.redd.it/cj0vx6gsz0561.png?width=800&format=png&auto=webp&s=d7f72e7dad5f7cbe846c489a90be6fa8d81067dd"}, "id": "cj0vx6gsz0561"}, "rjjzniarz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 113, "x": 108, "u": "https://preview.redd.it/rjjzniarz0561.png?width=108&crop=smart&auto=webp&s=59c3ae99e24e48b20ebd3108910bd448eb0c959f"}, {"y": 227, "x": 216, "u": "https://preview.redd.it/rjjzniarz0561.png?width=216&crop=smart&auto=webp&s=4742c2210b9bec58aab68ec68edac83a35f7dcb2"}, {"y": 336, "x": 320, "u": "https://preview.redd.it/rjjzniarz0561.png?width=320&crop=smart&auto=webp&s=989938811f814b3fd3ce4b470161fe2264a3700c"}], "s": {"y": 390, "x": 371, "u": "https://preview.redd.it/rjjzniarz0561.png?width=371&format=png&auto=webp&s=efe83afdb1c1d8adc38f4c37325fde9c1b125f93"}, "id": "rjjzniarz0561"}, "7i979ldoz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 18, "x": 108, "u": "https://preview.redd.it/7i979ldoz0561.png?width=108&crop=smart&auto=webp&s=95b4aa8a60548f05e2d7bc07e572463a7435fff8"}, {"y": 37, "x": 216, "u": "https://preview.redd.it/7i979ldoz0561.png?width=216&crop=smart&auto=webp&s=b39a289339736c7abb91f5f389fca52d82df2b38"}, {"y": 55, "x": 320, "u": "https://preview.redd.it/7i979ldoz0561.png?width=320&crop=smart&auto=webp&s=6c793ec7ad4da481496dae86bf5ff30372714563"}, {"y": 110, "x": 640, "u": "https://preview.redd.it/7i979ldoz0561.png?width=640&crop=smart&auto=webp&s=26ca5b5e2e027de4fee064327a764fb144b8daf7"}], "s": {"y": 138, "x": 800, "u": "https://preview.redd.it/7i979ldoz0561.png?width=800&format=png&auto=webp&s=798113837df594aa112574facc98df32685c8c79"}, "id": "7i979ldoz0561"}, "78wifzfdz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 29, "x": 108, "u": "https://preview.redd.it/78wifzfdz0561.png?width=108&crop=smart&auto=webp&s=e02820a93374e8d0841b326d154829d69e30f40f"}, {"y": 59, "x": 216, "u": "https://preview.redd.it/78wifzfdz0561.png?width=216&crop=smart&auto=webp&s=023382ae38dece88d47763005b214e11edd31421"}, {"y": 88, "x": 320, "u": "https://preview.redd.it/78wifzfdz0561.png?width=320&crop=smart&auto=webp&s=33662ec7cb7524ccd53fdb71ec4703f86705a28e"}, {"y": 176, "x": 640, "u": "https://preview.redd.it/78wifzfdz0561.png?width=640&crop=smart&auto=webp&s=de2c47aaa6f1bbd19ec51e5a79c906de5924b911"}], "s": {"y": 220, "x": 800, "u": "https://preview.redd.it/78wifzfdz0561.png?width=800&format=png&auto=webp&s=9bce649ad199031a1c5ddbfbdb663324b7ae3454"}, "id": "78wifzfdz0561"}, "xa3wpk1501561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 73, "x": 108, "u": "https://preview.redd.it/xa3wpk1501561.png?width=108&crop=smart&auto=webp&s=90ed23d4c8445fa4e97fefdf88d16a33bf6140e8"}, {"y": 147, "x": 216, "u": "https://preview.redd.it/xa3wpk1501561.png?width=216&crop=smart&auto=webp&s=0f6273d213c6ede9a9ed6730ca312df96d14f897"}, {"y": 218, "x": 320, "u": "https://preview.redd.it/xa3wpk1501561.png?width=320&crop=smart&auto=webp&s=82cd33452e8a0ebda4843c2d96db938593cb166d"}], "s": {"y": 275, "x": 402, "u": "https://preview.redd.it/xa3wpk1501561.png?width=402&format=png&auto=webp&s=4d87e93f2f5a146b7506dbb47cad697b7366adbf"}, "id": "xa3wpk1501561"}, "mwzv067601561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 74, "x": 108, "u": "https://preview.redd.it/mwzv067601561.png?width=108&crop=smart&auto=webp&s=232222684e218534411941bcab394d87951988b2"}, {"y": 149, "x": 216, "u": "https://preview.redd.it/mwzv067601561.png?width=216&crop=smart&auto=webp&s=1886f7dfaf5617f01fbed017a1d2f5d559f37434"}, {"y": 221, "x": 320, "u": "https://preview.redd.it/mwzv067601561.png?width=320&crop=smart&auto=webp&s=384a2e7a8a6d5e46186a8b7c50491ce9642ed483"}], "s": {"y": 270, "x": 390, "u": "https://preview.redd.it/mwzv067601561.png?width=390&format=png&auto=webp&s=d91926c27c23d593e8b951cacc99e32d98babdbc"}, "id": "mwzv067601561"}, "x99o8v39z0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 57, "x": 108, "u": "https://preview.redd.it/x99o8v39z0561.png?width=108&crop=smart&auto=webp&s=d5989d679e00beaa5c3b9e2479325025d2cb39ce"}, {"y": 115, "x": 216, "u": "https://preview.redd.it/x99o8v39z0561.png?width=216&crop=smart&auto=webp&s=2af61932b4665c219a21f3aa1719426a12f94739"}, {"y": 170, "x": 320, "u": "https://preview.redd.it/x99o8v39z0561.png?width=320&crop=smart&auto=webp&s=ffd3aa27832f0c949158ffcd277fbf5eac9aa3f9"}, {"y": 341, "x": 640, "u": "https://preview.redd.it/x99o8v39z0561.png?width=640&crop=smart&auto=webp&s=706a413c3bebccb21afe9693d332f95e2aec716f"}], "s": {"y": 427, "x": 800, "u": "https://preview.redd.it/x99o8v39z0561.png?width=800&format=png&auto=webp&s=c12fa73d91b1948acec47fe715cdefe8b4bfb3bb"}, "id": "x99o8v39z0561"}, "rq6x4g8kz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 73, "x": 108, "u": "https://preview.redd.it/rq6x4g8kz0561.png?width=108&crop=smart&auto=webp&s=1852278d784940e0f604fb34a49c1e3cf1480b74"}, {"y": 146, "x": 216, "u": "https://preview.redd.it/rq6x4g8kz0561.png?width=216&crop=smart&auto=webp&s=d7303aaa7c0b2108b3c46b75c3361f1b07231656"}, {"y": 217, "x": 320, "u": "https://preview.redd.it/rq6x4g8kz0561.png?width=320&crop=smart&auto=webp&s=69c87cf075e8400663bdc1efdd9009fb30dd4ae4"}], "s": {"y": 263, "x": 387, "u": "https://preview.redd.it/rq6x4g8kz0561.png?width=387&format=png&auto=webp&s=976d294dbc9ceb68d288570648b9a894fde8c1ac"}, "id": "rq6x4g8kz0561"}, "w3vmknzbz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 70, "x": 108, "u": "https://preview.redd.it/w3vmknzbz0561.png?width=108&crop=smart&auto=webp&s=1dae10cfb6ae407edeae278b4bea97cd92e4ba49"}, {"y": 141, "x": 216, "u": "https://preview.redd.it/w3vmknzbz0561.png?width=216&crop=smart&auto=webp&s=b9c6b7c17d84aab7667957df3b6bee75cba14cc3"}, {"y": 210, "x": 320, "u": "https://preview.redd.it/w3vmknzbz0561.png?width=320&crop=smart&auto=webp&s=105b6d9ff6d38e78ae1ab43016a760ced709ae0d"}, {"y": 420, "x": 640, "u": "https://preview.redd.it/w3vmknzbz0561.png?width=640&crop=smart&auto=webp&s=2f289cae02ce162477f3cbc5347c636e85ff1a2c"}], "s": {"y": 525, "x": 800, "u": "https://preview.redd.it/w3vmknzbz0561.png?width=800&format=png&auto=webp&s=23c083f35611ffa86a997cf3a9f75a7c29de7a9f"}, "id": "w3vmknzbz0561"}, "a4zkobuvz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 28, "x": 108, "u": "https://preview.redd.it/a4zkobuvz0561.png?width=108&crop=smart&auto=webp&s=a4f61fd867d7fc6622480debc97f18b99f0862dd"}, {"y": 57, "x": 216, "u": "https://preview.redd.it/a4zkobuvz0561.png?width=216&crop=smart&auto=webp&s=fbfc757aa24fa103317527f4407f6119c3c7efc7"}, {"y": 84, "x": 320, "u": "https://preview.redd.it/a4zkobuvz0561.png?width=320&crop=smart&auto=webp&s=b56e14fae46505128c09e5015ef8f58b6fc0e8d2"}, {"y": 169, "x": 640, "u": "https://preview.redd.it/a4zkobuvz0561.png?width=640&crop=smart&auto=webp&s=5032178c9547cc8ba3699e62d0928e4156c2fef8"}], "s": {"y": 212, "x": 800, "u": "https://preview.redd.it/a4zkobuvz0561.png?width=800&format=png&auto=webp&s=35c1273cb128c0d627add76e54bb36a9b34941a1"}, "id": "a4zkobuvz0561"}, "0b3gxlr201561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 21, "x": 108, "u": "https://preview.redd.it/0b3gxlr201561.png?width=108&crop=smart&auto=webp&s=754247193811f2e02d6d93d6e6353fa872989886"}, {"y": 43, "x": 216, "u": "https://preview.redd.it/0b3gxlr201561.png?width=216&crop=smart&auto=webp&s=aab249ea4c9c260a9df38c370d97b01a11e2a876"}, {"y": 64, "x": 320, "u": "https://preview.redd.it/0b3gxlr201561.png?width=320&crop=smart&auto=webp&s=a50f74a1204bc8879afd7e5f5b7307703d037e62"}, {"y": 129, "x": 640, "u": "https://preview.redd.it/0b3gxlr201561.png?width=640&crop=smart&auto=webp&s=54628a28ad33b2e0a0f87dd545dc74fba1e82c27"}], "s": {"y": 162, "x": 800, "u": "https://preview.redd.it/0b3gxlr201561.png?width=800&format=png&auto=webp&s=068b3f2d994b04f67fd2ad5c6de629851dd658ae"}, "id": "0b3gxlr201561"}, "mr9elex5z0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 52, "x": 108, "u": "https://preview.redd.it/mr9elex5z0561.png?width=108&crop=smart&auto=webp&s=865e0617df106c470d794231f50ea77eba7fe993"}, {"y": 104, "x": 216, "u": "https://preview.redd.it/mr9elex5z0561.png?width=216&crop=smart&auto=webp&s=57f4f2313edcdb0af350a34540ca25c6b5d16aa9"}, {"y": 155, "x": 320, "u": "https://preview.redd.it/mr9elex5z0561.png?width=320&crop=smart&auto=webp&s=e32af78ec0224b0e30a1b8e1c3b4befa087f422f"}, {"y": 310, "x": 640, "u": "https://preview.redd.it/mr9elex5z0561.png?width=640&crop=smart&auto=webp&s=f1ee58feed162fb401d42e33707543761afe6582"}], "s": {"y": 388, "x": 800, "u": "https://preview.redd.it/mr9elex5z0561.png?width=800&format=png&auto=webp&s=18e6eb1b9039d738af6c2ea5277018d2749cbbfd"}, "id": "mr9elex5z0561"}, "z2kkuyilz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 77, "x": 108, "u": "https://preview.redd.it/z2kkuyilz0561.png?width=108&crop=smart&auto=webp&s=1ef54b04cc33785431d54ed74a25325d5c6137f9"}, {"y": 155, "x": 216, "u": "https://preview.redd.it/z2kkuyilz0561.png?width=216&crop=smart&auto=webp&s=dabf1b03a03373781198dca680cc7528f53776aa"}, {"y": 230, "x": 320, "u": "https://preview.redd.it/z2kkuyilz0561.png?width=320&crop=smart&auto=webp&s=f8a9b81d3a47d8909dcc553f6e2a7f79614d28be"}, {"y": 460, "x": 640, "u": "https://preview.redd.it/z2kkuyilz0561.png?width=640&crop=smart&auto=webp&s=4e96bcc9243b699d1e25ace2ce760ef40a767f7c"}], "s": {"y": 575, "x": 800, "u": "https://preview.redd.it/z2kkuyilz0561.png?width=800&format=png&auto=webp&s=3dc69e6a4ecd333adf5c3e9fa851a266473fe4ec"}, "id": "z2kkuyilz0561"}, "47r8msvez0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 30, "x": 108, "u": "https://preview.redd.it/47r8msvez0561.png?width=108&crop=smart&auto=webp&s=8ee50b3c171a446b795503b451bcb69b5a045ade"}, {"y": 61, "x": 216, "u": "https://preview.redd.it/47r8msvez0561.png?width=216&crop=smart&auto=webp&s=d8892303b77ff266ef6f5c8fbe2b54052230f134"}, {"y": 90, "x": 320, "u": "https://preview.redd.it/47r8msvez0561.png?width=320&crop=smart&auto=webp&s=d129d416f0fb174cafecf4b35d185a444761a231"}, {"y": 180, "x": 640, "u": "https://preview.redd.it/47r8msvez0561.png?width=640&crop=smart&auto=webp&s=f3da4374783b7a8caf148e01459965cc093bfe86"}], "s": {"y": 226, "x": 800, "u": "https://preview.redd.it/47r8msvez0561.png?width=800&format=png&auto=webp&s=2cefbcab0e52e1a1ca9e42b946f569f4a1595785"}, "id": "47r8msvez0561"}, "jh21m90lz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 78, "x": 108, "u": "https://preview.redd.it/jh21m90lz0561.png?width=108&crop=smart&auto=webp&s=7a5eb4dc3daa9b48dbf01fc6abeb574e355a3439"}, {"y": 157, "x": 216, "u": "https://preview.redd.it/jh21m90lz0561.png?width=216&crop=smart&auto=webp&s=d2451c9daf47db2c93fa0470db96f6e93c1a8ec6"}, {"y": 232, "x": 320, "u": "https://preview.redd.it/jh21m90lz0561.png?width=320&crop=smart&auto=webp&s=93c5f6663c24f1dddaf946eee8b27dcdc1009fec"}, {"y": 465, "x": 640, "u": "https://preview.redd.it/jh21m90lz0561.png?width=640&crop=smart&auto=webp&s=fc6262179eb83a440847118befea375f24a23fa1"}], "s": {"y": 582, "x": 800, "u": "https://preview.redd.it/jh21m90lz0561.png?width=800&format=png&auto=webp&s=b77b71f08785127aea6cad5afa30e6ff37f78f11"}, "id": "jh21m90lz0561"}, "6krvne7101561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 16, "x": 108, "u": "https://preview.redd.it/6krvne7101561.png?width=108&crop=smart&auto=webp&s=8bb7501b3abe98f5d79e7a1b1ab926bfb22e1699"}, {"y": 32, "x": 216, "u": "https://preview.redd.it/6krvne7101561.png?width=216&crop=smart&auto=webp&s=9d0f47f0c165e56eb01a6e4d5e1c4354f7ad890d"}, {"y": 47, "x": 320, "u": "https://preview.redd.it/6krvne7101561.png?width=320&crop=smart&auto=webp&s=a7b1581e40bb107d6b8405ffb0ead938bac1ec1f"}, {"y": 95, "x": 640, "u": "https://preview.redd.it/6krvne7101561.png?width=640&crop=smart&auto=webp&s=2ca03043766c15fedf7aeaa52659a179c86ecf97"}], "s": {"y": 119, "x": 800, "u": "https://preview.redd.it/6krvne7101561.png?width=800&format=png&auto=webp&s=87bb78977eaa222762e5f24f5061651850ad74e5"}, "id": "6krvne7101561"}, "v4cgyl1nz0561": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 29, "x": 108, "u": "https://preview.redd.it/v4cgyl1nz0561.png?width=108&crop=smart&auto=webp&s=7b0298e53798dc457c8c44199effcac39f472590"}, {"y": 59, "x": 216, "u": "https://preview.redd.it/v4cgyl1nz0561.png?width=216&crop=smart&auto=webp&s=988f16d669a920b6573f4101253427c5f07e15e6"}, {"y": 87, "x": 320, "u": "https://preview.redd.it/v4cgyl1nz0561.png?width=320&crop=smart&auto=webp&s=67b2e0313e82040baf3325836a504e6ddcc7e68b"}, {"y": 175, "x": 640, "u": "https://preview.redd.it/v4cgyl1nz0561.png?width=640&crop=smart&auto=webp&s=bcf061a7b3ae757e64fdfe03d7dde4a414f2e611"}], "s": {"y": 219, "x": 800, "u": "https://preview.redd.it/v4cgyl1nz0561.png?width=800&format=png&auto=webp&s=272965de645fa1a9aac0ff763863cc28e7942035"}, "id": "v4cgyl1nz0561"}}, "name": "t3_kcjqfb", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 8, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": true, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 8, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/Abt-tzxT3YAaMVsVaOFuxpv-byTttX2wsLjMLNf_dFg.jpg", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1607925345.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Paypal was an early COVID investing pick due to its nature of contactless payments and its rise in young populations with Venmo. Paypal has a storied history, founded by some of the most influential Silicon Valley VC’s and entrepreneurs they started as two smaller companies founded in the middle of the tech bubble (1998 and 1999) as Confinity and X.com by Peter Thiel and Elon Musk. They were able to weather the storm of the 2000 tech fallout by being bought out by eBay for $1.5B beforehand. Under eBay, Paypal grew their services into what most of us know them for: digitized payments. Starting from effortless check transfers for unauthorized vendors to working their way to B(!)tcoin, Paypal has made it more convenient for payments to be processed, and in our consumerist economy that’s an absolute goldmine. Square is a relatively new player in the digital transaction space but they’ve had quite a run up this year under the leadership of Jack Dorsey, founder of Twitter. Their first product was a card reader that fit into the headphone jack of smartphones, so naturally Square expanded into the enterprise services market and continued developing solutions for small businesses like payroll management. I’ll further discuss the respective structures of both companies in this due diligence</p>\n\n<p><strong>The Expansion of Digital Transactions</strong></p>\n\n<p>Paper currency has been the standard means of exchange for ages, but the digital method of exchange, particularly mobile exchanges has now become far more convenient. In 2017, digital payments were expected to reach a market value of <a href=\"https://www.cnbc.com/2017/10/09/digital-payments-expected-to-hit-726-billion-by-2020-study-finds.html\">$726B</a> in 2020, and here we are post covid with the value of digital payments at over 910B.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mr9elex5z0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=18e6eb1b9039d738af6c2ea5277018d2749cbbfd\">https://preview.redd.it/mr9elex5z0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=18e6eb1b9039d738af6c2ea5277018d2749cbbfd</a></p>\n\n<p>Statista forecasts that most of the sales growth for digitized payments past 2020 will come from mobile POS, and that most of the user growth for digitized payments will also be in peer-to-peer transactions. Paypal has both bases covered with Venmo when it comes to mobile transactions and it has E-Commerce covered with its major retailer partnerships and with eBay. Square has Cash app, which is a peer-to-peer payments app plus they also have in-person small business products for digital payments like their “cash register” called the Square Stand which is useful for freelancing professionals and small businesses.</p>\n\n<p>So a pro of Square is that it has a far more established presence in the growing sector of digital payments which is mobile POS payments, not E-Commerce. However, E-Commerce is the much larger sector by users alone:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/x99o8v39z0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=c12fa73d91b1948acec47fe715cdefe8b4bfb3bb\">https://preview.redd.it/x99o8v39z0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=c12fa73d91b1948acec47fe715cdefe8b4bfb3bb</a></p>\n\n<h3>As you can see, mobile POS payments are expected to triple in the same time that E-commerce will grow by around 20%.</h3>\n\n<p>This makes a lot of sense to me as E-Commerce still makes up a small amount of all transactions and its trajectory is very much fixed and established now. POS payments are definitely growing though, as on my last trip to India, one of the fastest growing countries, I observed that every small business had a PayTM barcode for transactions, and this is where both Paypal and especially Square will eventually expand to. CNBC also forecasts most digital payment growth will happen in emerging markets (which is why I’ll suggest an ETF at the end which incorporates emerging market companies) “Emerging markets are expected to grow at a rate three times that of developed economies in terms of digital transaction volumes. Digital payments in developing markets grew 21.6 percent between 2014 and 2015, compared to a 6.8 percent rise in mature markets. Non-cash payments in Asian emerging markets are projected to grow by almost a third (30.9 percent), led by powerhouses China and India”. According to CNBC analysts though, cash will still remain supreme for the following reasons: speed of exchange, universal acceptance, anonymity, absence of record and free of charge. Anonymity and absence of record are things that are being fixed by the incorporation of cr(!)ptocurrency into transactions, but it’s likely the biggest reason people don’t switch to cashless is because not all merchants use it and the fees add up especially for many transactions a day for the <em>merchants</em>. Eventually when the digital transaction economy grows fully, there will be enough competitors to offer sellers competitive rates to a point where they’ll choose mobile payments for the convenience it provides in terms of not having to use physical cash but as of now only small businesses are willing to make the opportunity cost of losing fees so they don’t have to store cash.</p>\n\n<p><strong><em>Paypal</em></strong></p>\n\n<p>Paypal is “a global, two-sided network at scale that connects merchants and consumers with 305 million active accounts (consisting of 281 million consumer active accounts and 24 million merchant active accounts) across more than 200 markets. PayPal helps merchants and consumers connect, transact, and complete payments, whether they are online, on a mobile device, in an app, or in person”. They have a variety of new products in development as they have made several acquisitions since their establishment. Paypal offers merchants a technology-agnostic platform that requires no hardware and little time to set up with its Braintree product which is primarily for online sellers and iZettle which is used for POS payments primarily in international markets and they have a user base of 19 million. This acquisition was made with the full intention of competing with Square and since Paypal has had an extremely talented eye for acquisitions in the past in Xoom and Venmo, this <a href=\"https://www.forbes.com/sites/greatspeculations/2018/06/07/why-did-paypal-pay-such-a-high-price-for-izettle/?sh=60f035216860\">relatively new acquisition</a> has a lot of potential, but it could also just be a last minute scramble to catch up to Square’s huge market share in POS payment offerings. Paypal has a great P2P ecosystem in Venmo and Xoom and a credit partnership with Synchrony bank as well which helps diversify revenue streams. Paypal also owns a company called GoPay, which basically provides the same services Paypal does but in China, which expands them into a market that’s more likely to grow in the future.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/w3vmknzbz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=23c083f35611ffa86a997cf3a9f75a7c29de7a9f\">https://preview.redd.it/w3vmknzbz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=23c083f35611ffa86a997cf3a9f75a7c29de7a9f</a></p>\n\n<p>As you can see, Paypal has some pretty consistent revenue, profit, and EBITDA growth, but a bit more concerning may be the fact that margins have been relatively stable and they haven’t been increasing at all. I believe the reason for this is because PayPal’s full potential isn’t close to being realized, and even founder Peter Thiel said in his book “Zero to One” that Paypal wouldn’t start realizing a majority of their cash flows until 2020.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/78wifzfdz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=9bce649ad199031a1c5ddbfbdb663324b7ae3454\">https://preview.redd.it/78wifzfdz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=9bce649ad199031a1c5ddbfbdb663324b7ae3454</a></p>\n\n<p>&#x200B;</p>\n\n<p> While Paypal was able to increase earnings per share by a strong 21% from 2018 to 2019, they decreased cash flows from operating activities by 17% from 2018. This requires that we go into the capital expenditures in their CF statement, which will provide a clearer idea of why and how Paypal lost cash flow despite rising net income. Another thing standing out may be the fact that the operating margin is pretty constant, which can be a concerning sign for investors seeking a growth stock. Plus, considering how much the price for PYPL has run up in the past few months you’d expect better profitability to come with it hand-in-hand. But the future being factored into Paypal isn’t based on its face value, or else the price would be very stagnant right now and it wouldn’t have grown nearly as much as it has.</p>\n\n<p>Here’s what I mean:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/47r8msvez0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=2cefbcab0e52e1a1ca9e42b946f569f4a1595785\">https://preview.redd.it/47r8msvez0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=2cefbcab0e52e1a1ca9e42b946f569f4a1595785</a></p>\n\n<p>The amount of profit Paypal can squeeze out of its main product is pretty much at a maximum as transaction expenses are growing at the same rate as revenues are and operating expenses are still going up at a somewhat proportional rate to that of net income, meaning that no more value is going to come out of the existing product. While the existing product is still going to grow in popularity, its profitability is only going to decrease or stagnate as Paypal expands into developing markets that aren’t willing to cough up as much in fees. As Thiel himself puts it, that’s “horizontal innovation” AKA just globalism. That alone isn’t enough to justify the investment levels in Paypal, but investments and acquisitions into the future of transactions will expand it, and on top of this it is only recently Paypal has experienced such tremendous growth in cash flows YoY.</p>\n\n<p>Now you’ll see below PYPL’s historic cash flows, and if you go to the bottom you’ll see their free cash flow decreased from 2018 to 2019 as I previously mentioned. The root cause of this is investment purchases, which increased by $5B in 2019 and contributed to the Free Cash Flow decreasing by 800M. Again, if we look at Paypal’s track record when it comes to acquisitions they’ve been very successful, so there’s not much reason to expect much different this time around. If Paypal’s investing, investors are excited. They’ve piled up cash up until last year, and they’re finally using it now based off their cash per share:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rq6x4g8kz0561.png?width=387&amp;format=png&amp;auto=webp&amp;s=976d294dbc9ceb68d288570648b9a894fde8c1ac\">https://preview.redd.it/rq6x4g8kz0561.png?width=387&amp;format=png&amp;auto=webp&amp;s=976d294dbc9ceb68d288570648b9a894fde8c1ac</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/jh21m90lz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=b77b71f08785127aea6cad5afa30e6ff37f78f11\">https://preview.redd.it/jh21m90lz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=b77b71f08785127aea6cad5afa30e6ff37f78f11</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/z2kkuyilz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=3dc69e6a4ecd333adf5c3e9fa851a266473fe4ec\">https://preview.redd.it/z2kkuyilz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=3dc69e6a4ecd333adf5c3e9fa851a266473fe4ec</a></p>\n\n<p>Add to this the tremendous increase in digital payment volume in the past year and we can expect a real change in the entire sector’s trajectory. Hedge funds have been piling up on this supposed legacy company for a valid reason: their time for expansion is <strong><em>now, and COVID-19 has only spurred in realizing this perfect storm, as net income and revenue has seen a jump in the past two quarters:</em></strong></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/v4cgyl1nz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=272965de645fa1a9aac0ff763863cc28e7942035\">https://preview.redd.it/v4cgyl1nz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=272965de645fa1a9aac0ff763863cc28e7942035</a></p>\n\n<p>So you must be wondering why Paypal’s cash from operations was down in 2019 from 2018, but in their most recent 10k Paypal explained cash from operations and free cash flow was only down due to “positive impact of $1.4 billion of changes in loans and interest receivable, held for sale, net following the sale of our U.S. consumer credit receivables portfolio” which was added into the operating income as it was a noncash expense and that’s why 2019 looks down about $1B in cash even though operating income for 2019 was up $0.4B:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7i979ldoz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=798113837df594aa112574facc98df32685c8c79\">https://preview.redd.it/7i979ldoz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=798113837df594aa112574facc98df32685c8c79</a></p>\n\n<p>Paypal’s newly acquired capital is already being used and it’ll be put to good use based on the meteoric rise in transactions in the past two years. Contactless payments will eventually become a norm and their established e-commerce platform will set them up pretty well on this end.</p>\n\n<p>Now to address the flip side of the coin: POS or Point of Sale transactions, which is a market Square has wrapped around its finger as it’s had the head start since the iPhone 4. Here’s how Square got started, instead of giving 10$ to people for using their product, founder and CEO Jack Dorsey (who also is the founder and CEO of Twitter) gave them the product for free and built an infrastructure around it. It was simply a credit card scanner that could be inserted into the headphone jack of a smartphone. This simple product is still being sent out for free to small businesses and the software and business model that surrounded this tiny card reader has expanded like a wildfire since then. Square would collect 2.75% on each payment similar to Paypal.</p>\n\n<p>Square also made a “cash management” app, Cash App to dive into a non-retail market.</p>\n\n<p>About Cash App: “Cash App provides an ecosystem of financial products and services to help individuals manage their money. While Cash App started with the single ability to send and receive money, it now provides an ecosystem of financial services that allows individuals to store, send, receive, spend, and invest their money.”</p>\n\n<p>It appears as if Square is trying to become an all-round player in the consumer and producer financial ecosystem as Cash App has become more like a bank or brokerage account rather than just a P2P service like Paypal or Zelle. Now, Cash App makes 25% of SQ’s revenues.</p>\n\n<p>In Square’s 2019 annual report, they reported the following:</p>\n\n<p>In the year ended December 31, 2019, we processed $106.2 billion of Gross Payment Volume (GPV), which was generated by nearly 2.3 billion card payments from 407 million payment cards. At the end of 2019, our Square point of sale ecosystem had over 180 million buyer profiles and approximately 230 million items were listed on Square by sellers.</p>\n\n<p>As of December 2019, Cash App had approximately 24 million monthly active customers who had at least one cash inflow or outflow during a given month.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/rjjzniarz0561.png?width=371&amp;format=png&amp;auto=webp&amp;s=efe83afdb1c1d8adc38f4c37325fde9c1b125f93\">The above image shows Square’s payment volume distribution across different industries, and as you can see in 2019 payment volume was very diverse which bodes well for SQ’s stability.</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/cj0vx6gsz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=d7f72e7dad5f7cbe846c489a90be6fa8d81067dd\">This shows the increasing size of sellers who use Square, and this shows that Square’s mission of making small businesses big and having them stick to their product regardless of their stage in growth is working.</a></p>\n\n<p>Although their main business is in processing payments, Square is making itself a fin-tech institutional force with 30 different API’s for retail and e-commerce sellers along with invoicing, appointment, payroll, loyalty/gift card, and account management services. Square also has financing for small businesses in Square Capital, which I find to be the most interesting part of their model. They give small loans to businesses based on the data that they <strong><em>already have as Square manages the business’ finances, remember? And this puts them at an advantage to make good debt because of the transparency into the business’ finances. This will allow Square to make extremely profitable and high turnover loans that have virtually NO risk of default</em></strong>. The types of loans they give are generally small, and they could be as little as $500. They describe these loans as the type you’d ask for from your parents or relatives. Square has such in-depth data from these businesses that when they make loans they don’t even <em>consider</em> credit scores: “Generally, for loans to Square sellers, loan repayment occurs automatically through a fixed percentage of every card transaction a seller takes. Loans are sized to be less than 20% of a seller’s expected annual GPV (their payment volume) and, by simply running their business, sellers repay their loan in eight to nine months on average”</p>\n\n<p>Since 2014, Square has made over $6B in loans with a failure rate of only 4%, which makes sense because Square has access to all of its client’s financials so therefore they possess the ability to make fully transparent loans.</p>\n\n<p>When you jump into Square’s financials, there’s a lot of promise to say the least:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/a4zkobuvz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=35c1273cb128c0d627add76e54bb36a9b34941a1\">https://preview.redd.it/a4zkobuvz0561.png?width=800&amp;format=png&amp;auto=webp&amp;s=35c1273cb128c0d627add76e54bb36a9b34941a1</a></p>\n\n<p>Not only has revenue grown by 42% from 2018 to 2019, net income finally became positive in 2019 and free cash flow increased from 232m to 400m in the same span.</p>\n\n<p>Here’s the revenue breakdown for Square, and as you can observe while transaction revenue saw much stronger compared to Paypal, the real deal was Square’s expansion of its enterprise solutions as those revenues increased by 74% last year, these are revenues recognized as the following: “Revenue from Cash App, Square Capital, and Instant Transfers for sellers currently comprise the majority of our subscription and services-based revenue. Cash App subscription and services-based revenue is primarily comprised of transaction fees from Cash App Instant Deposit and Cash Card. Our other subscription and services-based products include website hosting and domain name registration services, Gift Cards, Square Appointments, Customer Engagement, Employee Management, Payroll, Square Card, and other product offerings.”</p>\n\n<p>B(!)tcoin revenues from Cash App investing whose revenues increased by 210% (in this case B(!)tcoin is an asset that Square owns and sells to those using Cash App to invest in cr(!)ptocurrency.)</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/6krvne7101561.png?width=800&amp;format=png&amp;auto=webp&amp;s=87bb78977eaa222762e5f24f5061651850ad74e5\">https://preview.redd.it/6krvne7101561.png?width=800&amp;format=png&amp;auto=webp&amp;s=87bb78977eaa222762e5f24f5061651850ad74e5</a></p>\n\n<p>Also in that same span, Square’s cash has nearly doubled. This liquidity will be necessary as Square Capital continues to grow and will require financing.</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/0b3gxlr201561.png?width=800&amp;format=png&amp;auto=webp&amp;s=068b3f2d994b04f67fd2ad5c6de629851dd658ae\">https://preview.redd.it/0b3gxlr201561.png?width=800&amp;format=png&amp;auto=webp&amp;s=068b3f2d994b04f67fd2ad5c6de629851dd658ae</a></p>\n\n<p>Observing some long term trends now for $SQ:</p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/gz1ncgq301561.png?width=398&amp;format=png&amp;auto=webp&amp;s=52195d2a61cfd59582c11349b010a4203c5ca5b9\">Lower SG&amp;A expenses per $ of revenue</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xa3wpk1501561.png?width=402&amp;format=png&amp;auto=webp&amp;s=4d87e93f2f5a146b7506dbb47cad697b7366adbf\">Low receivables/sales despite expansion of Square capital because revenue has grown so fast</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/mwzv067601561.png?width=390&amp;format=png&amp;auto=webp&amp;s=d91926c27c23d593e8b951cacc99e32d98babdbc\">Increasing return on equity (higher net profit margins and leverage)</a></p>\n\n<p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/xzbtkm8701561.png?width=418&amp;format=png&amp;auto=webp&amp;s=a8044e4e5413607ece7c32c4a9e093522ffa9469\">Consistently increasing free cash flow points to stability (especially since 2019 turned positive)</a></p>\n\n<p>While Square is far riskier than Paypal, they seem to be capturing a much larger market and have a bigger vision for the future at this point. Paypal becomes more like Microsoft and Square is kind of like Apple if we went back 10 years. One of them has widespread use and an established platform but still has consistent growth (about 15%) and the other is finding itself in a competitive market but is also slowly establishing absolute dominance. Square is absolutely overvalued, but for a growth stock that’s nothing out of the ordinary, and so is Paypal considering they don’t have nearly as much a prospect for growth unless leadership shows a huge change in direction some time soon. The “Paypal Mafia” however has surprised us before and I think there’s a solid chance of growth still plausible for them. Regardless, both of these companies should be a holding in your portfolio amidst a growing FinTech sector and a huge transition away from traditional payments.</p>\n\n<p>Tickers: $ARKF $PYPL $SQ</p>\n\n<p>ARKF 1/15/21 55c</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kcjqfb", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "WannabeStonks69", "fullname": "t2_4h8ltwha"}, "discussion_type": null, "num_comments": 9, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/", "subreddit_subscribers": 1696182, "created_utc": 1607896545.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kcjqfb", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfqwtjk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "ohmy420", "fullname": "t2_tgscbat"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kcjqfb", "score": 7, "author_fullname": "t2_tgscbat", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Damn I wish I could read", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201115:7:2"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Damn I wish I could read</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/gfqwtjk/", "num_reports": null, "locked": false, "name": "t1_gfqwtjk", "created": 1607925672.0, "author_flair_text": "\u001b201115:7:2", "treatment_tags": [], "created_utc": 1607896872.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kcjqfb", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfqxbcz", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "gringo558", "fullname": "t2_1avr4hbu"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kcjqfb", "score": 2, "author_fullname": "t2_1avr4hbu", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "SQ @ >400 EOY (2021)!", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>SQ @ &gt;400 EOY (2021)!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/gfqxbcz/", "num_reports": null, "locked": false, "name": "t1_gfqxbcz", "created": 1607925911.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607897111.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kcjqfb", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "gfqwnyb", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "BigDerbsBiggerStonks", "fullname": "t2_3v2cjno5"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kcjqfb", "score": 2, "author_fullname": "t2_3v2cjno5", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "All that context but no positions 🤨", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "Psalms 22:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>All that context but no positions 🤨</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/gfqwnyb/", "num_reports": null, "locked": false, "name": "t1_gfqwnyb", "created": 1607925599.0, "author_flair_text": "Psalms 22:1", "treatment_tags": [], "created_utc": 1607896799.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 0, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kcjqfb", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfqysxo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "the_corporate_slave", "fullname": "t2_5nut5qqo"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gfqwnyb", "score": 0, "author_fullname": "t2_5nut5qqo", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "🧐🧐🤨🤨🤨", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>🧐🧐🤨🤨🤨</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kcjqfb/pyplsqarkf_fintech_dd/gfqysxo/", "num_reports": null, "locked": false, "name": "t1_gfqysxo", "created": 1607926639.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607897839.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}