{"approved_at_utc": null, "selftext": "Before diving in, a few housekeeping items:\n\n1. **I didn't write this.** Everything below has been copied and pasted from [Chris Bloomstran](https://twitter.com/ChrisBloomstran/status/1345155266468306944)'s Twitter feed, which has trended for the past day. All I've added are a few edits for brevity. If you have a Twitter account, definitely give him a follow. I'm posting this here because I know not all of us are active on Twitter, and some might appreciate the read.\n2. \"**OP is a gay bear.\"** Full disclaimer, I neither own puts nor am short Tesla (although I'm definitely considering it). In fact, I think Tesla is a fantastic company; if they were cheaper I would almost definitely be long. I'm posting this because, beneath all of the memes and shitposting, I know that all of us want to make money. Every little bit of information/analysis helps, even if we disagree with the end-conclusion.\n3. **\"Post is too long. Ban.\"** This post isn't meant for you, please move along. I know it's wordy and there aren't any pictures, but this is meant for those in this sub who enjoy a bit of reading/research. If you aren't interested in a bit of reading, please scroll past.\n4. **If you YOLO $TSLA puts because of this post, you deserve to lose your money.**\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\n**A single prediction for the New Year.**\n\nThose unfamiliar with the Federal Reserve Board’s Regulation T will hear lots about it during 2021. The rule limits the percentage of an investment in equity securities that can be borrowed with a margin loan. A wake-up call is scheduled...\n\nIt was widely reported this week that total margin debt reached a new high of $722B. The WSJ’s 12/28 lead Business and Finance story profiled a $TSLA retail investor, a civil engineer, who had parlayed a $23k option investment in $TSLA into a $2m position. Oh boy. The gentleman is to surely and genuinely be commended for the investment. An 87x gain in a short period is extraordinary (I've never done that, nor will I). That said, a quick perusal of $TSLA twitter commentary and recommendations is terrifying.\n\nOne can read the Journal article, [Investors Double Down on Stocks, Pushing Margin Debt to Record TSLA](https://www.wsj.com/articles/investors-double-down-on-stocks-pushing-margin-debt-to-record-11609077600), and draw two conclusions. One, “This must be extremely dangerous,” or two, “Surely I can get rich quick too.” Human nature being what it is… For the latter, the civil engineer offers this advice on his Twitter page, “If you have no Tesla call options, you may want to do the math and consider using LEAPS as a way to accelerate your accumulation of Tesla stock. 40X in 2020. Another 50X by 2025.” Whoa.\n\n*A* series of Q&A tweets ensues (thanks for the heads up [@RomanRubinstein](https://twitter.com/romanrubinstein?lang=en)) on which broker/dealers offer the most margin, the lowest interest rate on margin debt, and how to borrow the most money and obtain the maximum leverage by purchasing call options. “Maintain margin value of 50% in my portfolio and the margin borrowing rides forever,” goes the advice. Please consider the danger of heeding this advice. The engineer should risk-off and live a happy life.\n\nA whole bunch of people are going to lose a whole bunch of money.\n\nReading through a series of tweets among the Tesla (and others) option crowd, you see little, if any, mention of maintenance margin requirements. FINRA requires investors, strike that, speculators, to maintain equity of at least 25% of the value of an account. Leverage kills. Maintenance rates can be set above the minimum threshold. The concept of posting shares in stocks like $TSLA, $TWTR, or any established company trading for 20x or 30x sales & borrowing half of the value and then buying calls on the same shares posted as collateral is insanity. The only “math” a speculator should be doing is knowing at what price against the shares in the account will new equity be required. Most brokers don’t wait around for a customer to come up with new cash or securities to deposit. What do they do?\n\nThey sell down your shares to get to equity compliance. More decline? More forced selling. Depending on maintenance margin thresholds, you can lose it all in a hurry. Red flags are abundant, beyond simply the new record high in total margin and credit market debt outstanding. You can see the bubble in the number of single-contract call options outstanding, in the number of new retail accounts being opened with margin and allowed option trading, and even in the tone of surety by speculators regarding prospects for wildly expensive shares like Tesla.\n\nI never thought I’d again see the kind of mania like we saw in the late 1990’s, but here we are. Memories of what can and is likely to happen are long gone. Even a number of professional investors have suspended price as a key determinant of value.  A respected and well-known retired professional investor suggested on Twitter recently that I don’t understand “$TSLA growth math or basic investment theory,” that “stocks look forward, not backward” and that “P/E’s are a function of exponential growth rates, not industry.”\n\nThe last time an investment pro came unglued was January 2000 at a newspaper roundtable. The C.I.O/PM for one of the largest & oldest growth & income funds at the time took exception to the notion that $MSFT shareholders would lose money for the next 15 years, which they did. I’d written 6 pages on the prediction in my 1/1/2000 letter (on the website) and discussed it at the roundtable. My co-panelist became unhinged because he and his firm had 5% of capital in $MSFT, which was then a $620B market cap on $20B in sales, 31x sales & 80x earnings.\n\nYou can apply the same logic to $TSLA or to any number of dangerously overvalued fashionable disruptive growers today. The Tesla bull proffering margined purchase of $TSLA LEAPS expects a $1,000 share price this year, $5,000 the next and $22,000 by 2025.\n\nNow, a $22,000 stock price, assuming no further dilution above today’s 1.1B fully diluted shares outstanding, gets you to a $24 trillion market value, which must be reasonable given that the entire market value of the S&P 500 today is only \\~$31 trillion & global GDP is $88T. When your TAM (the new eyeballs) is 100% global auto market share, robotaxi, energy grid, insurance and economic population of Mars, no price is too high. No argument that Tesla has made great strides in manufacturing efficiency and are now producing a more reliable product.\n\nI also believe disruption of the auto industry will require an enormous amount of capital to grow and the established OEM’s won’t play dead. You can't simply separate auto margins and capital requirements from nearly infinite profitability earned by selling software upgrades. Shouldn’t the upgrades be considered part of total vehicle cost? To what extent did the Apples and Microsofts of the world thrive on a regular upgrade cycle, much of which was and is planned. How often are you compelled into a new iPhone or iPad? Prior to the subscription model, at what point did Microsoft not support an older operating system or Office suite? Will EV buyers purchase a new car every 2-3 years? How much of the world can afford a more expensive vehicle than the current global average car price?\n\nRegardless of one's beliefs on business quality & growth prospects, paying a too-high price can destroy future investment return. #neversell? When price becomes ridiculous to the most optimistic business case you #bettersell. Price matters and the current environment is nuts. The current folly for price not mattering, or being justifiably high, reminds me of a well known sell-side report on Berkshire Hathaway in 1998 which assumed as undervalued both $BRK’s shares and its stock portfolio against an assumed “reasonable” 40x market multiple.\n\nBerkshire’s shares, expensive, would fall by half over the next 18 months to a February 2000 low. It’s become fashionable to explain investment process by saying price is the last consideration. Too often lately, price isn’t even a consideration, especially for holy growers. While I did not have a short position on $MSFT in 2000, I do have a very small recent short on Tesla today so take my comments w/ a grain of salt. I did buy $MSFT in '06 after it fell by \\~75% and owned it for a decade, trimming when dear and adding to the position when cheap.\n\n*S*hort selling is very risky and those w/ sizable short positions on Tesla at the outset of 2020 would have suffered real damage given the 720% advance during the year. I've read that shorts lost $38B during '20 alone on their collective positions & short interest is way down. I happen to think the valuation is now so large to protect against a continued runaway price, particularly now that u/elonmusk secured its entry in the S&P 500 by engineering 4 quarters of profits by cutting R&D, SG&A and thanks to environmental credits courtesy $GM & $FCA.\n\nStill, I’d never employ a large short position given unlimited downside and a max return of 100%. Margin is required against short positions. What appears to be a growing army of retail option traders, many employing sizable margin debt, is a recipe for disaster. Price and quality conscious investors get uncomfortable at times like these. I am extremely uncomfortable. I hope those that have no idea what they are doing heed growing and now very high risk and fully understand downside and what margin calls and maintenance margin mean.\n\nMany, many speculators will lose much and even all of their money at some point as this bubble breaks. Now is the time to reduce risk. You could feel badly for employees that were paid in non-qualified stock options and kept their shares upon exercise in the late 1990’s. When shares plummeted in the wake of the tech bubble the tax liability due on gain realized as income upon exercise was still due and payable, despite shares that were way below the exercise price. It was bad. Many lost everything but weren’t in a position to understand risk.\n\nBorrowing against Tesla (or any) shares and buying call options presents serious deliberately assumed risk. For perspective, a 92% decline takes the shares back to where they started 2020! With margin, it will take way less than a 92% decline to introduce wipeout.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\n***Responding to the PM who claims that the $TSLA price target of $1,200, total EV adoption of 20%, and 5% market share in global auto-manufacturing is reasonable, Bloomstran had this to say:***\n\nYou have EV adoption rising from 3% to 20% in five years, a 6x increase (46% CAGR) and Tesla market share at 25%. 2019 global new vehicle sales totaled \\~95m units and will be way lower this year. Let's call 2020 a throwaway for the industry, and hats off to [$TSLA](https://twitter.com/search?q=%24TSLA&src=cashtag_click) for growing. From the 2019 base, if we assume 4% market growth then new global units in 2025 would be 115m and at your expected 20% share Tesla would sell 29 million vehicles. Is this your assumption? Sounds aggressive given Tesla’s 500k unit run rate for 2020 and 1/2% market share.\n\nNow, US new vehicle prices are $38k but significantly lower worldwide, let’s say $30k per vehicle sold globally. The average Tesla looks to range from high $30k’s for the Model 3 to $55k for the Model 3 Performance to $125k for the Model X Performance fully loaded.  What do you expect for an average selling price for Tesla in 2025? I’d presume that as market share expands ASP’s will have to fall to affordable. I’m trying to get to a revenue number.\n\nPerhaps the governments of the world will be giving $2k per person, $8k per family of 4 in annual perpetuity, surely making new cars more affordable! If Tesla sells 29m units in 2025 @ $34.5k per unit, that gets sales to $1 trillion, a CAGR of \\~102% for five years. Reasonable?\n\nMoving on, you have a 2025 EPS target of $24/share. On how many shares shall we apply your expected per-share figure? Shares outstanding at 9/30 totaled 948m, up from 905m at yearend 2019. An additional $5B in shares were sold recently to the public in “at-the-market” sales.  The sales were done with no roadshow, risk disclosure or prospectus, unless Goldman’s report upgrading the shares from neutral to buy & a new price target of $780, up from $455, issued days before the announced sale and Goldman’s retention as selling agent, as a “prospectus.\"\n\nIf the shares were sold at an average of \\~$600/share, the share count would now be 8.3m shares higher, so call the total 956m. You have a price target of $1,200 for the shares, so let’s not forget to include in the count any option and RSU shares issued but not yet exercised.  Recall, [*@elonmusk*](https://twitter.com/elonmusk) was granted 20m option shares (now 100m thanks to the split) in 2018 by [*@larryellison*](https://twitter.com/larryellison) and Elon’s associates on the board. Fully diluted shares total 1.113B right now, and if the stock keeps rising we can assume all options will be exercised and outstanding.\n\nSo, how many shares should we apply to your $24 EPS target? If we assume zero further dilution (realistic?), then using the 1.113B fully diluted shares including the recent $5b sale, we get to $26.7B in net income. On an even $1 trillion in revenues, that’s a 2.67% profit margin, just a bit higher than the auto industry average of 3% and approaching $MSFT’s 30%.\n\nOne last missing piece of information, which I haven’t seen mentioned by the Tesla bulls or in your message to me is how much capital will be required to grow sales from 500k units to 29m over the next 5 years?  It looks like over the history of [$TSLA](https://twitter.com/search?q=%24TSLA&src=cashtag_click) the company has raised $26.5B in equity capital (including the recent $5B) and $16.5B in debt and preferred equity, so a total of $43B. Tesla has a cumulative loss of $5.7B, so it hasn’t produced a positive return on capital.\n\nFor its last 4 quarters GAAP profits totaled $5.56B, which yields a 2.5% return on capital (equity net of retained losses plus debt minus cash, all adjusted for the recent $5B sale). I fully understand companies can surely lose money or earn little profit as they scale.  With the recent sale of $5B Tesla now has \\~$20B in cash. Is this sufficient to finance its growth over the next 5 years as the company grows units by 102% per year?\n\nSince I don’t lean on brevity and given my lack of understanding of basic investment theory, let’s summarize the missing data points necessary to get the stock to your target of $1,200 per share, 50 times your 2025 EPS target of $24 per share. Needed: 1) Tesla unit sales in 2025? 2) Average selling price per unit? 3) Any non-auto related sales – insurance, robotaxi, insurance, energy sales? 4) Shares outstanding? 5) Total capital: Additional paid in capital, debt, preferred equity, cash?\n\nAt your 50x $24 EPS $1,200  price target, [$TSLA](https://twitter.com/search?q=%24TSLA&src=cashtag_click) returns 11.2% pa from Thursday’s $705.67 close. I happen to think shares in [$BRK](https://twitter.com/search?q=%24BRK&src=cashtag_click), my largest holding, are likely to compound at roughly that rate, assuming a 10% ROE and a terminal price at 1.3x book value, up from \\~1.2x today.", "author_fullname": "t2_8oukh8l1", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Laying out the Tesla bear case, a summary", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_kpbe24", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.63, "author_flair_background_color": null, "subreddit_type": "public", "ups": 5, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 5, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": 1609642706.0, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609668904.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>Before diving in, a few housekeeping items:</p>\n\n<ol>\n<li><strong>I didn&#39;t write this.</strong> Everything below has been copied and pasted from <a href=\"https://twitter.com/ChrisBloomstran/status/1345155266468306944\">Chris Bloomstran</a>&#39;s Twitter feed, which has trended for the past day. All I&#39;ve added are a few edits for brevity. If you have a Twitter account, definitely give him a follow. I&#39;m posting this here because I know not all of us are active on Twitter, and some might appreciate the read.</li>\n<li>&quot;<strong>OP is a gay bear.&quot;</strong> Full disclaimer, I neither own puts nor am short Tesla (although I&#39;m definitely considering it). In fact, I think Tesla is a fantastic company; if they were cheaper I would almost definitely be long. I&#39;m posting this because, beneath all of the memes and shitposting, I know that all of us want to make money. Every little bit of information/analysis helps, even if we disagree with the end-conclusion.</li>\n<li><strong>&quot;Post is too long. Ban.&quot;</strong> This post isn&#39;t meant for you, please move along. I know it&#39;s wordy and there aren&#39;t any pictures, but this is meant for those in this sub who enjoy a bit of reading/research. If you aren&#39;t interested in a bit of reading, please scroll past.</li>\n<li><strong>If you YOLO $TSLA puts because of this post, you deserve to lose your money.</strong></li>\n</ol>\n\n<p>________</p>\n\n<p><strong>A single prediction for the New Year.</strong></p>\n\n<p>Those unfamiliar with the Federal Reserve Board’s Regulation T will hear lots about it during 2021. The rule limits the percentage of an investment in equity securities that can be borrowed with a margin loan. A wake-up call is scheduled...</p>\n\n<p>It was widely reported this week that total margin debt reached a new high of $722B. The WSJ’s 12/28 lead Business and Finance story profiled a $TSLA retail investor, a civil engineer, who had parlayed a $23k option investment in $TSLA into a $2m position. Oh boy. The gentleman is to surely and genuinely be commended for the investment. An 87x gain in a short period is extraordinary (I&#39;ve never done that, nor will I). That said, a quick perusal of $TSLA twitter commentary and recommendations is terrifying.</p>\n\n<p>One can read the Journal article, <a href=\"https://www.wsj.com/articles/investors-double-down-on-stocks-pushing-margin-debt-to-record-11609077600\">Investors Double Down on Stocks, Pushing Margin Debt to Record TSLA</a>, and draw two conclusions. One, “This must be extremely dangerous,” or two, “Surely I can get rich quick too.” Human nature being what it is… For the latter, the civil engineer offers this advice on his Twitter page, “If you have no Tesla call options, you may want to do the math and consider using LEAPS as a way to accelerate your accumulation of Tesla stock. 40X in 2020. Another 50X by 2025.” Whoa.</p>\n\n<p><em>A</em> series of Q&amp;A tweets ensues (thanks for the heads up <a href=\"https://twitter.com/romanrubinstein?lang=en\">@RomanRubinstein</a>) on which broker/dealers offer the most margin, the lowest interest rate on margin debt, and how to borrow the most money and obtain the maximum leverage by purchasing call options. “Maintain margin value of 50% in my portfolio and the margin borrowing rides forever,” goes the advice. Please consider the danger of heeding this advice. The engineer should risk-off and live a happy life.</p>\n\n<p>A whole bunch of people are going to lose a whole bunch of money.</p>\n\n<p>Reading through a series of tweets among the Tesla (and others) option crowd, you see little, if any, mention of maintenance margin requirements. FINRA requires investors, strike that, speculators, to maintain equity of at least 25% of the value of an account. Leverage kills. Maintenance rates can be set above the minimum threshold. The concept of posting shares in stocks like $TSLA, $TWTR, or any established company trading for 20x or 30x sales &amp; borrowing half of the value and then buying calls on the same shares posted as collateral is insanity. The only “math” a speculator should be doing is knowing at what price against the shares in the account will new equity be required. Most brokers don’t wait around for a customer to come up with new cash or securities to deposit. What do they do?</p>\n\n<p>They sell down your shares to get to equity compliance. More decline? More forced selling. Depending on maintenance margin thresholds, you can lose it all in a hurry. Red flags are abundant, beyond simply the new record high in total margin and credit market debt outstanding. You can see the bubble in the number of single-contract call options outstanding, in the number of new retail accounts being opened with margin and allowed option trading, and even in the tone of surety by speculators regarding prospects for wildly expensive shares like Tesla.</p>\n\n<p>I never thought I’d again see the kind of mania like we saw in the late 1990’s, but here we are. Memories of what can and is likely to happen are long gone. Even a number of professional investors have suspended price as a key determinant of value.  A respected and well-known retired professional investor suggested on Twitter recently that I don’t understand “$TSLA growth math or basic investment theory,” that “stocks look forward, not backward” and that “P/E’s are a function of exponential growth rates, not industry.”</p>\n\n<p>The last time an investment pro came unglued was January 2000 at a newspaper roundtable. The C.I.O/PM for one of the largest &amp; oldest growth &amp; income funds at the time took exception to the notion that $MSFT shareholders would lose money for the next 15 years, which they did. I’d written 6 pages on the prediction in my 1/1/2000 letter (on the website) and discussed it at the roundtable. My co-panelist became unhinged because he and his firm had 5% of capital in $MSFT, which was then a $620B market cap on $20B in sales, 31x sales &amp; 80x earnings.</p>\n\n<p>You can apply the same logic to $TSLA or to any number of dangerously overvalued fashionable disruptive growers today. The Tesla bull proffering margined purchase of $TSLA LEAPS expects a $1,000 share price this year, $5,000 the next and $22,000 by 2025.</p>\n\n<p>Now, a $22,000 stock price, assuming no further dilution above today’s 1.1B fully diluted shares outstanding, gets you to a $24 trillion market value, which must be reasonable given that the entire market value of the S&amp;P 500 today is only ~$31 trillion &amp; global GDP is $88T. When your TAM (the new eyeballs) is 100% global auto market share, robotaxi, energy grid, insurance and economic population of Mars, no price is too high. No argument that Tesla has made great strides in manufacturing efficiency and are now producing a more reliable product.</p>\n\n<p>I also believe disruption of the auto industry will require an enormous amount of capital to grow and the established OEM’s won’t play dead. You can&#39;t simply separate auto margins and capital requirements from nearly infinite profitability earned by selling software upgrades. Shouldn’t the upgrades be considered part of total vehicle cost? To what extent did the Apples and Microsofts of the world thrive on a regular upgrade cycle, much of which was and is planned. How often are you compelled into a new iPhone or iPad? Prior to the subscription model, at what point did Microsoft not support an older operating system or Office suite? Will EV buyers purchase a new car every 2-3 years? How much of the world can afford a more expensive vehicle than the current global average car price?</p>\n\n<p>Regardless of one&#39;s beliefs on business quality &amp; growth prospects, paying a too-high price can destroy future investment return. #neversell? When price becomes ridiculous to the most optimistic business case you #bettersell. Price matters and the current environment is nuts. The current folly for price not mattering, or being justifiably high, reminds me of a well known sell-side report on Berkshire Hathaway in 1998 which assumed as undervalued both $BRK’s shares and its stock portfolio against an assumed “reasonable” 40x market multiple.</p>\n\n<p>Berkshire’s shares, expensive, would fall by half over the next 18 months to a February 2000 low. It’s become fashionable to explain investment process by saying price is the last consideration. Too often lately, price isn’t even a consideration, especially for holy growers. While I did not have a short position on $MSFT in 2000, I do have a very small recent short on Tesla today so take my comments w/ a grain of salt. I did buy $MSFT in &#39;06 after it fell by ~75% and owned it for a decade, trimming when dear and adding to the position when cheap.</p>\n\n<p><em>S</em>hort selling is very risky and those w/ sizable short positions on Tesla at the outset of 2020 would have suffered real damage given the 720% advance during the year. I&#39;ve read that shorts lost $38B during &#39;20 alone on their collective positions &amp; short interest is way down. I happen to think the valuation is now so large to protect against a continued runaway price, particularly now that <a href=\"/u/elonmusk\">u/elonmusk</a> secured its entry in the S&amp;P 500 by engineering 4 quarters of profits by cutting R&amp;D, SG&amp;A and thanks to environmental credits courtesy $GM &amp; $FCA.</p>\n\n<p>Still, I’d never employ a large short position given unlimited downside and a max return of 100%. Margin is required against short positions. What appears to be a growing army of retail option traders, many employing sizable margin debt, is a recipe for disaster. Price and quality conscious investors get uncomfortable at times like these. I am extremely uncomfortable. I hope those that have no idea what they are doing heed growing and now very high risk and fully understand downside and what margin calls and maintenance margin mean.</p>\n\n<p>Many, many speculators will lose much and even all of their money at some point as this bubble breaks. Now is the time to reduce risk. You could feel badly for employees that were paid in non-qualified stock options and kept their shares upon exercise in the late 1990’s. When shares plummeted in the wake of the tech bubble the tax liability due on gain realized as income upon exercise was still due and payable, despite shares that were way below the exercise price. It was bad. Many lost everything but weren’t in a position to understand risk.</p>\n\n<p>Borrowing against Tesla (or any) shares and buying call options presents serious deliberately assumed risk. For perspective, a 92% decline takes the shares back to where they started 2020! With margin, it will take way less than a 92% decline to introduce wipeout.</p>\n\n<p>________</p>\n\n<p><strong><em>Responding to the PM who claims that the $TSLA price target of $1,200, total EV adoption of 20%, and 5% market share in global auto-manufacturing is reasonable, Bloomstran had this to say:</em></strong></p>\n\n<p>You have EV adoption rising from 3% to 20% in five years, a 6x increase (46% CAGR) and Tesla market share at 25%. 2019 global new vehicle sales totaled ~95m units and will be way lower this year. Let&#39;s call 2020 a throwaway for the industry, and hats off to <a href=\"https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click\">$TSLA</a> for growing. From the 2019 base, if we assume 4% market growth then new global units in 2025 would be 115m and at your expected 20% share Tesla would sell 29 million vehicles. Is this your assumption? Sounds aggressive given Tesla’s 500k unit run rate for 2020 and 1/2% market share.</p>\n\n<p>Now, US new vehicle prices are $38k but significantly lower worldwide, let’s say $30k per vehicle sold globally. The average Tesla looks to range from high $30k’s for the Model 3 to $55k for the Model 3 Performance to $125k for the Model X Performance fully loaded.  What do you expect for an average selling price for Tesla in 2025? I’d presume that as market share expands ASP’s will have to fall to affordable. I’m trying to get to a revenue number.</p>\n\n<p>Perhaps the governments of the world will be giving $2k per person, $8k per family of 4 in annual perpetuity, surely making new cars more affordable! If Tesla sells 29m units in 2025 @ $34.5k per unit, that gets sales to $1 trillion, a CAGR of ~102% for five years. Reasonable?</p>\n\n<p>Moving on, you have a 2025 EPS target of $24/share. On how many shares shall we apply your expected per-share figure? Shares outstanding at 9/30 totaled 948m, up from 905m at yearend 2019. An additional $5B in shares were sold recently to the public in “at-the-market” sales.  The sales were done with no roadshow, risk disclosure or prospectus, unless Goldman’s report upgrading the shares from neutral to buy &amp; a new price target of $780, up from $455, issued days before the announced sale and Goldman’s retention as selling agent, as a “prospectus.&quot;</p>\n\n<p>If the shares were sold at an average of ~$600/share, the share count would now be 8.3m shares higher, so call the total 956m. You have a price target of $1,200 for the shares, so let’s not forget to include in the count any option and RSU shares issued but not yet exercised.  Recall, <a href=\"https://twitter.com/elonmusk\"><em>@elonmusk</em></a> was granted 20m option shares (now 100m thanks to the split) in 2018 by <a href=\"https://twitter.com/larryellison\"><em>@larryellison</em></a> and Elon’s associates on the board. Fully diluted shares total 1.113B right now, and if the stock keeps rising we can assume all options will be exercised and outstanding.</p>\n\n<p>So, how many shares should we apply to your $24 EPS target? If we assume zero further dilution (realistic?), then using the 1.113B fully diluted shares including the recent $5b sale, we get to $26.7B in net income. On an even $1 trillion in revenues, that’s a 2.67% profit margin, just a bit higher than the auto industry average of 3% and approaching $MSFT’s 30%.</p>\n\n<p>One last missing piece of information, which I haven’t seen mentioned by the Tesla bulls or in your message to me is how much capital will be required to grow sales from 500k units to 29m over the next 5 years?  It looks like over the history of <a href=\"https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click\">$TSLA</a> the company has raised $26.5B in equity capital (including the recent $5B) and $16.5B in debt and preferred equity, so a total of $43B. Tesla has a cumulative loss of $5.7B, so it hasn’t produced a positive return on capital.</p>\n\n<p>For its last 4 quarters GAAP profits totaled $5.56B, which yields a 2.5% return on capital (equity net of retained losses plus debt minus cash, all adjusted for the recent $5B sale). I fully understand companies can surely lose money or earn little profit as they scale.  With the recent sale of $5B Tesla now has ~$20B in cash. Is this sufficient to finance its growth over the next 5 years as the company grows units by 102% per year?</p>\n\n<p>Since I don’t lean on brevity and given my lack of understanding of basic investment theory, let’s summarize the missing data points necessary to get the stock to your target of $1,200 per share, 50 times your 2025 EPS target of $24 per share. Needed: 1) Tesla unit sales in 2025? 2) Average selling price per unit? 3) Any non-auto related sales – insurance, robotaxi, insurance, energy sales? 4) Shares outstanding? 5) Total capital: Additional paid in capital, debt, preferred equity, cash?</p>\n\n<p>At your 50x $24 EPS $1,200  price target, <a href=\"https://twitter.com/search?q=%24TSLA&amp;src=cashtag_click\">$TSLA</a> returns 11.2% pa from Thursday’s $705.67 close. I happen to think shares in <a href=\"https://twitter.com/search?q=%24BRK&amp;src=cashtag_click\">$BRK</a>, my largest holding, are likely to compound at roughly that rate, assuming a 10% ROE and a terminal price at 1.3x book value, up from ~1.2x today.</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/O0gdfOzPGHcnP6wuehLdiC-gHcvH-LeCg7u9i1fv2O8.jpg?auto=webp&s=a7fd14ac7f9e189ad044731fd720b9b7ace34554", "width": 140, "height": 140}, "resolutions": [{"url": "https://external-preview.redd.it/O0gdfOzPGHcnP6wuehLdiC-gHcvH-LeCg7u9i1fv2O8.jpg?width=108&crop=smart&auto=webp&s=d8687090bc68033edb211e30994ed74c567561cc", "width": 108, "height": 108}], "variants": {}, "id": "E83aKBI-RrVXOhzipbaPlwifMHUiMnZg__E518p3O0I"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "kpbe24", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "InstagramStockTrader", "fullname": "t2_8oukh8l1"}, "discussion_type": null, "num_comments": 20, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/", "subreddit_subscribers": 1761849, "created_utc": 1609640104.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kpbe24", "author_flair_template_id": "28fbe25a-7c59-11ea-965e-0e0a65cd3f97", "likes": null, "user_reports": [], "saved": false, "id": "ghw22pn", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kpbe24", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kpbe24&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kpbe24&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=kpbe24)\n___\n ^comment ^will ^disappear ^--- ^72 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1609642924.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":zjz_flair:", "u": "https://emoji.redditmedia.com/b30pkj66das41_t5_2th52/zjz_flair", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=kpbe24&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=kpbe24&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=kpbe24\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>72</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/ghw22pn/", "num_reports": null, "locked": false, "name": "t1_ghw22pn", "created": 1609669371.0, "author_flair_text": ":zjz_flair: Robot Janitor", "treatment_tags": [], "created_utc": 1609640571.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#373c3f", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 8, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kpbe24", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghw21pk", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Gaybearputs69", "fullname": "t2_6dhovnit"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kpbe24", "score": 8, "author_fullname": "t2_6dhovnit", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I didn't read this post. But I agree.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I didn&#39;t read this post. But I agree.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/ghw21pk/", "num_reports": null, "locked": false, "name": "t1_ghw21pk", "created": 1609669356.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609640556.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kpbe24", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghw2b9m", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "sykotikqp", "fullname": "t2_6q0iy2il"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kpbe24", "score": 5, "author_fullname": "t2_6q0iy2il", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Brosky this reminds me of the LB/MJ debate. Call me when tesla competitors have gigafactories. ITS THE ONLY ARGUMENT I NEED, SHAWN.  jk. I dont know.  Puts on your mom.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Brosky this reminds me of the LB/MJ debate. Call me when tesla competitors have gigafactories. ITS THE ONLY ARGUMENT I NEED, SHAWN.  jk. I dont know.  Puts on your mom.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/ghw2b9m/", "num_reports": null, "locked": false, "name": "t1_ghw2b9m", "created": 1609669507.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609640707.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kpbe24", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghw4dgh", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "KeenStudent", "fullname": "t2_14jzeu"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ghw2b9m", "score": 3, "author_fullname": "t2_14jzeu", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "VW's biggest plant is 9x that of giga shanghai and it doesn't have giga in its name.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>VW&#39;s biggest plant is 9x that of giga shanghai and it doesn&#39;t have giga in its name.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/ghw4dgh/", "num_reports": null, "locked": false, "name": "t1_ghw4dgh", "created": 1609670683.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609641883.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kpbe24", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ghw5xm6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "sadpeniss", "fullname": "t2_p2vxm"}, "can_mod_post": false, "created_utc": 1609642794.0, "send_replies": true, "parent_id": "t1_ghw4dgh", "score": 1, "author_fullname": "t2_p2vxm", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "9x bigger doesnt matter if your plant is 10x more efficient", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>9x bigger doesnt matter if your plant is 10x more efficient</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kpbe24/laying_out_the_tesla_bear_case_a_summary/ghw5xm6/", "num_reports": null, "locked": false, "name": "t1_ghw5xm6", "created": 1609671594.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}