{"approved_at_utc": null, "selftext": "**Disney lays out the plans for the future, the FDA advisory panel gives their OK. What’s my price target and should you buy DoorDash and AirBnB? Let’s talk about this and everything about the stock market**\n\nHey everyone and Good morning! So let’s start with the recap of yesterday as we only saw the [NASDAQ COMPOSITE](https://ibb.co/1RgJRtS) gaining some ground, up more than half a % while the [SP500](https://ibb.co/vQY7s6C) finished .13% down and the [Dow Industrial](https://ibb.co/BcgtnC2) fell just below 30k, losing .23% for the day. All 3 indexes traded way lower in the beginning of the day after the jobless claims came in, but recovered once the FDA Advisory panel meeting started. We also saw the [VIX](https://ibb.co/SwcQnHs) finish higher for the day after it opened at over 23 to start us off.\n\nAlmost 60% of the companies were advancing [yesterday](https://ibb.co/qdWy3jk), but the volume was way below average for most of them, with the Energy sector being the only significant gainer, up 3% for the day while most of the [sectors](https://ibb.co/5xskzgj) were flat or even lost ground for the day. On a factor [basis](https://ibb.co/Z28KH04), only large-cap value companies from the industrial sector suffered big yesterday, as small cap growth companies outperformed.\n\nYou can see in this [HEAT MAP](https://ibb.co/y0jvPBX), that big caps, with the exception of Apple and Tesla did struggle yesterday, while most of the companies with big gains were from the oil & gas industry, with Chevron gaining more than 3% for the day, while Exxon, Total and BP also had big gains.\n\nThe numbers that came in [yesterday](https://ibb.co/MPxZS56) on the economic front where mixed. As initial and continuing jobless claims came in [worse](https://ibb.co/NmgdXbJ) than expected, as more than 850K people filed for initial claims up more than 125K since the last week and what the analysts [expected](https://ibb.co/KrGcRk7), as this was the biggest spike in initial claims since march, while the continuing claims also rose for the first time since September. I am wondering, will [this](https://ibb.co/0X6FCH5) finally push the congress to act on a relief bill? I think the economy really needs it as a bridge to better times. Just look at the [EU](https://ibb.co/ncSgyWd), they have finally agreed on $2.2T budget and stimulus package to help the Eurozone get through the difficult times.\n\nBetter numbers came in from the consumer price [index](https://ibb.co/NjLW663), as the index rose by .2%, after it was unchanged in October, but this should be taken with a grain of salt, as most of consumer confidence increase comes from the high-income [consumers](https://ibb.co/DVJ5nK9), while people who have an income under $50K still struggling.\n\nAlso, the Federal [Budget](https://ibb.co/8BFdyZ7) came in better than expected as the deficit shrank more in November compared to October and compared to last year’s month.\n\n[Today](https://ibb.co/pP78rTs) is a slow day in terms of economic data, but we do get a final read on the Producer price index and the consumer sentiment index.\n\nWe also finally got the [FDA](https://ibb.co/9gLsrh6) panel of outside experts meeting yesterday, which saw the panel vote 17 FOR, 4 against and one abstain. The only small concerns were on the topic of 16 and 17-year old’s as some experts argued that there is insufficient data on that subgroup, but I don’t think that is a case for concern, as the vaccine is likely going to take a while until young people will start to get the shot, as they are one of the least impacted groups. This is great news, as the FDA does usually follow up this committee advice, so we can see the FDA Emergency use authorization very very soon. Vaccine doses are already ready go within 24hours of the authorization so, things will start to move rather fast after that.\n\nSo, we got some earnings numbers yesterday from a lot of companies, let’s talk about them a little.\n\n[COSTCO](https://ibb.co/C040BWf) posted a beat on the top and bottom line with e-commerce sales rising by more than 80%, while [comparable](https://ibb.co/YQQknbj) sales in stores were more than 17%. With both EPS and revenue beating the estimates, I think this might be the time to get into COSTCO, as they are one of the best retailers in the world, they always trade at a premium, the [stock](https://ibb.co/QnQNJGJ) is just about 5% from the all-time high and is far from overbought territory. I really like them as they have also rewarded shareholders constantly both with great growth and dividends.\n\n[Broadcom](https://ibb.co/St74KMD) also posted a great beat on EPS and an 11% increase in revenues, fueled by a great beat in the semiconductor segment, while also posting a free cash flow of over $3B, way better than expected, as they also increased the quarterly dividend by 11% and have made a lot of [senior](https://ibb.co/hcMS6Vs) leadership changes yesterday, but the [stock](https://ibb.co/TB97nhZ) is down more than 2% in pre-market trading despite a lot of great numbers.\n\nThe company has most of its [revenues](https://ibb.co/bLbzgKL) coming from semiconductor solutions, this is very good as the [global](https://ibb.co/GfZGfnz) semiconductor sales have increased more than 5% in FY2020 and are expected to increase more than 8% for FY 2021, way better than the previous [outlook](https://ibb.co/MSrLh0p) of 6,2%.\n\nThe company also posted all time [highs](https://ibb.co/1vM8WP0) in net revenue, free cash flows, gross margin and adjusted EBITDA, while the compound annual [growth](https://ibb.co/zRW1jLZ) of the dividend since FY2016 is almost 50%. I think I might be investing even more in this company especially if they have a pullback.\n\nNext let’s go to Lululemon who also [posted](https://ibb.co/qF1NnnN) a beat on EPS and Revenues, while comparable sales were up 19% with better gross and operating margins than expected. This was led by a huge [rise](https://ibb.co/zfKRJX5) in the international markets which will continue to expand as they gain more recognition overseas.\n\nA smaller company that [reported](https://ibb.co/2WMrybz) yesterday was Dave & Buster’s as the losses were smaller than expected as comparable store sales declined by 66% as the restrictions in the restaurant industry keeps hammering away. The stock was trading +4% in after hours as investors may have though of an even worse result.\n\nMoving on, [Adobe](https://ibb.co/Vjwwprm) also released earnings before the market opened yesterday, after a delayed earnings release. They posted a great beat on EPS and the revenues while also giving great guidance for next year, way above the consensus, with more than $15B in revenues and a EPS of over $11. The company also announced a new $15B share buyback [program](https://ibb.co/cKBbMpF) which will increase the value of the stock through the next 4 years while also have a strong [growth](https://ibb.co/G7BySxH) path, and despite all of this the stock [lost](https://ibb.co/Bnkk60T) more than 1,4% for the day.\n\nThe other earnings report that was released yesterday was from [Oracle](https://ibb.co/KsSGZNW), they also posted a great beat on the top and bottom line, but didn’t offer any guidance as that kind of disappointed investors and dipped about 1% in after hours. I don’t really have a great grasp of the company’s growth potential is right now.\n\nWe also got the Disney Investors meeting, in which the company share a lot of new great things. First of all, [Disney+](https://ibb.co/kJRc01G) has gone up another 18% since just 4 weeks ago, and is up to more than 86M subscribers, with the total number for the company’s streaming services surpassing 137M as they plan to expand Disney+ in Eastern Europe, South Korea, Hong Kong and other markets next year.\n\nThe company also [expects](https://ibb.co/4skfTC8) to have more than 230M subscribers by 2024, a very big increase from the prior estimate, while they are also planning on raising the monthly fee starting in March.\n\nThey plan to [release](https://ibb.co/F0G0C84) a lot of new content directly to Disney+, which is another big hit to the cinema world. With the Marvel and Star Wars series being big blockbusters for the movie industry.\n\nThey presented so much new [content](https://ibb.co/8jpZtWN) for the company, that it took them more than 2 hours to talk about all of this.\n\nBut they also [said](https://ibb.co/DWwJ1tg) that these decisions are temporary, and that they still prefer theatrical releases especially for blockbusters, so, there is still some hope for cinema’s, but maybe not just right now, it will take years to recover from this, and they will probably have to largely reduce the number of screens so that they may become profitable again.\n\nSo, over 100 new content releases per year is a lot for the [company](https://ibb.co/fFD4vhs), this was a very good investors meeting that pleased investors, as the company is [trading](https://ibb.co/Y86n6HD) \\+7,5% in pre-market.\n\nDisney is my second biggest position in my portfolio and I am really happy with what the company presented today. I think this stock may get to 200$ easily when the parks and entertainment business goes back online, as that accounted for 1/3 of the revenues before this year.\n\nIn other stock market [news](https://ibb.co/NL6sXcT), NIO will offer 60M shares, with an additional 9M shares option for underwriters. The stock fell sharply after the news, dropping more than 6% in After-hours [trading](https://ibb.co/85PycWh).\n\nAlso, Qualcomm suffered after the close yesterday, as the shares fell more than 5% after [news](https://ibb.co/5h4syVT) popped that Apple is moving to a develop their first cellular modem which will replace the Qualcomm modem in iPhone. The shares dropped as Qualcomm gets about 11% of its revenue from Apple.\n\nSo, one last thing that I want to talk about is the recent IPOs from DoorDash and AirBnb.\n\nAirBNB also went public yesterday and [started](https://ibb.co/PCNjM3W) trading at $146, way above the $68 IPO price. This means the company has a [market cap](https://ibb.co/QNmGhqy) of over $100B, way higher than its rival Booking at $86B market cap and even [higher](https://ibb.co/cyp2hz1) than some of the biggest hotels in the world, Marriot & Hilton. The [stock](https://ibb.co/C9P3McG) even hit a new high of $165, I believe this happened as brokers started to get hands on the shares and orders started to fill in, but the stock did go back down to finish at $144, that means the stock gained more than 112% just in one day. The stock is down again more than 2% in pre-market guys.\n\nI would avoid these stocks as much as I can as I believe they are well overhyped at the moment. I think we can see a pullback that may offer a better opportunity in AirBnb after the first earnings results. I would buy this company only if it drops to around 80$ as a price target, if not I maintain my sell opinion on the stock, though I personally, am not shorting any stock due to the risk of the high volatility associated with this companies as they have a very small share float.\n\nWhile my opinion on [DoorDash](https://ibb.co/qkqSz1t) is that we might not see a pullback or correction as soon as AirBnb as demand will probably continue to be strong for at least a couple of quarters, before the growth slows down as well as very though future comps. We might see a drop in price then, as I think this stock is also well overvalued. I also maintain my sell opinion on this stock and just like with AirBNB, I am not going to touch this stock, I think a reasonable PT for DoorDash as a sell is about 100$. But I would try to stay away as much as possible, I’d rather go and find better growth opportunities in other companies, and not waste time and money on these 2 stocks.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Disney STOCK NEWS | DoorDash & AirBnB Price Target | STOCK EARNNINGS & MARKET NEWS [12-11]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_kb3jlh", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 1.0, "author_flair_background_color": null, "subreddit_type": "public", "ups": 5, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 5, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1607724882.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Disney lays out the plans for the future, the FDA advisory panel gives their OK. What’s my price target and should you buy DoorDash and AirBnB? Let’s talk about this and everything about the stock market</strong></p>\n\n<p>Hey everyone and Good morning! So let’s start with the recap of yesterday as we only saw the <a href=\"https://ibb.co/1RgJRtS\">NASDAQ COMPOSITE</a> gaining some ground, up more than half a % while the <a href=\"https://ibb.co/vQY7s6C\">SP500</a> finished .13% down and the <a href=\"https://ibb.co/BcgtnC2\">Dow Industrial</a> fell just below 30k, losing .23% for the day. All 3 indexes traded way lower in the beginning of the day after the jobless claims came in, but recovered once the FDA Advisory panel meeting started. We also saw the <a href=\"https://ibb.co/SwcQnHs\">VIX</a> finish higher for the day after it opened at over 23 to start us off.</p>\n\n<p>Almost 60% of the companies were advancing <a href=\"https://ibb.co/qdWy3jk\">yesterday</a>, but the volume was way below average for most of them, with the Energy sector being the only significant gainer, up 3% for the day while most of the <a href=\"https://ibb.co/5xskzgj\">sectors</a> were flat or even lost ground for the day. On a factor <a href=\"https://ibb.co/Z28KH04\">basis</a>, only large-cap value companies from the industrial sector suffered big yesterday, as small cap growth companies outperformed.</p>\n\n<p>You can see in this <a href=\"https://ibb.co/y0jvPBX\">HEAT MAP</a>, that big caps, with the exception of Apple and Tesla did struggle yesterday, while most of the companies with big gains were from the oil &amp; gas industry, with Chevron gaining more than 3% for the day, while Exxon, Total and BP also had big gains.</p>\n\n<p>The numbers that came in <a href=\"https://ibb.co/MPxZS56\">yesterday</a> on the economic front where mixed. As initial and continuing jobless claims came in <a href=\"https://ibb.co/NmgdXbJ\">worse</a> than expected, as more than 850K people filed for initial claims up more than 125K since the last week and what the analysts <a href=\"https://ibb.co/KrGcRk7\">expected</a>, as this was the biggest spike in initial claims since march, while the continuing claims also rose for the first time since September. I am wondering, will <a href=\"https://ibb.co/0X6FCH5\">this</a> finally push the congress to act on a relief bill? I think the economy really needs it as a bridge to better times. Just look at the <a href=\"https://ibb.co/ncSgyWd\">EU</a>, they have finally agreed on $2.2T budget and stimulus package to help the Eurozone get through the difficult times.</p>\n\n<p>Better numbers came in from the consumer price <a href=\"https://ibb.co/NjLW663\">index</a>, as the index rose by .2%, after it was unchanged in October, but this should be taken with a grain of salt, as most of consumer confidence increase comes from the high-income <a href=\"https://ibb.co/DVJ5nK9\">consumers</a>, while people who have an income under $50K still struggling.</p>\n\n<p>Also, the Federal <a href=\"https://ibb.co/8BFdyZ7\">Budget</a> came in better than expected as the deficit shrank more in November compared to October and compared to last year’s month.</p>\n\n<p><a href=\"https://ibb.co/pP78rTs\">Today</a> is a slow day in terms of economic data, but we do get a final read on the Producer price index and the consumer sentiment index.</p>\n\n<p>We also finally got the <a href=\"https://ibb.co/9gLsrh6\">FDA</a> panel of outside experts meeting yesterday, which saw the panel vote 17 FOR, 4 against and one abstain. The only small concerns were on the topic of 16 and 17-year old’s as some experts argued that there is insufficient data on that subgroup, but I don’t think that is a case for concern, as the vaccine is likely going to take a while until young people will start to get the shot, as they are one of the least impacted groups. This is great news, as the FDA does usually follow up this committee advice, so we can see the FDA Emergency use authorization very very soon. Vaccine doses are already ready go within 24hours of the authorization so, things will start to move rather fast after that.</p>\n\n<p>So, we got some earnings numbers yesterday from a lot of companies, let’s talk about them a little.</p>\n\n<p><a href=\"https://ibb.co/C040BWf\">COSTCO</a> posted a beat on the top and bottom line with e-commerce sales rising by more than 80%, while <a href=\"https://ibb.co/YQQknbj\">comparable</a> sales in stores were more than 17%. With both EPS and revenue beating the estimates, I think this might be the time to get into COSTCO, as they are one of the best retailers in the world, they always trade at a premium, the <a href=\"https://ibb.co/QnQNJGJ\">stock</a> is just about 5% from the all-time high and is far from overbought territory. I really like them as they have also rewarded shareholders constantly both with great growth and dividends.</p>\n\n<p><a href=\"https://ibb.co/St74KMD\">Broadcom</a> also posted a great beat on EPS and an 11% increase in revenues, fueled by a great beat in the semiconductor segment, while also posting a free cash flow of over $3B, way better than expected, as they also increased the quarterly dividend by 11% and have made a lot of <a href=\"https://ibb.co/hcMS6Vs\">senior</a> leadership changes yesterday, but the <a href=\"https://ibb.co/TB97nhZ\">stock</a> is down more than 2% in pre-market trading despite a lot of great numbers.</p>\n\n<p>The company has most of its <a href=\"https://ibb.co/bLbzgKL\">revenues</a> coming from semiconductor solutions, this is very good as the <a href=\"https://ibb.co/GfZGfnz\">global</a> semiconductor sales have increased more than 5% in FY2020 and are expected to increase more than 8% for FY 2021, way better than the previous <a href=\"https://ibb.co/MSrLh0p\">outlook</a> of 6,2%.</p>\n\n<p>The company also posted all time <a href=\"https://ibb.co/1vM8WP0\">highs</a> in net revenue, free cash flows, gross margin and adjusted EBITDA, while the compound annual <a href=\"https://ibb.co/zRW1jLZ\">growth</a> of the dividend since FY2016 is almost 50%. I think I might be investing even more in this company especially if they have a pullback.</p>\n\n<p>Next let’s go to Lululemon who also <a href=\"https://ibb.co/qF1NnnN\">posted</a> a beat on EPS and Revenues, while comparable sales were up 19% with better gross and operating margins than expected. This was led by a huge <a href=\"https://ibb.co/zfKRJX5\">rise</a> in the international markets which will continue to expand as they gain more recognition overseas.</p>\n\n<p>A smaller company that <a href=\"https://ibb.co/2WMrybz\">reported</a> yesterday was Dave &amp; Buster’s as the losses were smaller than expected as comparable store sales declined by 66% as the restrictions in the restaurant industry keeps hammering away. The stock was trading +4% in after hours as investors may have though of an even worse result.</p>\n\n<p>Moving on, <a href=\"https://ibb.co/Vjwwprm\">Adobe</a> also released earnings before the market opened yesterday, after a delayed earnings release. They posted a great beat on EPS and the revenues while also giving great guidance for next year, way above the consensus, with more than $15B in revenues and a EPS of over $11. The company also announced a new $15B share buyback <a href=\"https://ibb.co/cKBbMpF\">program</a> which will increase the value of the stock through the next 4 years while also have a strong <a href=\"https://ibb.co/G7BySxH\">growth</a> path, and despite all of this the stock <a href=\"https://ibb.co/Bnkk60T\">lost</a> more than 1,4% for the day.</p>\n\n<p>The other earnings report that was released yesterday was from <a href=\"https://ibb.co/KsSGZNW\">Oracle</a>, they also posted a great beat on the top and bottom line, but didn’t offer any guidance as that kind of disappointed investors and dipped about 1% in after hours. I don’t really have a great grasp of the company’s growth potential is right now.</p>\n\n<p>We also got the Disney Investors meeting, in which the company share a lot of new great things. First of all, <a href=\"https://ibb.co/kJRc01G\">Disney+</a> has gone up another 18% since just 4 weeks ago, and is up to more than 86M subscribers, with the total number for the company’s streaming services surpassing 137M as they plan to expand Disney+ in Eastern Europe, South Korea, Hong Kong and other markets next year.</p>\n\n<p>The company also <a href=\"https://ibb.co/4skfTC8\">expects</a> to have more than 230M subscribers by 2024, a very big increase from the prior estimate, while they are also planning on raising the monthly fee starting in March.</p>\n\n<p>They plan to <a href=\"https://ibb.co/F0G0C84\">release</a> a lot of new content directly to Disney+, which is another big hit to the cinema world. With the Marvel and Star Wars series being big blockbusters for the movie industry.</p>\n\n<p>They presented so much new <a href=\"https://ibb.co/8jpZtWN\">content</a> for the company, that it took them more than 2 hours to talk about all of this.</p>\n\n<p>But they also <a href=\"https://ibb.co/DWwJ1tg\">said</a> that these decisions are temporary, and that they still prefer theatrical releases especially for blockbusters, so, there is still some hope for cinema’s, but maybe not just right now, it will take years to recover from this, and they will probably have to largely reduce the number of screens so that they may become profitable again.</p>\n\n<p>So, over 100 new content releases per year is a lot for the <a href=\"https://ibb.co/fFD4vhs\">company</a>, this was a very good investors meeting that pleased investors, as the company is <a href=\"https://ibb.co/Y86n6HD\">trading</a> +7,5% in pre-market.</p>\n\n<p>Disney is my second biggest position in my portfolio and I am really happy with what the company presented today. I think this stock may get to 200$ easily when the parks and entertainment business goes back online, as that accounted for 1/3 of the revenues before this year.</p>\n\n<p>In other stock market <a href=\"https://ibb.co/NL6sXcT\">news</a>, NIO will offer 60M shares, with an additional 9M shares option for underwriters. The stock fell sharply after the news, dropping more than 6% in After-hours <a href=\"https://ibb.co/85PycWh\">trading</a>.</p>\n\n<p>Also, Qualcomm suffered after the close yesterday, as the shares fell more than 5% after <a href=\"https://ibb.co/5h4syVT\">news</a> popped that Apple is moving to a develop their first cellular modem which will replace the Qualcomm modem in iPhone. The shares dropped as Qualcomm gets about 11% of its revenue from Apple.</p>\n\n<p>So, one last thing that I want to talk about is the recent IPOs from DoorDash and AirBnb.</p>\n\n<p>AirBNB also went public yesterday and <a href=\"https://ibb.co/PCNjM3W\">started</a> trading at $146, way above the $68 IPO price. This means the company has a <a href=\"https://ibb.co/QNmGhqy\">market cap</a> of over $100B, way higher than its rival Booking at $86B market cap and even <a href=\"https://ibb.co/cyp2hz1\">higher</a> than some of the biggest hotels in the world, Marriot &amp; Hilton. The <a href=\"https://ibb.co/C9P3McG\">stock</a> even hit a new high of $165, I believe this happened as brokers started to get hands on the shares and orders started to fill in, but the stock did go back down to finish at $144, that means the stock gained more than 112% just in one day. The stock is down again more than 2% in pre-market guys.</p>\n\n<p>I would avoid these stocks as much as I can as I believe they are well overhyped at the moment. I think we can see a pullback that may offer a better opportunity in AirBnb after the first earnings results. I would buy this company only if it drops to around 80$ as a price target, if not I maintain my sell opinion on the stock, though I personally, am not shorting any stock due to the risk of the high volatility associated with this companies as they have a very small share float.</p>\n\n<p>While my opinion on <a href=\"https://ibb.co/qkqSz1t\">DoorDash</a> is that we might not see a pullback or correction as soon as AirBnb as demand will probably continue to be strong for at least a couple of quarters, before the growth slows down as well as very though future comps. We might see a drop in price then, as I think this stock is also well overvalued. I also maintain my sell opinion on this stock and just like with AirBNB, I am not going to touch this stock, I think a reasonable PT for DoorDash as a sell is about 100$. But I would try to stay away as much as possible, I’d rather go and find better growth opportunities in other companies, and not waste time and money on these 2 stocks.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/bmh54pkHXxCyNOhnOmojO-wrkr6kbUOhfjiPA6S75xA.jpg?auto=webp&s=f3d0f60af7043fecc139bcae9d4a8f591b48401c", "width": 895, "height": 480}, "resolutions": [{"url": "https://external-preview.redd.it/bmh54pkHXxCyNOhnOmojO-wrkr6kbUOhfjiPA6S75xA.jpg?width=108&crop=smart&auto=webp&s=fd3d327c169a0799c6d9c131fe5378d35f22b9c5", "width": 108, "height": 57}, {"url": "https://external-preview.redd.it/bmh54pkHXxCyNOhnOmojO-wrkr6kbUOhfjiPA6S75xA.jpg?width=216&crop=smart&auto=webp&s=138cdaf6d579147ac5fb09bce7004383367bf597", "width": 216, "height": 115}, {"url": "https://external-preview.redd.it/bmh54pkHXxCyNOhnOmojO-wrkr6kbUOhfjiPA6S75xA.jpg?width=320&crop=smart&auto=webp&s=af5be8febb306e9e4594365bc00c8fa95bab98ee", "width": 320, "height": 171}, {"url": "https://external-preview.redd.it/bmh54pkHXxCyNOhnOmojO-wrkr6kbUOhfjiPA6S75xA.jpg?width=640&crop=smart&auto=webp&s=5385b2cab97842f5473a210d9dbb91fd2358bcdf", "width": 640, "height": 343}], "variants": {}, "id": "c3sa__m71ScVO7NEXHR5wvONE6UXuQ5WwXIJPYJbWO4"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kb3jlh", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 5, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kb3jlh/disney_stock_news_doordash_airbnb_price_target/", "parent_whitelist_status": "no_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kb3jlh/disney_stock_news_doordash_airbnb_price_target/", "subreddit_subscribers": 1689648, "created_utc": 1607696082.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kb3jlh", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "gfe5jww", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb3jlh", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (0)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kb3jlh&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=kb3jlh&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=kb3jlh)\n___\n ^comment ^will ^disappear ^--- ^44 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (0)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=kb3jlh&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=kb3jlh&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=kb3jlh\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>44</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/kb3jlh/disney_stock_news_doordash_airbnb_price_target/gfe5jww/", "num_reports": null, "locked": false, "name": "t1_gfe5jww", "created": 1607724896.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1607696096.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kb3jlh", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "gfe5j3q", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_kb3jlh", "score": 3, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb3jlh/disney_stock_news_doordash_airbnb_price_target/gfe5j3q/", "num_reports": null, "locked": false, "name": "t1_gfe5j3q", "created": 1607724883.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1607696083.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kb3jlh", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gfe5lmr", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kb3jlh", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "PS. Anyone know when shorting will be available?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": true, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>PS. Anyone know when shorting will be available?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kb3jlh/disney_stock_news_doordash_airbnb_price_target/gfe5lmr/", "num_reports": null, "locked": false, "name": "t1_gfe5lmr", "created": 1607724922.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1607696122.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}