{"approved_at_utc": null, "selftext": "**Tesla and NIO shares are jumping after good news, while NIKOLA tumbles after GM goes for a much smaller agreement, the stock market loses ground as investors take profits, let’s talk about this and much more about the stock market**\n\nHey everyone and Welcome! So, let’s start with the recap of yesterday as we saw the [NASDAQ COMPOSITE](https://ibb.co/2g68hFq) finish about flat for the day, the [SP500](https://ibb.co/cr8CXVz) finished about half a percent down for the day and the [DOW INDUSTRIAL](https://ibb.co/9tFCX3j) was the biggest losers down almost 1% thought all 3 of them were down even bigger intraday. So, both the SP and the DOW finished with record monthly gains, the SP finish up 10,9% for the month above the previous record of 10,2% exactly 40 years ago, while the DOW finished up 11,9% and topped the previous record from 1987 with the Nasdaq also having its best month since the middle of the dot-com boom in 2001. The [VIX](https://ibb.co/4g07SHm) also finished down more than 1% for the day though at one point it almost hit the 23 mark.\n\nAlmost 70% of companies were declining yesterday on above average volume, as I believe investors were taking profits after the big gains from this huge November rally that we had. [CHART](https://ibb.co/0XvY72g)\n\nEnergy was the biggest loser yesterday as the whole [sectors](https://ibb.co/JBTt3Bt) finished down more than 5% while the only 2 sectors in the green were Technology and Health Care as we saw [value plays](https://ibb.co/SBGP6jS) struggling through the day while large cap growth companies were gaining, led by Apple as you can see in this [HEAT MAP](https://ibb.co/xf7mqtc), which finished the day up over 2% while the whole financial and energy sectors were down big.\n\nHere are the biggest economic [data](https://ibb.co/yV5rQ23) that we are expecting today, as we will see numbers from the MARKIT PMI and the ISM INDEX with vehicle sales arriving later in the day. Also only one big company is expected to report earnings today, [Salesforce](https://ibb.co/YTK19Tr), which is also expected to close a deal today to buy Slack in a cash-only deal. Salesforce is expected to maintain its EPS flat year over year with revenues increasing by more than 16%. I fully expect this to be beaten as this company has gone under appreciated in my opinion as smaller cloud companies have seen the bulk of the stock market gains. If they manage to buy Slack that will be a very positive thing for the company’s future as they will move on to bring a new challenge to the Microsoft bundle. [SLACK NEWS](https://ibb.co/GRjM1wk)\n\nGreat news came in the early morning today, as the OECD [revised](https://ibb.co/mc2dhhd) it’s GDP contraction up 0,3% with a real GDP growth forecasted at over 4% next year and 3,7% in 2022 as China is expected to account for one-third of the world economic growth next year, it might be the time to get more into that part of the stock market as they are expected to have a GDP growth of 8% next year.\n\nAlso, despite dropping more than 3% yesterday, Tesla saw it’s shares bounce back after the [news](https://ibb.co/hdMz1px) that it will be added at full float-adjusted market cap all at once on Dec. 21 due to its ability to accommodate big trades. With other good news coming yesterday also as China finally [approved](https://ibb.co/6n8hzP7) the selling of the Model Y in the country.\n\nAlso relating to the EV world, NIO just [announced](https://ibb.co/m91nYNp) while writing this post an increase of over 100% in delivery numbers for November to over 5 thousand cars. As they company keeps it over 100% year over year deliveries increase and are expected to continue the accelerations of production capacity to accommodate the bigger order numbers.\n\nWhile the hydrogen power Nikola seen it’s share drop yesterday after a worse than expected [deal](https://ibb.co/1nQ2bb5) with GM, as GM has pulled back from its initial far bigger commitment with Nikola as the 2 companies signed a non-binding memorandum that expires at the end of next year, so things may get even worse for Nikola as they also scrapped plans to build the Nikola Badger electric pickup and will refund order deposits for the truck. This resulted in an over 25% drop in Nikola [shares](https://ibb.co/ZMMj5rY) and I expect this to go even lower, as the former CEO Milton will see about 130 million shares unlocked today and a total unlock of 161 million shares, that is more than the [current free float](https://ibb.co/z8vzVTj) shares available for the company at 117 million. If he decides to sell those, that will crush the stock… So, I think a 15-16 $ price in the near future is possible even with Milton selling his shares.\n\nGood news for 2 of the biggest 3 companies in the world Apple and Amazon [announced](https://ibb.co/RCwxB2s) that they will team up to offer new cloud computing services for AWS users to be able to create and test apps remotely. This will be a big positive for both companies as Amazon will benefit from more cloud services usage while Apple continues to expand the software and services business.\n\nOther great news came for retailers as Shopify [announced](https://ibb.co/KLD25BH) that sales were up 75% year over year as the Black Friday to Cyber Monday sales are booming, this bolds well for companies like Lowe’s, Home Depot, Amazon and many others.\n\nWhile on the vaccine front, Moderna’s candidate is [expected](https://ibb.co/HB8fdnm) to be review in mid-December. I believe the stock has gone way over it’s head and has passed big players in the pharma industry like Vertex and Regeneron though for Moderna this will be they’re first product to be released to the market, I think this stock is well over-hyped at this price, I don’t believe it’s worth more than 100$ in the long-run as more vaccines will become available with far cheaper prices.\n\nThe only big company that reported earnings yesterday was [ZOOM](https://ibb.co/FB33wzw) as they beat expectations by [23 cents](https://ibb.co/GJXzrxj). The stock did fall more than 5% in after-hours trading as I expected as the total number of paying customers was only up 17% quarter over quarter with far bigger increases in free users that created bigger bills and drove the profit margins lower to 66% way below the 72% analysts expected. I believe the company faces a though 2021 year as they will have very difficult comps to take on, but I believe this will remain a winner in the longer run. So I sold out of my position on Zoom before this earnings but I will keep an eye on them, if the price drops below 400$ I would be willing to buy the stock once again.\n\nMeanwhile Biden has announced [his top picks](https://ibb.co/8XrnvpQ) for economic appointments and nominations and I believe this are very friendly picks for the stock market as he has gone with more central liberal picks and hasn’t gone to far to the left.\n\nSo I still believe the stock market is in a bull run for the moment with lot of great catalysts like the [PRESIDENTIAL ELECTION](https://ibb.co/T26q9Fz) being more and more certain, and a very likely split government after the Georgia Senate runoff election. So, with at least 2 vaccines right around the corner and treatments for the illness also getting better by the day, this will lead to a gradual reopening of the economy as less and less industries will suffer and the whole economy will eventually go back to normal. Also, the end of the US-China trade war might be in sight or at least a reduction in the trade tensions between the two biggest economies as Biden is close to taking over the Presidency in the US.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "TESLA NEWS | NIO SALES | NIKOLA STOCK CRASH | STOCK MARKET NEWS & MORE [12-01]", "link_flair_richtext": [{"e": "text", "t": "DD"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 0, "link_flair_css_class": "dd", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": true, "name": "t3_k4l83m", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.78, "author_flair_background_color": null, "subreddit_type": "public", "ups": 10, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "DD", "can_mod_post": false, "score": 10, "approved_by": null, "author_premium": false, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1606859567.0, "link_flair_type": "richtext", "wls": 0, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Tesla and NIO shares are jumping after good news, while NIKOLA tumbles after GM goes for a much smaller agreement, the stock market loses ground as investors take profits, let’s talk about this and much more about the stock market</strong></p>\n\n<p>Hey everyone and Welcome! So, let’s start with the recap of yesterday as we saw the <a href=\"https://ibb.co/2g68hFq\">NASDAQ COMPOSITE</a> finish about flat for the day, the <a href=\"https://ibb.co/cr8CXVz\">SP500</a> finished about half a percent down for the day and the <a href=\"https://ibb.co/9tFCX3j\">DOW INDUSTRIAL</a> was the biggest losers down almost 1% thought all 3 of them were down even bigger intraday. So, both the SP and the DOW finished with record monthly gains, the SP finish up 10,9% for the month above the previous record of 10,2% exactly 40 years ago, while the DOW finished up 11,9% and topped the previous record from 1987 with the Nasdaq also having its best month since the middle of the dot-com boom in 2001. The <a href=\"https://ibb.co/4g07SHm\">VIX</a> also finished down more than 1% for the day though at one point it almost hit the 23 mark.</p>\n\n<p>Almost 70% of companies were declining yesterday on above average volume, as I believe investors were taking profits after the big gains from this huge November rally that we had. <a href=\"https://ibb.co/0XvY72g\">CHART</a></p>\n\n<p>Energy was the biggest loser yesterday as the whole <a href=\"https://ibb.co/JBTt3Bt\">sectors</a> finished down more than 5% while the only 2 sectors in the green were Technology and Health Care as we saw <a href=\"https://ibb.co/SBGP6jS\">value plays</a> struggling through the day while large cap growth companies were gaining, led by Apple as you can see in this <a href=\"https://ibb.co/xf7mqtc\">HEAT MAP</a>, which finished the day up over 2% while the whole financial and energy sectors were down big.</p>\n\n<p>Here are the biggest economic <a href=\"https://ibb.co/yV5rQ23\">data</a> that we are expecting today, as we will see numbers from the MARKIT PMI and the ISM INDEX with vehicle sales arriving later in the day. Also only one big company is expected to report earnings today, <a href=\"https://ibb.co/YTK19Tr\">Salesforce</a>, which is also expected to close a deal today to buy Slack in a cash-only deal. Salesforce is expected to maintain its EPS flat year over year with revenues increasing by more than 16%. I fully expect this to be beaten as this company has gone under appreciated in my opinion as smaller cloud companies have seen the bulk of the stock market gains. If they manage to buy Slack that will be a very positive thing for the company’s future as they will move on to bring a new challenge to the Microsoft bundle. <a href=\"https://ibb.co/GRjM1wk\">SLACK NEWS</a></p>\n\n<p>Great news came in the early morning today, as the OECD <a href=\"https://ibb.co/mc2dhhd\">revised</a> it’s GDP contraction up 0,3% with a real GDP growth forecasted at over 4% next year and 3,7% in 2022 as China is expected to account for one-third of the world economic growth next year, it might be the time to get more into that part of the stock market as they are expected to have a GDP growth of 8% next year.</p>\n\n<p>Also, despite dropping more than 3% yesterday, Tesla saw it’s shares bounce back after the <a href=\"https://ibb.co/hdMz1px\">news</a> that it will be added at full float-adjusted market cap all at once on Dec. 21 due to its ability to accommodate big trades. With other good news coming yesterday also as China finally <a href=\"https://ibb.co/6n8hzP7\">approved</a> the selling of the Model Y in the country.</p>\n\n<p>Also relating to the EV world, NIO just <a href=\"https://ibb.co/m91nYNp\">announced</a> while writing this post an increase of over 100% in delivery numbers for November to over 5 thousand cars. As they company keeps it over 100% year over year deliveries increase and are expected to continue the accelerations of production capacity to accommodate the bigger order numbers.</p>\n\n<p>While the hydrogen power Nikola seen it’s share drop yesterday after a worse than expected <a href=\"https://ibb.co/1nQ2bb5\">deal</a> with GM, as GM has pulled back from its initial far bigger commitment with Nikola as the 2 companies signed a non-binding memorandum that expires at the end of next year, so things may get even worse for Nikola as they also scrapped plans to build the Nikola Badger electric pickup and will refund order deposits for the truck. This resulted in an over 25% drop in Nikola <a href=\"https://ibb.co/ZMMj5rY\">shares</a> and I expect this to go even lower, as the former CEO Milton will see about 130 million shares unlocked today and a total unlock of 161 million shares, that is more than the <a href=\"https://ibb.co/z8vzVTj\">current free float</a> shares available for the company at 117 million. If he decides to sell those, that will crush the stock… So, I think a 15-16 $ price in the near future is possible even with Milton selling his shares.</p>\n\n<p>Good news for 2 of the biggest 3 companies in the world Apple and Amazon <a href=\"https://ibb.co/RCwxB2s\">announced</a> that they will team up to offer new cloud computing services for AWS users to be able to create and test apps remotely. This will be a big positive for both companies as Amazon will benefit from more cloud services usage while Apple continues to expand the software and services business.</p>\n\n<p>Other great news came for retailers as Shopify <a href=\"https://ibb.co/KLD25BH\">announced</a> that sales were up 75% year over year as the Black Friday to Cyber Monday sales are booming, this bolds well for companies like Lowe’s, Home Depot, Amazon and many others.</p>\n\n<p>While on the vaccine front, Moderna’s candidate is <a href=\"https://ibb.co/HB8fdnm\">expected</a> to be review in mid-December. I believe the stock has gone way over it’s head and has passed big players in the pharma industry like Vertex and Regeneron though for Moderna this will be they’re first product to be released to the market, I think this stock is well over-hyped at this price, I don’t believe it’s worth more than 100$ in the long-run as more vaccines will become available with far cheaper prices.</p>\n\n<p>The only big company that reported earnings yesterday was <a href=\"https://ibb.co/FB33wzw\">ZOOM</a> as they beat expectations by <a href=\"https://ibb.co/GJXzrxj\">23 cents</a>. The stock did fall more than 5% in after-hours trading as I expected as the total number of paying customers was only up 17% quarter over quarter with far bigger increases in free users that created bigger bills and drove the profit margins lower to 66% way below the 72% analysts expected. I believe the company faces a though 2021 year as they will have very difficult comps to take on, but I believe this will remain a winner in the longer run. So I sold out of my position on Zoom before this earnings but I will keep an eye on them, if the price drops below 400$ I would be willing to buy the stock once again.</p>\n\n<p>Meanwhile Biden has announced <a href=\"https://ibb.co/8XrnvpQ\">his top picks</a> for economic appointments and nominations and I believe this are very friendly picks for the stock market as he has gone with more central liberal picks and hasn’t gone to far to the left.</p>\n\n<p>So I still believe the stock market is in a bull run for the moment with lot of great catalysts like the <a href=\"https://ibb.co/T26q9Fz\">PRESIDENTIAL ELECTION</a> being more and more certain, and a very likely split government after the Georgia Senate runoff election. So, with at least 2 vaccines right around the corner and treatments for the illness also getting better by the day, this will lead to a gradual reopening of the economy as less and less industries will suffer and the whole economy will eventually go back to normal. Also, the end of the US-China trade war might be in sight or at least a reduction in the trade tensions between the two biggest economies as Biden is close to taking over the Presidency in the US.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": true, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/eAA-LXdddq7W5vxKAkAt93NcznWwH4N1Bkgx9Ki0CUg.jpg?auto=webp&s=27134fcb5f71aa87130b11e9df2ee302699121c1", "width": 899, "height": 473}, "resolutions": [{"url": "https://external-preview.redd.it/eAA-LXdddq7W5vxKAkAt93NcznWwH4N1Bkgx9Ki0CUg.jpg?width=108&crop=smart&auto=webp&s=9ba5ccead7ff0e5daebe3bbee47388afafb09716", "width": 108, "height": 56}, {"url": "https://external-preview.redd.it/eAA-LXdddq7W5vxKAkAt93NcznWwH4N1Bkgx9Ki0CUg.jpg?width=216&crop=smart&auto=webp&s=66a8fcb991781c7ac9ad9d53d2ca005325cd404e", "width": 216, "height": 113}, {"url": "https://external-preview.redd.it/eAA-LXdddq7W5vxKAkAt93NcznWwH4N1Bkgx9Ki0CUg.jpg?width=320&crop=smart&auto=webp&s=280590e7683734c0e9d0be09417570bedbdc6c5d", "width": 320, "height": 168}, {"url": "https://external-preview.redd.it/eAA-LXdddq7W5vxKAkAt93NcznWwH4N1Bkgx9Ki0CUg.jpg?width=640&crop=smart&auto=webp&s=60dee52bb566530a6ea70cb01c28c75e63a0f2db", "width": 640, "height": 336}], "variants": {}, "id": "MfgTgJCbt_KDKN_hD4ZWm_BcNSPhEmdrJ0ThOz7nKAc"}], "enabled": false}, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "5692ce02-b860-11e5-b542-0edc7016bbd3", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#365b8c", "id": "k4l83m", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 15, "send_replies": true, "whitelist_status": "no_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/", "parent_whitelist_status": "no_ads", "stickied": true, "url": "https://www.reddit.com/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/", "subreddit_subscribers": 1640287, "created_utc": 1606830767.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": "45b14952-0d2e-11ea-8d6d-0e9a93171619", "likes": null, "user_reports": [], "saved": false, "id": "ge9aylv", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "WSBVoteBot", "fullname": "t2_26k75u4f"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4l83m", "score": 1, "author_fullname": "t2_26k75u4f", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "**If this is [spam](https://www.reddit.com/r/wallstreetbets/wiki/contentguide) you can vote to remove it and earn setting your own flair.**\n\n| **Remove It (1)** | **Keep It (1)** |\n|--------|:-------|-------:|:------:|\n| [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k4l83m&message=spam) | [Click to Vote](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=k4l83m&message=approve)|\n\n[Click Here to Change Inaccurate Post Flair](https://www.reddit.com/message/compose/?to=WSBVoteBot&subject=postflair%20CHANGEME&message=k4l83m)\n___\n ^comment ^will ^disappear ^--- ^317 ^shitposts ^removed ^since ^last ^crash ^--- ^[information](https://www.reddit.com/r/wallstreetbets/wiki/votebot) ^--- ^[leaderboard](https://www.reddit.com/r/wallstreetbets/wiki/leaderboard) ^--- ^[REWARDS](https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands)", "edited": 1606831031.0, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":illuminatipepe:", "u": "https://emoji.redditmedia.com/tx424is9gy711_t5_2th52/illuminatipepe", "e": "emoji"}, {"e": "text", "t": " Robot Janitor"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p><strong>If this is <a href=\"https://www.reddit.com/r/wallstreetbets/wiki/contentguide\">spam</a> you can vote to remove it and earn setting your own flair.</strong></p>\n\n<table><thead>\n<tr>\n<th><strong>Remove It (1)</strong></th>\n<th align=\"left\"><strong>Keep It (1)</strong></th>\n</tr>\n</thead><tbody>\n<tr>\n<td><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k4l83m&amp;message=spam\">Click to Vote</a></td>\n<td align=\"left\"><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=k4l83m&amp;message=approve\">Click to Vote</a></td>\n</tr>\n</tbody></table>\n\n<p><a href=\"https://www.reddit.com/message/compose/?to=WSBVoteBot&amp;subject=postflair%20CHANGEME&amp;message=k4l83m\">Click Here to Change Inaccurate Post Flair</a></p>\n\n<hr/>\n\n<p><sup>comment</sup> <sup>will</sup> <sup>disappear</sup> <sup>---</sup> <sup>317</sup> <sup>shitposts</sup> <sup>removed</sup> <sup>since</sup> <sup>last</sup> <sup>crash</sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot\">information</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/leaderboard\">leaderboard</a></sup> <sup>---</sup> <sup><a href=\"https://www.reddit.com/r/wallstreetbets/wiki/votebot_commands\">REWARDS</a></sup></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": true, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "light", "score_hidden": true, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9aylv/", "num_reports": null, "locked": false, "name": "t1_ge9aylv", "created": 1606859587.0, "author_flair_text": ":illuminatipepe: Robot Janitor", "treatment_tags": [], "created_utc": 1606830787.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#46d160", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9b8i3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "Sarbitrage", "fullname": "t2_3ctvg1"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4l83m", "score": 6, "author_fullname": "t2_3ctvg1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Didn’t read anything but you seem like a smart man. So what’s the play? Calls or puts?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Didn’t read anything but you seem like a smart man. So what’s the play? Calls or puts?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9b8i3/", "num_reports": null, "locked": false, "name": "t1_ge9b8i3", "created": 1606859763.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606830963.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9bb21", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ge9b8i3", "score": 1, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Puts on NIKOLA, CALL ON NIO, TESLA though in my opinion", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Puts on NIKOLA, CALL ON NIO, TESLA though in my opinion</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9bb21/", "num_reports": null, "locked": false, "name": "t1_ge9bb21", "created": 1606859810.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606831010.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9bdns", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Sarbitrage", "fullname": "t2_3ctvg1"}, "can_mod_post": false, "created_utc": 1606831056.0, "send_replies": true, "parent_id": "t1_ge9bb21", "score": 1, "author_fullname": "t2_3ctvg1", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "How do I counter IV crush though? What’s your play? Verticals?", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>How do I counter IV crush though? What’s your play? Verticals?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9bdns/", "num_reports": null, "locked": false, "name": "t1_ge9bdns", "created": 1606859856.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9bbd3", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "Kieffin", "fullname": "t2_8a5eq"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ge9b8i3", "score": 1, "author_fullname": "t2_8a5eq", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "NKLA puts! $10 this week or next \n\nShould mention I didn’t read it either.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>NKLA puts! $10 this week or next </p>\n\n<p>Should mention I didn’t read it either.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9bbd3/", "num_reports": null, "locked": false, "name": "t1_ge9bbd3", "created": 1606859815.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606831015.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9b3r4", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "CitrusAbyss", "fullname": "t2_8hk1a"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_k4l83m", "score": 4, "author_fullname": "t2_8hk1a", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "This is helpful as a news recap but it's not DD.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>This is helpful as a news recap but it&#39;s not DD.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9b3r4/", "num_reports": null, "locked": false, "name": "t1_ge9b3r4", "created": 1606859678.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606830878.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 0, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9b8fy", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_ge9b3r4", "score": 0, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "What should i have flaired it then?", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>What should i have flaired it then?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9b8fy/", "num_reports": null, "locked": false, "name": "t1_ge9b8fy", "created": 1606859762.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1606830962.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_k4l83m", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "ge9bcap", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "hanz3n", "fullname": "t2_e4a0km8"}, "can_mod_post": false, "created_utc": 1606831031.0, "send_replies": true, "parent_id": "t1_ge9b8fy", "score": 1, "author_fullname": "t2_e4a0km8", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Discussion", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Discussion</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/k4l83m/tesla_news_nio_sales_nikola_stock_crash_stock/ge9bcap/", "num_reports": null, "locked": false, "name": "t1_ge9bcap", "created": 1606859831.0, "author_flair_text": null, "treatment_tags": [], "collapsed": false, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 2, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}]}