{"approved_at_utc": null, "selftext": "**Stocks end 2020 on the high note with Tesla closing over 700$. Is Lemonade overvalued? FuboTv keeps on crumbling while NIO posts great sales numbers, let’s talk about this & other stock market news**\n\nHello everyone and Good Morning! So, let’s start with the recap of the last trading day of 2020, as we saw both the broad stock market [SP500](https://ibb.co/bHgX2sf) and the [Dow Jones Industrial](https://ibb.co/D471c7X) finish up over 0.60% and finishing at record highs, while the tech heavy [Nasdaq Composite](https://ibb.co/vzGgSBb)  finished barely up for the day, gaining .14%. We also saw the [VIX](https://ibb.co/2YrvMpT) finishing just down for the day, but it’s still up from a [week](https://ibb.co/LxdGJ8c) ago, as the volatility still remains way above the [levels](https://ibb.co/XbWkzW4) before March when it rose to over 80.\n\nWe just about saw a positive ratio of companies [advancing](https://ibb.co/5TwrM2m) to close out the year as the volume was belove average with just 100 new highs, as we saw 10 of the 11 [sectors](https://ibb.co/yyrTGGP) finishing in the green with Utilities, Financials, Real Estate & Health Care gaining more than 1% while Energy was the only sector to finish the day with a loss.  \nWe also saw most factor groups [finishing](https://ibb.co/dmvNJgL) the day in the red with only Large-Cap Value companies posting a gain of .3%, as you can see in Thursday’s [HEAT MAP](https://ibb.co/wBGr7cR) with gains all around the board, while losses were concentrated in the Biotech and Oil & Gas industry.\n\nHere is the weekly [HEAT MAP](https://ibb.co/zQWD12B) with names like Alibaba, Shopify, Palantir, Square and Zoom being some of the biggest losers, while TESLA continued to push higher as Tesla finished the month of [December](https://ibb.co/ZX09X8Z) with a gain of more than 20% as you can see here, while many of the other big tech names also had a strong month, with most of the losses being concentrated in the communication sector and of course Alibaba which was hit by a lot of negative news.\n\nWe also [finished](https://ibb.co/r5JRk5b) the year with most sectors in the green as you can see here, led by Technology, Consumer Cyclicals and Communications. But gains were had in most other sectors as well, except the Financial, Travel and Energy sectors, which finished the year down.\n\nThe biggest [losers](https://ibb.co/nDgRs1S) in the SP500 which finished the year up more than 16% were by far stocks like Carnival, OXY, Norwegian Cruise Line, United Airlines and many more others. The Nasdaq 100 wasn’t safe either despite jumping almost 50% in 2020, having the best gains in 11years, with companies like Walgreens, Fox and Intel posting losses of over 17%, while the Dow was the laggard finishing just over 7% up for the year as Boeing, Chevron and Intel dragged the index lower.\n\nWe also saw huge [winners](https://ibb.co/n7yP7cM)  in 2020, as the SP500 was led higher by stocks like Apple, Nvidia, PayPal, Amazon and many others that posted huge gains. While the Nasdaq 100 jumped to record highs lead by Tesla which posted an incredible year with other stocks like Moderna, Peloton & Zoom also rising by more than 300%. The Dow also had big winners but still lagged as the biggest gainers here were the tech giants Apple & Microsoft joined by some other stocks like Nike, Disney & Salesforce.\n\nWe also got some economic data since Thursday as Macau’s gaming [revenue](https://ibb.co/NWBrC3s) continued the slow recovery, but the visits in the travel dependent region were 20% higher in the Holiday period compared to the start of December, which may be another positive sign for the Macau Gambling business.\n\nMeanwhile we also received the latest jobless [numbers](https://ibb.co/Km8px8X), which dipped below 800K again, 19K less than last week and more than 40K less than expected, as the continuing jobless claims also fell to just over 5.2M more than 100K better than expected and the previous [report](https://ibb.co/gJLQYPB).\n\nWhile this [week](https://ibb.co/mDnXFZY) we start to receive important economic data that alongside the results of the Georgia runoff election might push the market either to more gains, or if the results and data don’t show up as investors & analysts expected it, we might see an increase in volatility again which will lead to a market pullback or correction, which in my opinion would be a good time to go out and find deals to buy again.\n\nWe also really don’t get any significant [earnings](https://ibb.co/60QM77h) releases this week, with most of the interesting ones like Micron, Walgreens & Bed Bath & Beyond coming on Thursday.\n\nSo, in some other stock market news, Tesla topped [expectations](https://ibb.co/g9048Ry) of 163K deliveries in Q4 again but did finish just shy of the 500K mark. The company delivered more than 180K vehicle in the last quarter, as we saw [Tesla](https://ibb.co/th7Hhnc)  pricing the model Y at just over $50.000 in China and are expecting to start deliveries this month as they keep expanding their sales in the world’s biggest car market, as they are targeting to make this their biggest market surpassing the US. Tesla closed over 700$ for the first time and if you want to see my opinion on this stock, check out my prediction on Tesla [HERE](https://www.reddit.com/r/wallstreetbets/comments/kci2lk/my_tesla_stock_price_predictions_buy_or_sell/).\n\nSome other EV makers from China also posted sales numbers with [Li Auto](https://ibb.co/LYCSs1N) increasing deliveries five-fold year/year with a 32% increase month/month in December, while [XPENG](https://ibb.co/Zc7FSQC) also announced record delivery numbers up 35% month/month and more than 300% year/year for December. We also saw [NIO](https://ibb.co/4VWGX78) posting a monthly deliveries record of just over 7K, up over 120% year/year and finishing the year with over 43K deliveries, which were also up over 110% year/year, as they are also planning on revealing some new sedan models and their latest developments on self-driving and other technologies next week.\n\nMeanwhile we saw [Lemonade](https://ibb.co/dKh6kx0) take a ride after another short-seller released a statement, pointing out to the final lock-up period after the IPO, as a moment that will bring huge selling to this stock, despite the [company](https://ibb.co/YWksq6g) needing just over 4 years to reach the first million customers, less than 5 times the time it took companies like StateFarm, Geico and Allstate to reach their first million. I personally am an investor in this company, and I really like what they are doing, so I am not going to sell my shares anytime soon.\n\nGuys, personally I can’t wait to see the sales numbers and how the services business is growing for [Apple](https://ibb.co/cx07jJs) as the top-of-the-line products keep having great demand, but we do have to see what happens in the US-China relations, as this could impact the Apple revenue stream, this after the New York Stock Exchange has [started](https://ibb.co/599nrxc) the process of delisting telecom giants from China. You can check out my prediction on Apple [HERE](https://www.reddit.com/r/wallstreetbets/comments/kmzvqv/apple_stock_price_predictions_buy_or_sell_aapl/)\n\nWe also saw a [memo](https://ibb.co/qyBfzrq) from DELTA’s CEO, as he expects the company to return to positive cashflow in the spring, as they are planning to start paying down debt as soon as that happens to reduce the burden the company has taken on since March 2020.\n\nMeanwhile [FuboTV](https://ibb.co/Dg5jZ6x) continues its sharp decline after a number of firms have started to short the stock pointing to insane valuations and outlook. Fubo plunged again almost 16% Thursday and is down almost 50% in the past week as the IPO lockup period expired, more than tripling the shares float.\n\nAnd on last piece of news that just came out is that [Roku](https://ibb.co/gM8Z4Bv) is looking to buy the content catalog from Quibi, this would give a boost to Roku’s exclusive programming, as the stock has seen an immediate reaction and is up over 3.5% in pre-market trading.\n\nLet’s hope for a good day in the market as US [FUTURES](https://ibb.co/zf9tMYZ) seem to be pointing at a good open, with the SP500 leading the way to start off the year as we wait to receive the first economic [data](https://ibb.co/f24tRCS) this year in the early morning, while the global stock [markets](https://ibb.co/sjvZMrx) started on a positive note except Japan.\n\nThank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!\n\nHave a great day and see you next time!", "author_fullname": "t2_8oq1j048", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Stock Market News for Today | TSLA, NIO, LMND, FUBO, ROKU & Other Stock Market News [01-04]", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "question", "downs": 0, "thumbnail_height": null, "top_awarded_type": null, "hide_score": false, "name": "t3_kq8hac", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.9, "author_flair_background_color": null, "subreddit_type": "public", "ups": 54, "total_awards_received": 1, "media_embed": {}, "thumbnail_width": null, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Discussion", "can_mod_post": false, "score": 54, "approved_by": null, "author_premium": true, "thumbnail": "self", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [], "gildings": {}, "post_hint": "self", "content_categories": null, "is_self": true, "mod_note": null, "created": 1609794691.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "text", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p><strong>Stocks end 2020 on the high note with Tesla closing over 700$. Is Lemonade overvalued? FuboTv keeps on crumbling while NIO posts great sales numbers, let’s talk about this &amp; other stock market news</strong></p>\n\n<p>Hello everyone and Good Morning! So, let’s start with the recap of the last trading day of 2020, as we saw both the broad stock market <a href=\"https://ibb.co/bHgX2sf\">SP500</a> and the <a href=\"https://ibb.co/D471c7X\">Dow Jones Industrial</a> finish up over 0.60% and finishing at record highs, while the tech heavy <a href=\"https://ibb.co/vzGgSBb\">Nasdaq Composite</a>  finished barely up for the day, gaining .14%. We also saw the <a href=\"https://ibb.co/2YrvMpT\">VIX</a> finishing just down for the day, but it’s still up from a <a href=\"https://ibb.co/LxdGJ8c\">week</a> ago, as the volatility still remains way above the <a href=\"https://ibb.co/XbWkzW4\">levels</a> before March when it rose to over 80.</p>\n\n<p>We just about saw a positive ratio of companies <a href=\"https://ibb.co/5TwrM2m\">advancing</a> to close out the year as the volume was belove average with just 100 new highs, as we saw 10 of the 11 <a href=\"https://ibb.co/yyrTGGP\">sectors</a> finishing in the green with Utilities, Financials, Real Estate &amp; Health Care gaining more than 1% while Energy was the only sector to finish the day with a loss.<br/>\nWe also saw most factor groups <a href=\"https://ibb.co/dmvNJgL\">finishing</a> the day in the red with only Large-Cap Value companies posting a gain of .3%, as you can see in Thursday’s <a href=\"https://ibb.co/wBGr7cR\">HEAT MAP</a> with gains all around the board, while losses were concentrated in the Biotech and Oil &amp; Gas industry.</p>\n\n<p>Here is the weekly <a href=\"https://ibb.co/zQWD12B\">HEAT MAP</a> with names like Alibaba, Shopify, Palantir, Square and Zoom being some of the biggest losers, while TESLA continued to push higher as Tesla finished the month of <a href=\"https://ibb.co/ZX09X8Z\">December</a> with a gain of more than 20% as you can see here, while many of the other big tech names also had a strong month, with most of the losses being concentrated in the communication sector and of course Alibaba which was hit by a lot of negative news.</p>\n\n<p>We also <a href=\"https://ibb.co/r5JRk5b\">finished</a> the year with most sectors in the green as you can see here, led by Technology, Consumer Cyclicals and Communications. But gains were had in most other sectors as well, except the Financial, Travel and Energy sectors, which finished the year down.</p>\n\n<p>The biggest <a href=\"https://ibb.co/nDgRs1S\">losers</a> in the SP500 which finished the year up more than 16% were by far stocks like Carnival, OXY, Norwegian Cruise Line, United Airlines and many more others. The Nasdaq 100 wasn’t safe either despite jumping almost 50% in 2020, having the best gains in 11years, with companies like Walgreens, Fox and Intel posting losses of over 17%, while the Dow was the laggard finishing just over 7% up for the year as Boeing, Chevron and Intel dragged the index lower.</p>\n\n<p>We also saw huge <a href=\"https://ibb.co/n7yP7cM\">winners</a>  in 2020, as the SP500 was led higher by stocks like Apple, Nvidia, PayPal, Amazon and many others that posted huge gains. While the Nasdaq 100 jumped to record highs lead by Tesla which posted an incredible year with other stocks like Moderna, Peloton &amp; Zoom also rising by more than 300%. The Dow also had big winners but still lagged as the biggest gainers here were the tech giants Apple &amp; Microsoft joined by some other stocks like Nike, Disney &amp; Salesforce.</p>\n\n<p>We also got some economic data since Thursday as Macau’s gaming <a href=\"https://ibb.co/NWBrC3s\">revenue</a> continued the slow recovery, but the visits in the travel dependent region were 20% higher in the Holiday period compared to the start of December, which may be another positive sign for the Macau Gambling business.</p>\n\n<p>Meanwhile we also received the latest jobless <a href=\"https://ibb.co/Km8px8X\">numbers</a>, which dipped below 800K again, 19K less than last week and more than 40K less than expected, as the continuing jobless claims also fell to just over 5.2M more than 100K better than expected and the previous <a href=\"https://ibb.co/gJLQYPB\">report</a>.</p>\n\n<p>While this <a href=\"https://ibb.co/mDnXFZY\">week</a> we start to receive important economic data that alongside the results of the Georgia runoff election might push the market either to more gains, or if the results and data don’t show up as investors &amp; analysts expected it, we might see an increase in volatility again which will lead to a market pullback or correction, which in my opinion would be a good time to go out and find deals to buy again.</p>\n\n<p>We also really don’t get any significant <a href=\"https://ibb.co/60QM77h\">earnings</a> releases this week, with most of the interesting ones like Micron, Walgreens &amp; Bed Bath &amp; Beyond coming on Thursday.</p>\n\n<p>So, in some other stock market news, Tesla topped <a href=\"https://ibb.co/g9048Ry\">expectations</a> of 163K deliveries in Q4 again but did finish just shy of the 500K mark. The company delivered more than 180K vehicle in the last quarter, as we saw <a href=\"https://ibb.co/th7Hhnc\">Tesla</a>  pricing the model Y at just over $50.000 in China and are expecting to start deliveries this month as they keep expanding their sales in the world’s biggest car market, as they are targeting to make this their biggest market surpassing the US. Tesla closed over 700$ for the first time and if you want to see my opinion on this stock, check out my prediction on Tesla <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kci2lk/my_tesla_stock_price_predictions_buy_or_sell/\">HERE</a>.</p>\n\n<p>Some other EV makers from China also posted sales numbers with <a href=\"https://ibb.co/LYCSs1N\">Li Auto</a> increasing deliveries five-fold year/year with a 32% increase month/month in December, while <a href=\"https://ibb.co/Zc7FSQC\">XPENG</a> also announced record delivery numbers up 35% month/month and more than 300% year/year for December. We also saw <a href=\"https://ibb.co/4VWGX78\">NIO</a> posting a monthly deliveries record of just over 7K, up over 120% year/year and finishing the year with over 43K deliveries, which were also up over 110% year/year, as they are also planning on revealing some new sedan models and their latest developments on self-driving and other technologies next week.</p>\n\n<p>Meanwhile we saw <a href=\"https://ibb.co/dKh6kx0\">Lemonade</a> take a ride after another short-seller released a statement, pointing out to the final lock-up period after the IPO, as a moment that will bring huge selling to this stock, despite the <a href=\"https://ibb.co/YWksq6g\">company</a> needing just over 4 years to reach the first million customers, less than 5 times the time it took companies like StateFarm, Geico and Allstate to reach their first million. I personally am an investor in this company, and I really like what they are doing, so I am not going to sell my shares anytime soon.</p>\n\n<p>Guys, personally I can’t wait to see the sales numbers and how the services business is growing for <a href=\"https://ibb.co/cx07jJs\">Apple</a> as the top-of-the-line products keep having great demand, but we do have to see what happens in the US-China relations, as this could impact the Apple revenue stream, this after the New York Stock Exchange has <a href=\"https://ibb.co/599nrxc\">started</a> the process of delisting telecom giants from China. You can check out my prediction on Apple <a href=\"https://www.reddit.com/r/wallstreetbets/comments/kmzvqv/apple_stock_price_predictions_buy_or_sell_aapl/\">HERE</a></p>\n\n<p>We also saw a <a href=\"https://ibb.co/qyBfzrq\">memo</a> from DELTA’s CEO, as he expects the company to return to positive cashflow in the spring, as they are planning to start paying down debt as soon as that happens to reduce the burden the company has taken on since March 2020.</p>\n\n<p>Meanwhile <a href=\"https://ibb.co/Dg5jZ6x\">FuboTV</a> continues its sharp decline after a number of firms have started to short the stock pointing to insane valuations and outlook. Fubo plunged again almost 16% Thursday and is down almost 50% in the past week as the IPO lockup period expired, more than tripling the shares float.</p>\n\n<p>And on last piece of news that just came out is that <a href=\"https://ibb.co/gM8Z4Bv\">Roku</a> is looking to buy the content catalog from Quibi, this would give a boost to Roku’s exclusive programming, as the stock has seen an immediate reaction and is up over 3.5% in pre-market trading.</p>\n\n<p>Let’s hope for a good day in the market as US <a href=\"https://ibb.co/zf9tMYZ\">FUTURES</a> seem to be pointing at a good open, with the SP500 leading the way to start off the year as we wait to receive the first economic <a href=\"https://ibb.co/f24tRCS\">data</a> this year in the early morning, while the global stock <a href=\"https://ibb.co/sjvZMrx\">markets</a> started on a positive note except Japan.</p>\n\n<p>Thank you everyone for reading! Hope you enjoyed the content! Be sure to leave a comment down below with your opinion on the stock market!</p>\n\n<p>Have a great day and see you next time!</p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "preview": {"images": [{"source": {"url": "https://external-preview.redd.it/CPgTiFGOTJ7Ps1ZB3GP_c6b3Osh2MKWxLgjptyfnbas.jpg?auto=webp&s=4f3b1388ace76691bd111dc8aa49237fc73ffa33", "width": 882, "height": 466}, "resolutions": [{"url": "https://external-preview.redd.it/CPgTiFGOTJ7Ps1ZB3GP_c6b3Osh2MKWxLgjptyfnbas.jpg?width=108&crop=smart&auto=webp&s=43617c158a76e93e8fd78c8dce3e398a111797a9", "width": 108, "height": 57}, {"url": "https://external-preview.redd.it/CPgTiFGOTJ7Ps1ZB3GP_c6b3Osh2MKWxLgjptyfnbas.jpg?width=216&crop=smart&auto=webp&s=86b2656d50794650fff6fbedd2b5c0b3dca5d093", "width": 216, "height": 114}, {"url": "https://external-preview.redd.it/CPgTiFGOTJ7Ps1ZB3GP_c6b3Osh2MKWxLgjptyfnbas.jpg?width=320&crop=smart&auto=webp&s=b597955104438f4d760309a0311fc4c8c39c5379", "width": 320, "height": 169}, {"url": "https://external-preview.redd.it/CPgTiFGOTJ7Ps1ZB3GP_c6b3Osh2MKWxLgjptyfnbas.jpg?width=640&crop=smart&auto=webp&s=6c419800ceb4d231fbdb9deaf96dbbb2f1e04fff", "width": 640, "height": 338}], "variants": {}, "id": "70msadZ3s_eunTwRq2Cpx6N7M4Zh5HQdUUyGP9vTmow"}], "enabled": false}, "all_awardings": [{"giver_coin_reward": 0, "subreddit_id": null, "is_new": false, "days_of_drip_extension": 0, "coin_price": 80, "id": "award_8352bdff-3e03-4189-8a08-82501dd8f835", "penny_donate": 0, "award_sub_type": "GLOBAL", "coin_reward": 0, "icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png", "days_of_premium": 0, "tiers_by_required_awardings": null, "resized_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_width": 2048, "static_icon_width": 2048, "start_date": null, "is_enabled": true, "awardings_required_to_grant_benefits": null, "description": "Everything is better with a good hug", "end_date": null, "subreddit_coin_reward": 0, "count": 1, "static_icon_height": 2048, "name": "Hugz", "resized_static_icons": [{"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=16&height=16&auto=webp&s=69997ace3ef4ffc099b81d774c2c8f1530602875", "width": 16, "height": 16}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=32&height=32&auto=webp&s=e9519d1999ef9dce5c8a9f59369cb92f52d95319", "width": 32, "height": 32}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=48&height=48&auto=webp&s=f076c6434fb2d2f9075991810fd845c40fa73fc6", "width": 48, "height": 48}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=64&height=64&auto=webp&s=85527145e0c4b754306a30df29e584fd16187636", "width": 64, "height": 64}, {"url": "https://preview.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png?width=128&height=128&auto=webp&s=b8843cdf82c3b741d7af057c14076dcd2621e811", "width": 128, "height": 128}], "icon_format": "PNG", "icon_height": 2048, "penny_price": 0, "award_type": "global", "static_icon_url": "https://i.redd.it/award_images/t5_q0gj4/fpm0r5ryq1361_PolarHugs.png"}], "awarders": [], "media_only": false, "link_flair_template_id": "96f6c79e-b853-11e5-a4cb-0ebdf030e05d", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": null, "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#800080", "id": "kq8hac", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "discussion_type": null, "num_comments": 21, "send_replies": true, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": null, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/", "subreddit_subscribers": 1768986, "created_utc": 1609765891.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 18, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi2e5f0", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "iTradeStalks", "fullname": "t2_7wv6akhz"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kq8hac", "score": 18, "author_fullname": "t2_7wv6akhz", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "TSLA 2500 (then split) EOY", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>TSLA 2500 (then split) EOY</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2e5f0/", "num_reports": null, "locked": false, "name": "t1_gi2e5f0", "created": 1609796376.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609767576.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi2grvp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gi2e5f0", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Would be nice", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Would be nice</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2grvp/", "num_reports": null, "locked": false, "name": "t1_gi2grvp", "created": 1609798110.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609769310.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 5, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": "acf21f8a-b20b-11e8-8717-0ee9cf2d415a", "likes": null, "user_reports": [], "saved": false, "id": "gi2btq9", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "AutoModerator", "fullname": "t2_6l4z3"}, "can_mod_post": false, "send_replies": false, "parent_id": "t3_kq8hac", "score": 5, "author_fullname": "t2_6l4z3", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Sir, this is the unemployment line.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/wallstreetbets) if you have any questions or concerns.*", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"a": ":automod:", "u": "https://emoji.redditmedia.com/00ogu4e53nt41_t5_2th52/automod", "e": "emoji"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Sir, this is the unemployment line.</p>\n\n<p><em>I am a bot, and this action was performed automatically. Please <a href=\"/message/compose/?to=/r/wallstreetbets\">contact the moderators of this subreddit</a> if you have any questions or concerns.</em></p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2btq9/", "num_reports": null, "locked": false, "name": "t1_gi2btq9", "created": 1609794692.0, "author_flair_text": ":automod:", "treatment_tags": [], "created_utc": 1609765892.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "#ffffff", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": "moderator", "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 4, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi2f2dq", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "nateyp123", "fullname": "t2_12s4tw"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kq8hac", "score": 4, "author_fullname": "t2_12s4tw", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "My 1/8 $47 nio call hopes today will be a great day", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>My 1/8 $47 nio call hopes today will be a great day</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2f2dq/", "num_reports": null, "locked": false, "name": "t1_gi2f2dq", "created": 1609796995.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609768195.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 3, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi2gt1z", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "0toHeroInvesting", "fullname": "t2_8oq1j048"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gi2f2dq", "score": 3, "author_fullname": "t2_8oq1j048", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "nice!", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>nice!</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2gt1z/", "num_reports": null, "locked": false, "name": "t1_gi2gt1z", "created": 1609798131.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609769331.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 2, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kq8hac", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gi2ig0o", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "TheMindfulnessShaman", "fullname": "t2_n6ode"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gi2f2dq", "score": 2, "author_fullname": "t2_n6ode", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Misread that as PLTR. Almost spit out my coffee.", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Misread that as PLTR. Almost spit out my coffee.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kq8hac/stock_market_news_for_today_tsla_nio_lmnd_fubo/gi2ig0o/", "num_reports": null, "locked": false, "name": "t1_gi2ig0o", "created": 1609799143.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609770343.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}