{"approved_at_utc": null, "selftext": "&#x200B;\n\nhttps://preview.redd.it/7mgl68kldl761.png?width=1198&format=png&auto=webp&s=4609f822018e1c0830c53ccf4e65442b4cb3b222\n\nBecause I'm a naturally skeptical person, particularly when anonymity is a feature, I offer proof to avoid any BS below.\n\n**Confessions of a Voyeur:**\n\nI enjoy reading about insanely degenerate \"YOLO\" moves or some of the all-in or bust plays but that's not my style and I suspect not the style of many on here so I thought this might help to see another flavor. Having read and been entertained (and inspired) by some of you who have shared your stories I have decided to do the same to offer a slightly different perspective and I of course do not mean to criticize any other strategies. I actually thank all of you who have shared your gains and losses for our collective entertainment. The big losses especially always help to keep me grounded to a strategy of going after double and triples instead of only grand slams. In fact, quite the opposite and I'll have a few shout-outs that come to mind below.\n\n**A Journey of Five Years to Seven Figures:**\n\nI will keep things brief because I know only a fraction of the membership can read, and then another fraction within that grouping can read more than a few sentences, but I think it's crucial to draw a line in the sand when I really got serious with this goal as 2020 marks the first time I rolled over $1M.\n\nI would say 2015 was the year when I started making what I would deem *good money*, at least in my eyes. A top priority of mine was to pay off all debt (minus a mortgage) and I achieved that. At the end of the year, though, I was lucky enough to be blessed with a CPA who explained something to me which has guided my investing ever since. **He explained how an IRA account works, the different types, and most importantly the fact that taxes are deferred. This is critical to understand if you're serious and I'll cover that below.** At first I thought I was misunderstanding him but long story short, I was not. While I would say that since starting my career I was hyper focused on my business I would also say I was equally focused on tax-minimizing strategies and when I learned about deferring gains until far into the future I was hooked!\n\nAt the very end of 2015 I opened my first two IRA accounts, a Roth IRA and a SEP IRA, and in the first quarter of 2016 I fully funded both to the max.\n\nCandidly, while in life I'm fairly comfortable with risk (I gamble regularly, I ride a motorcycle, business risks, etc) I would say I'm more conservative on the investing side (relative to the degens I find here). The first few years of my investing was essentially comprised of maxing out my annual limits on any IRA I could open (those familiar with Roth and other types will know about AGI thresholds limiting what accounts can be contributed to or not) and utilizing index funds as a form of passive investing.\n\n**Pro Tip #1: If you're not maxing out your IRA accounts annually if you can afford to you're retarded, period. And if you don't have any IRA accounts to invest in after reading this then you might be mega-fucking-retarded.**\n\nAt times I stupidly thought I'd \"time the market\" and I'm embarrassed to say that during this incredible bull market run we've been having since 2010-ish there were occasions where I'd move to cash because I didn't want to have any big drops. I've done a lot of reading on this topic since and I think this was a combo of stupidity first but also the age I was when the 2008/2009 crash happened and how it warped my perception of the stock market in general. Though I have had plenty of losing plays, particularly moments of gay beardom where I'd short companies, the bigger mistake was thinking I had even a slight ability to spot market highs and lows.\n\n**Pro Tip #2: Basically 99.9% of** **~~gamblers~~** **investors have no real ability to consistently time the market.**\n\nIn 2018 I decided to take a more active role in my wealth accumulation and this is where my tax aversion strategies really paid off. Because I had been maxing out every IRA account I could get my hands on (eventually ended up with a SEP, Roth, and solo-401K) I had \\~$200K of contributions through 2017 and once I threw in my full 2018 contributions I was off to the races! Now, not all of my money is in retirement accounts unfortunately and my strategies of plays are largely dependent on the account in which I'm making the play (meaning, plays that are short term in nature are made from retirement accounts and plays that are long term go through my non-retirement accounts).\n\n**Pro Tip #3: The CV19 dip was probably a once in a century type of opportunity. I say this because it happened so fast AND it recovered so insanely fast and strong. Don't expect every year to be like 2020 for investing. Growth I had during CV19 was much more luck than skill.**\n\nThis year was exceptionally lucky for me, and for many others as we've seen, but in my case it was mostly due to the fact that much of money was in cash when Covid really hit in March. Not all of it, unfortunately, but because of my natural tendencies to want to focus on protecting against downside I do tend to have more in cash than most people on a percentage basis. That was beneficial to me this year, in past years not so much, but I think overall for the past several years I might be break even or possibly slightly ahead. But having cash on hand when the market tanked in March was extremely lucky without a doubt.\n\nI would like to dedicate a brief paragraph to luck, a subject that comes up as a throw away a lot here but something that I don't think gets a full amount of appreciation. I have been lucky in life across the board, and in the areas of life that it counts most. In family, in relationships, in friendships, in business, through some close calls I've had on motorcycles, and countless other ways. Investing takes luck as well and that's just to be in the game. Lack of luck definitely happens in investing too so as far as my investing goes I don't attribute much of my growth to luck per se. Instead I would say that being lucky enough to have the support system of great people around me, which is all the luck I could ever ask for, provided me the strength to get through some losses and to have some moderate level of confidence as I started having some wins.\n\n**Journey From Occasional Gay Bear, Frequent Degenerate, and Eventual Consistency:**\n\nI was born a gay bear. By that I mean I am naturally untrusting and that goes for people, studies I read, data I see... you name it I'm skeptical. I believe a certain amount of this is healthy but in investing it's the kiss of death. EVEN WHEN YOU'RE RIGHT, YOU ARE WRONG! By that I mean even if you spot a fraud (think NKLA, KODK, etc) the stock can still go up. Why?? BECAUSE STONKS ONLY GO UP, and amazingly that stupidity is actually true, who woulda thunk??!?!\n\nWhen I became active with my investing I was lucky enough to get burned on some small shorting ideas that all failed to one degree or another. I say lucky because they were small and they happened at the start and so I was then able to learn my lesson and never do that again. Though I have not developed much of a strategy to brag about I can share some (probably obvious) things that have worked best for me:\n\n1. As much as I can control myself to do so, I stay away from options. Frankly, I don't have enough conviction in most of my ideas to be willing to predict both the price and timing of how they'll perform. And I am too lazy to fully learn all of the intricacies needed to be consistent with options.\n2. I don't consider myself particularly skilled at picking up trends so I prefer to place bets on more established mid-caps. Sometimes I think they're getting unjustifiably beat down, sometimes I think they have a bright future and/or the ability to outperform the general market. I do still have my degen moments and I can't help but play around with some smaller companies too.\n\n**Why Taxes Matter With Investing:**\n\nI've already written about this at length so I'd first suggest reading: [Tax Info to Cuck Uncle Sam](https://www.reddit.com/r/wallstreetbets/comments/k4phe2/tax_info_to_cuck_uncle_sam_so_simple_even_a_wsb/)\n\nMyself and other members on here have also pointed this out ad nauseam and yet most of you fucking idiots are still investing in non-qualified Robinhood accounts BUT I WANT TO HELP AT LEAST A FEW PEOPLE. To make a long story short, if you intend on growing an investment account and not using it for your regular life expenses you are a fool if you're not doing this in a tax-advantaged way. I have seen at least a dozen people this year that have turned small sums into 7-figures and to do that within a tax advantaged environment means you would owe $0 this year in extra taxes. Even if you took $10k and turned it into $20K this year, which would be great by the way, then wouldn't it be greater NOT to owe taxes on that short-term gain??\n\nIf you're trading today because you need the money tomorrow then this doesn't apply but a lot of us are trading for fun, or to learn. If your job creates enough income to pay your bills then I think the smart move is to treat your investments as your retirement money when you have no income (beyond measly social security) so it only makes sense to lock it up today in exchange for tax breaks that will compound into huge savings down the road.\n\nMy strong strong strong suggestion would be to have both types of investing accounts, what are known as qualified and non-qualified (aka retirement and non-retirement) accounts. This will allow you to utilize qualified money for your short-term plays (less than 12 months) and your non-qualified money for your plays that are expected to last more than 12 months.\n\n**Treating Investing Like Poker:**\n\nI consider investing to be much like my experience with poker. Before CV19 I played occasional live tournaments and what I learned while doing that has been more important than the obvious stuff above.\n\n* The importance of not getting knocked out. To win a tournament you have to be in the tournament and so a reckless strategy of frequent all-ins is not just risking your buy-in, it's risking your ability to remain in play. ICM is what I believe this formula is known as within the poker world.\n* If I win chips, you lose them. It is a very zero-sum game like that. We celebrate our fellow degens here on WSB as royalty among us but one man's victory is another man's defeat and I feel it is important to always be aware of this just for the sake of empathy.\n* The more people playing the bigger the prize pool. Anybody who has played in a poker tournament before has noticed that the more entrants the more the total prize pool grows. This seems to be the same with the market because the more appetite retail and institutional investors have to participate in the market the more companies want to go public to take advantage of that appetite. This means the winners win bigger, but interestingly, the losers don't lose bigger. IE unless you buy in more than once (which is why I don't risk going bust), a loser only loses one buy-in but the winner (or those that place in the Top 10) gets the benefit of all of those losers' buy-ins making up a bigger final score.\n* THIS IS THE IMPORTANT ONE: You don't have to win First Place to make money. In general you can place anywhere in the Top 10% and typically double your money, or better.\n\n**Brief Catalogue of The Winners & Losers:**\n\nI place this last because I don't think it's very important but some of the tickers I did best on were JD, PDD, SQ, LUV, CHWY, CCL, PLTR, CRM and more recently I've been dabbling with SPACS. I'm also part of the GME gang now because of WSB and so far I couldn't be happier! The degen in me still awakens occasionally. I still hold some of those and that's not a complete list. My biggest losses came from shorting HLF and shares of NAT, CHK, and a few others I can't remember. Perhaps it's PTSD that I can't remember.\n\n**My Final Reflection & Perspective For Those Who Are Still Reading:**\n\nMore than anything else I'd like any reader of this post to realize that doubling or tripling your money is hard, but it's a lot easier than making 10X or 20X or 50X like some on here have been fortunate to do. **In fact, even doubling or tripling your money over a period of a few years is fucking hard!** I fear that people see a handful of individuals make 10X, 25X, 50X, etc and then think they're \"doing something wrong\" or feel inclined to take obscene risks in an attempt to duplicate that pattern and I frankly feel it's a fools errand. Admittedly I enjoy reading about those plays too, and I give props to those Gods of Investing who walk amongst us mortals, but I like watching high stakes poker and yet I realize that I am unlikely to ever be playing in those games because of my tolerance for risk. AND THAT IS OKAY! My goal is not to be a billionaire. My goal is to be happy in life and enjoy the company of those most important to me and that's what I was doing before I hit the 7-figure mark and that's what I'll be doing as I continue to (hopefully) grow my portfolio bigger. My main strategy as always will be to not lose money as much as possible and to happily take a 25-30% gain vs. always chasing the clouds.\n\nTo some honorable mentions:\n\n[u/sir\\_jacks\\_a\\_lot](https://www.reddit.com/u/sir_jacks_a_lot/) is one of the few geniuses on here trading in a retirement account and you should all want to be like him/her when you grow up for many reasons. [u/glideoutside](https://www.reddit.com/u/glideoutside/) has been inspirational and has led plenty of people to gains with insightful ideas. [u/poland\\_spring10](https://www.reddit.com/u/poland_spring10/) reminded me just the other day that \"Scared Money Don't Make Money\" and while I am fine with being cautious it had been awhile since I had heard that and he/she was right and I needed that before 2021. [u/vitocorlene](https://www.reddit.com/u/vitocorlene/) for some excellent DD on MT and the steel industry in particular.\n\nI wish I could remember who posted the techno cat and bongo meme yesterday because that shit was great too! And to so many of the rest of you whose screen names I can't remember now but who have shared huge gains, huge losses, and own the fact that you may end up holding huge bags on some of these autist meme stonks and don't give a shit about it anyway. I am jealous of those of you who can stomach going all-in on some of the dumbest shit I have ever seen and I sincerely applaud your willingness to go big or go home, especially those of using margin or loans which is just amazing to watch. I wish EVERYBODY a prosperous 2021. If 2020 was a good year for you I hope you keep it up. If 2020 sucked than don't worry about it, 2021 starts next week.\n\n**A therapist once said to me that your past doesn't dictate your future. She was right. Do your best, don't try to keep up with others, find strategies that work for you, try to match your conviction of a play with your tolerance for risk, and if you have a good idea of a double or triple for 2021 slide into my DMs :-)**", "author_fullname": "t2_1m9l3i07", "saved": false, "mod_reason_title": null, "gilded": 0, "clicked": false, "title": "Path to 7-Figures, The Unsexy Way", "link_flair_richtext": [{"e": "text", "t": "Storytime"}], "subreddit_name_prefixed": "r/wallstreetbets", "hidden": false, "pwls": 7, "link_flair_css_class": "storytime", "downs": 0, "thumbnail_height": 45, "top_awarded_type": null, "hide_score": true, "media_metadata": {"7mgl68kldl761": {"status": "valid", "e": "Image", "m": "image/png", "p": [{"y": 35, "x": 108, "u": "https://preview.redd.it/7mgl68kldl761.png?width=108&crop=smart&auto=webp&s=c99ba1c8e78b56dcab3a981144e2537e4824bf6b"}, {"y": 70, "x": 216, "u": "https://preview.redd.it/7mgl68kldl761.png?width=216&crop=smart&auto=webp&s=4df32c02b621227ad47b24b5ed6971c57290c8eb"}, {"y": 104, "x": 320, "u": "https://preview.redd.it/7mgl68kldl761.png?width=320&crop=smart&auto=webp&s=9d8eae6e3e22ec4d21d141af2c5a3cd03d9634e0"}, {"y": 208, "x": 640, "u": "https://preview.redd.it/7mgl68kldl761.png?width=640&crop=smart&auto=webp&s=92fead8b0a58854ec50b5fbf9205559da2fe44b7"}, {"y": 312, "x": 960, "u": "https://preview.redd.it/7mgl68kldl761.png?width=960&crop=smart&auto=webp&s=d0005fc46d9d138c1009da8913f7dfb946a4b509"}, {"y": 351, "x": 1080, "u": "https://preview.redd.it/7mgl68kldl761.png?width=1080&crop=smart&auto=webp&s=2b7057c7ee0ea0bbd82648540f2abdf3dd1ebb45"}], "s": {"y": 390, "x": 1198, "u": "https://preview.redd.it/7mgl68kldl761.png?width=1198&format=png&auto=webp&s=4609f822018e1c0830c53ccf4e65442b4cb3b222"}, "id": "7mgl68kldl761"}}, "name": "t3_kkped2", "quarantine": false, "link_flair_text_color": "light", "upvote_ratio": 0.8, "author_flair_background_color": "", "subreddit_type": "public", "ups": 33, "total_awards_received": 0, "media_embed": {}, "thumbnail_width": 140, "author_flair_template_id": null, "is_original_content": false, "user_reports": [], "secure_media": null, "is_reddit_media_domain": false, "is_meta": false, "category": null, "secure_media_embed": {}, "link_flair_text": "Storytime", "can_mod_post": false, "score": 33, "approved_by": null, "author_premium": false, "thumbnail": "https://b.thumbs.redditmedia.com/gzk1wRnvRgf_Qlk6uvwHgBT7J9ocJ3ikUFV77W7MH2A.jpg", "edited": false, "author_flair_css_class": null, "author_flair_richtext": [{"e": "text", "t": "\u001b201113:14:1"}], "gildings": {}, "content_categories": null, "is_self": true, "mod_note": null, "created": 1609043662.0, "link_flair_type": "richtext", "wls": 7, "removed_by_category": null, "banned_by": null, "author_flair_type": "richtext", "domain": "self.wallstreetbets", "allow_live_comments": false, "selftext_html": "<!-- SC_OFF --><div class=\"md\"><p>&#x200B;</p>\n\n<p><a href=\"https://preview.redd.it/7mgl68kldl761.png?width=1198&amp;format=png&amp;auto=webp&amp;s=4609f822018e1c0830c53ccf4e65442b4cb3b222\">https://preview.redd.it/7mgl68kldl761.png?width=1198&amp;format=png&amp;auto=webp&amp;s=4609f822018e1c0830c53ccf4e65442b4cb3b222</a></p>\n\n<p>Because I&#39;m a naturally skeptical person, particularly when anonymity is a feature, I offer proof to avoid any BS below.</p>\n\n<p><strong>Confessions of a Voyeur:</strong></p>\n\n<p>I enjoy reading about insanely degenerate &quot;YOLO&quot; moves or some of the all-in or bust plays but that&#39;s not my style and I suspect not the style of many on here so I thought this might help to see another flavor. Having read and been entertained (and inspired) by some of you who have shared your stories I have decided to do the same to offer a slightly different perspective and I of course do not mean to criticize any other strategies. I actually thank all of you who have shared your gains and losses for our collective entertainment. The big losses especially always help to keep me grounded to a strategy of going after double and triples instead of only grand slams. In fact, quite the opposite and I&#39;ll have a few shout-outs that come to mind below.</p>\n\n<p><strong>A Journey of Five Years to Seven Figures:</strong></p>\n\n<p>I will keep things brief because I know only a fraction of the membership can read, and then another fraction within that grouping can read more than a few sentences, but I think it&#39;s crucial to draw a line in the sand when I really got serious with this goal as 2020 marks the first time I rolled over $1M.</p>\n\n<p>I would say 2015 was the year when I started making what I would deem <em>good money</em>, at least in my eyes. A top priority of mine was to pay off all debt (minus a mortgage) and I achieved that. At the end of the year, though, I was lucky enough to be blessed with a CPA who explained something to me which has guided my investing ever since. <strong>He explained how an IRA account works, the different types, and most importantly the fact that taxes are deferred. This is critical to understand if you&#39;re serious and I&#39;ll cover that below.</strong> At first I thought I was misunderstanding him but long story short, I was not. While I would say that since starting my career I was hyper focused on my business I would also say I was equally focused on tax-minimizing strategies and when I learned about deferring gains until far into the future I was hooked!</p>\n\n<p>At the very end of 2015 I opened my first two IRA accounts, a Roth IRA and a SEP IRA, and in the first quarter of 2016 I fully funded both to the max.</p>\n\n<p>Candidly, while in life I&#39;m fairly comfortable with risk (I gamble regularly, I ride a motorcycle, business risks, etc) I would say I&#39;m more conservative on the investing side (relative to the degens I find here). The first few years of my investing was essentially comprised of maxing out my annual limits on any IRA I could open (those familiar with Roth and other types will know about AGI thresholds limiting what accounts can be contributed to or not) and utilizing index funds as a form of passive investing.</p>\n\n<p><strong>Pro Tip #1: If you&#39;re not maxing out your IRA accounts annually if you can afford to you&#39;re retarded, period. And if you don&#39;t have any IRA accounts to invest in after reading this then you might be mega-fucking-retarded.</strong></p>\n\n<p>At times I stupidly thought I&#39;d &quot;time the market&quot; and I&#39;m embarrassed to say that during this incredible bull market run we&#39;ve been having since 2010-ish there were occasions where I&#39;d move to cash because I didn&#39;t want to have any big drops. I&#39;ve done a lot of reading on this topic since and I think this was a combo of stupidity first but also the age I was when the 2008/2009 crash happened and how it warped my perception of the stock market in general. Though I have had plenty of losing plays, particularly moments of gay beardom where I&#39;d short companies, the bigger mistake was thinking I had even a slight ability to spot market highs and lows.</p>\n\n<p><strong>Pro Tip #2: Basically 99.9% of</strong> <strong><del>gamblers</del></strong> <strong>investors have no real ability to consistently time the market.</strong></p>\n\n<p>In 2018 I decided to take a more active role in my wealth accumulation and this is where my tax aversion strategies really paid off. Because I had been maxing out every IRA account I could get my hands on (eventually ended up with a SEP, Roth, and solo-401K) I had ~$200K of contributions through 2017 and once I threw in my full 2018 contributions I was off to the races! Now, not all of my money is in retirement accounts unfortunately and my strategies of plays are largely dependent on the account in which I&#39;m making the play (meaning, plays that are short term in nature are made from retirement accounts and plays that are long term go through my non-retirement accounts).</p>\n\n<p><strong>Pro Tip #3: The CV19 dip was probably a once in a century type of opportunity. I say this because it happened so fast AND it recovered so insanely fast and strong. Don&#39;t expect every year to be like 2020 for investing. Growth I had during CV19 was much more luck than skill.</strong></p>\n\n<p>This year was exceptionally lucky for me, and for many others as we&#39;ve seen, but in my case it was mostly due to the fact that much of money was in cash when Covid really hit in March. Not all of it, unfortunately, but because of my natural tendencies to want to focus on protecting against downside I do tend to have more in cash than most people on a percentage basis. That was beneficial to me this year, in past years not so much, but I think overall for the past several years I might be break even or possibly slightly ahead. But having cash on hand when the market tanked in March was extremely lucky without a doubt.</p>\n\n<p>I would like to dedicate a brief paragraph to luck, a subject that comes up as a throw away a lot here but something that I don&#39;t think gets a full amount of appreciation. I have been lucky in life across the board, and in the areas of life that it counts most. In family, in relationships, in friendships, in business, through some close calls I&#39;ve had on motorcycles, and countless other ways. Investing takes luck as well and that&#39;s just to be in the game. Lack of luck definitely happens in investing too so as far as my investing goes I don&#39;t attribute much of my growth to luck per se. Instead I would say that being lucky enough to have the support system of great people around me, which is all the luck I could ever ask for, provided me the strength to get through some losses and to have some moderate level of confidence as I started having some wins.</p>\n\n<p><strong>Journey From Occasional Gay Bear, Frequent Degenerate, and Eventual Consistency:</strong></p>\n\n<p>I was born a gay bear. By that I mean I am naturally untrusting and that goes for people, studies I read, data I see... you name it I&#39;m skeptical. I believe a certain amount of this is healthy but in investing it&#39;s the kiss of death. EVEN WHEN YOU&#39;RE RIGHT, YOU ARE WRONG! By that I mean even if you spot a fraud (think NKLA, KODK, etc) the stock can still go up. Why?? BECAUSE STONKS ONLY GO UP, and amazingly that stupidity is actually true, who woulda thunk??!?!</p>\n\n<p>When I became active with my investing I was lucky enough to get burned on some small shorting ideas that all failed to one degree or another. I say lucky because they were small and they happened at the start and so I was then able to learn my lesson and never do that again. Though I have not developed much of a strategy to brag about I can share some (probably obvious) things that have worked best for me:</p>\n\n<ol>\n<li>As much as I can control myself to do so, I stay away from options. Frankly, I don&#39;t have enough conviction in most of my ideas to be willing to predict both the price and timing of how they&#39;ll perform. And I am too lazy to fully learn all of the intricacies needed to be consistent with options.</li>\n<li>I don&#39;t consider myself particularly skilled at picking up trends so I prefer to place bets on more established mid-caps. Sometimes I think they&#39;re getting unjustifiably beat down, sometimes I think they have a bright future and/or the ability to outperform the general market. I do still have my degen moments and I can&#39;t help but play around with some smaller companies too.</li>\n</ol>\n\n<p><strong>Why Taxes Matter With Investing:</strong></p>\n\n<p>I&#39;ve already written about this at length so I&#39;d first suggest reading: <a href=\"https://www.reddit.com/r/wallstreetbets/comments/k4phe2/tax_info_to_cuck_uncle_sam_so_simple_even_a_wsb/\">Tax Info to Cuck Uncle Sam</a></p>\n\n<p>Myself and other members on here have also pointed this out ad nauseam and yet most of you fucking idiots are still investing in non-qualified Robinhood accounts BUT I WANT TO HELP AT LEAST A FEW PEOPLE. To make a long story short, if you intend on growing an investment account and not using it for your regular life expenses you are a fool if you&#39;re not doing this in a tax-advantaged way. I have seen at least a dozen people this year that have turned small sums into 7-figures and to do that within a tax advantaged environment means you would owe $0 this year in extra taxes. Even if you took $10k and turned it into $20K this year, which would be great by the way, then wouldn&#39;t it be greater NOT to owe taxes on that short-term gain??</p>\n\n<p>If you&#39;re trading today because you need the money tomorrow then this doesn&#39;t apply but a lot of us are trading for fun, or to learn. If your job creates enough income to pay your bills then I think the smart move is to treat your investments as your retirement money when you have no income (beyond measly social security) so it only makes sense to lock it up today in exchange for tax breaks that will compound into huge savings down the road.</p>\n\n<p>My strong strong strong suggestion would be to have both types of investing accounts, what are known as qualified and non-qualified (aka retirement and non-retirement) accounts. This will allow you to utilize qualified money for your short-term plays (less than 12 months) and your non-qualified money for your plays that are expected to last more than 12 months.</p>\n\n<p><strong>Treating Investing Like Poker:</strong></p>\n\n<p>I consider investing to be much like my experience with poker. Before CV19 I played occasional live tournaments and what I learned while doing that has been more important than the obvious stuff above.</p>\n\n<ul>\n<li>The importance of not getting knocked out. To win a tournament you have to be in the tournament and so a reckless strategy of frequent all-ins is not just risking your buy-in, it&#39;s risking your ability to remain in play. ICM is what I believe this formula is known as within the poker world.</li>\n<li>If I win chips, you lose them. It is a very zero-sum game like that. We celebrate our fellow degens here on WSB as royalty among us but one man&#39;s victory is another man&#39;s defeat and I feel it is important to always be aware of this just for the sake of empathy.</li>\n<li>The more people playing the bigger the prize pool. Anybody who has played in a poker tournament before has noticed that the more entrants the more the total prize pool grows. This seems to be the same with the market because the more appetite retail and institutional investors have to participate in the market the more companies want to go public to take advantage of that appetite. This means the winners win bigger, but interestingly, the losers don&#39;t lose bigger. IE unless you buy in more than once (which is why I don&#39;t risk going bust), a loser only loses one buy-in but the winner (or those that place in the Top 10) gets the benefit of all of those losers&#39; buy-ins making up a bigger final score.</li>\n<li>THIS IS THE IMPORTANT ONE: You don&#39;t have to win First Place to make money. In general you can place anywhere in the Top 10% and typically double your money, or better.</li>\n</ul>\n\n<p><strong>Brief Catalogue of The Winners &amp; Losers:</strong></p>\n\n<p>I place this last because I don&#39;t think it&#39;s very important but some of the tickers I did best on were JD, PDD, SQ, LUV, CHWY, CCL, PLTR, CRM and more recently I&#39;ve been dabbling with SPACS. I&#39;m also part of the GME gang now because of WSB and so far I couldn&#39;t be happier! The degen in me still awakens occasionally. I still hold some of those and that&#39;s not a complete list. My biggest losses came from shorting HLF and shares of NAT, CHK, and a few others I can&#39;t remember. Perhaps it&#39;s PTSD that I can&#39;t remember.</p>\n\n<p><strong>My Final Reflection &amp; Perspective For Those Who Are Still Reading:</strong></p>\n\n<p>More than anything else I&#39;d like any reader of this post to realize that doubling or tripling your money is hard, but it&#39;s a lot easier than making 10X or 20X or 50X like some on here have been fortunate to do. <strong>In fact, even doubling or tripling your money over a period of a few years is fucking hard!</strong> I fear that people see a handful of individuals make 10X, 25X, 50X, etc and then think they&#39;re &quot;doing something wrong&quot; or feel inclined to take obscene risks in an attempt to duplicate that pattern and I frankly feel it&#39;s a fools errand. Admittedly I enjoy reading about those plays too, and I give props to those Gods of Investing who walk amongst us mortals, but I like watching high stakes poker and yet I realize that I am unlikely to ever be playing in those games because of my tolerance for risk. AND THAT IS OKAY! My goal is not to be a billionaire. My goal is to be happy in life and enjoy the company of those most important to me and that&#39;s what I was doing before I hit the 7-figure mark and that&#39;s what I&#39;ll be doing as I continue to (hopefully) grow my portfolio bigger. My main strategy as always will be to not lose money as much as possible and to happily take a 25-30% gain vs. always chasing the clouds.</p>\n\n<p>To some honorable mentions:</p>\n\n<p><a href=\"https://www.reddit.com/u/sir_jacks_a_lot/\">u/sir_jacks_a_lot</a> is one of the few geniuses on here trading in a retirement account and you should all want to be like him/her when you grow up for many reasons. <a href=\"https://www.reddit.com/u/glideoutside/\">u/glideoutside</a> has been inspirational and has led plenty of people to gains with insightful ideas. <a href=\"https://www.reddit.com/u/poland_spring10/\">u/poland_spring10</a> reminded me just the other day that &quot;Scared Money Don&#39;t Make Money&quot; and while I am fine with being cautious it had been awhile since I had heard that and he/she was right and I needed that before 2021. <a href=\"https://www.reddit.com/u/vitocorlene/\">u/vitocorlene</a> for some excellent DD on MT and the steel industry in particular.</p>\n\n<p>I wish I could remember who posted the techno cat and bongo meme yesterday because that shit was great too! And to so many of the rest of you whose screen names I can&#39;t remember now but who have shared huge gains, huge losses, and own the fact that you may end up holding huge bags on some of these autist meme stonks and don&#39;t give a shit about it anyway. I am jealous of those of you who can stomach going all-in on some of the dumbest shit I have ever seen and I sincerely applaud your willingness to go big or go home, especially those of using margin or loans which is just amazing to watch. I wish EVERYBODY a prosperous 2021. If 2020 was a good year for you I hope you keep it up. If 2020 sucked than don&#39;t worry about it, 2021 starts next week.</p>\n\n<p><strong>A therapist once said to me that your past doesn&#39;t dictate your future. She was right. Do your best, don&#39;t try to keep up with others, find strategies that work for you, try to match your conviction of a play with your tolerance for risk, and if you have a good idea of a double or triple for 2021 slide into my DMs :-)</strong></p>\n</div><!-- SC_ON -->", "likes": null, "suggested_sort": "confidence", "banned_at_utc": null, "view_count": null, "archived": false, "no_follow": false, "is_crosspostable": false, "pinned": false, "over_18": false, "all_awardings": [], "awarders": [], "media_only": false, "link_flair_template_id": "f86d7f4a-4e9b-11e9-a6f9-0e03190c749e", "can_gild": false, "spoiler": false, "locked": false, "author_flair_text": "\u001b201113:14:1", "treatment_tags": [], "visited": false, "removed_by": null, "num_reports": null, "distinguished": null, "subreddit_id": "t5_2th52", "mod_reason_by": null, "removal_reason": null, "link_flair_background_color": "#9e8d49", "id": "kkped2", "is_robot_indexable": true, "report_reasons": null, "author": {"name": "FUPeiMe", "fullname": "t2_1m9l3i07"}, "discussion_type": null, "num_comments": 27, "send_replies": false, "whitelist_status": "some_ads", "contest_mode": false, "mod_reports": [], "author_patreon_flair": false, "author_flair_text_color": "dark", "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/", "parent_whitelist_status": "some_ads", "stickied": false, "url": "https://www.reddit.com/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/", "subreddit_subscribers": 1744216, "created_utc": 1609014862.0, "num_crossposts": 0, "media": null, "is_video": false, "comment_limit": 2048, "comment_sort": "confidence", "comments": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 10, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3pvbp", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "OTM0DTE", "fullname": "t2_7hl3kwno"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kkped2", "score": 10, "author_fullname": "t2_7hl3kwno", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "I usually read these, but stopped at 5 years to 7 figures.", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>I usually read these, but stopped at 5 years to 7 figures.</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3pvbp/", "num_reports": null, "locked": false, "name": "t1_gh3pvbp", "created": 1609044985.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609016185.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3tmyd", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "the_corporate_slave", "fullname": "t2_5nut5qqo"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gh3pvbp", "score": 1, "author_fullname": "t2_5nut5qqo", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Haha literally what I was going to comment. Congrats OP but I want seven figures in less than 1.5 years", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Haha literally what I was going to comment. Congrats OP but I want seven figures in less than 1.5 years</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3tmyd/", "num_reports": null, "locked": false, "name": "t1_gh3tmyd", "created": 1609047229.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609018429.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 1, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3shfo", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": true, "author": {"name": "mondaysomeday", "fullname": "t2_3p72lnfi"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gh3pvbp", "score": 1, "author_fullname": "t2_3p72lnfi", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "not everyone wants 5 min to 7 dollars like you...", "edited": false, "author_flair_css_class": null, "is_submitter": false, "downs": 0, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>not everyone wants 5 min to 7 dollars like you...</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3shfo/", "num_reports": null, "locked": false, "name": "t1_gh3shfo", "created": 1609046541.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609017741.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 15, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3nxrf", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "iamthetimby", "fullname": "t2_5m3qa2gp"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kkped2", "score": 15, "author_fullname": "t2_5m3qa2gp", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Lot of words but even the retard in me knows you are giving very good advice", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [{"e": "text", "t": "\u001b201222:2:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Lot of words but even the retard in me knows you are giving very good advice</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3nxrf/", "num_reports": null, "locked": false, "name": "t1_gh3nxrf", "created": 1609043839.0, "author_flair_text": "\u001b201222:2:1", "treatment_tags": [], "created_utc": 1609015039.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}, {"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 7, "author_flair_type": "text", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3o03a", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "FartyCakes12", "fullname": "t2_4y64krfb"}, "can_mod_post": false, "send_replies": true, "parent_id": "t3_kkped2", "score": 7, "author_fullname": "t2_4y64krfb", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "body": "Hey chief, I aint reading that. TLDR MT 30c 19MAR2021?", "edited": false, "downs": 0, "author_flair_css_class": null, "is_submitter": false, "collapsed": false, "author_flair_richtext": [], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Hey chief, I aint reading that. TLDR MT 30c 19MAR2021?</p>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": true, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": null, "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3o03a/", "num_reports": null, "locked": false, "name": "t1_gh3o03a", "created": 1609043877.0, "author_flair_text": null, "treatment_tags": [], "created_utc": 1609015077.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 0, "author_flair_background_color": null, "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": [{"total_awards_received": 0, "approved_at_utc": null, "comment_type": null, "awarders": [], "mod_reason_by": null, "banned_by": null, "ups": 6, "author_flair_type": "richtext", "removal_reason": null, "link_id": "t3_kkped2", "author_flair_template_id": null, "likes": null, "user_reports": [], "saved": false, "id": "gh3prv6", "banned_at_utc": null, "mod_reason_title": null, "gilded": 0, "archived": false, "no_follow": false, "author": {"name": "FUPeiMe", "fullname": "t2_1m9l3i07"}, "can_mod_post": false, "send_replies": true, "parent_id": "t1_gh3o03a", "score": 6, "author_fullname": "t2_1m9l3i07", "report_reasons": null, "approved_by": null, "all_awardings": [], "subreddit_id": "t5_2th52", "collapsed": false, "body": "Wuddup playa! I'm holding:\n\n* 150 June 18 $25c\n* 20 June 18 $27c\n* 20 June 18 $28c\n* 6 June 18 $30c", "edited": false, "author_flair_css_class": null, "is_submitter": true, "downs": 0, "author_flair_richtext": [{"e": "text", "t": "\u001b201113:14:1"}], "author_patreon_flair": false, "body_html": "<div class=\"md\"><p>Wuddup playa! I&#39;m holding:</p>\n\n<ul>\n<li>150 June 18 $25c</li>\n<li>20 June 18 $27c</li>\n<li>20 June 18 $28c</li>\n<li>6 June 18 $30c</li>\n</ul>\n</div>", "gildings": {}, "collapsed_reason": null, "associated_award": null, "stickied": false, "author_premium": false, "subreddit_type": "public", "can_gild": true, "top_awarded_type": null, "author_flair_text_color": "dark", "score_hidden": false, "permalink": "/r/wallstreetbets/comments/kkped2/path_to_7figures_the_unsexy_way/gh3prv6/", "num_reports": null, "locked": false, "name": "t1_gh3prv6", "created": 1609044928.0, "author_flair_text": "\u001b201113:14:1", "treatment_tags": [], "created_utc": 1609016128.0, "subreddit_name_prefixed": "r/wallstreetbets", "controversiality": 0, "depth": 1, "author_flair_background_color": "", "collapsed_because_crowd_control": null, "mod_reports": [], "mod_note": null, "distinguished": null, "replies": []}]}]}